{"original_text": "I was on Skype on my tablet as I went to the toilet IMing a friend. I don't multitask very well, so I forgot one of the most important things to do before pooping. I think the best part was when I realised and told my mate who just freaked out because I was talking to him on the John!", "tldr": null, "summary_text": "went to the toilet on skype with a friend. forgot to turn off skype before pooping. mate freaked out when he saw me talking to him on the phone.", "rougescores": null, "compression_ratio": 0.5052631578947369, "original_pos_tags": {"PRP": 8, "VBD": 6, "IN": 8, "NNP": 2, "PRP$": 2, "NN": 5, "TO": 3, "DT": 5, "VBG": 3, ".": 3, "VBP": 3, "RB": 4, "VB": 2, ",": 1, "CD": 1, "RBS": 1, "JJ": 1, "NNS": 1, "JJS": 1, "WRB": 1, "CC": 1, "WP": 1, "VBN": 1, "RP": 1}, "summary_pos_tags": {"VBD": 3, "TO": 3, "DT": 3, "NN": 5, "IN": 4, ".": 3, "VB": 2, "RP": 2, "VBG": 2, "VBN": 1, "WRB": 1, "PRP": 3}}
{"original_text": "This actually happened a couple of years ago. I grew up in Germany where I went to a German secondary school that went from 5th to 13th grade (we still had 13 grades then, they have since changed that). My school was named after Anne Frank and we had a club that I was very active in from 9th grade on, which was dedicated to teaching incoming 5th graders about Anne Franks life, discrimination, anti-semitism, Hitler, the Third Reich and that whole Spiel. Basically a day where the students' classes are cancelled and instead we give them an interactive history and social studies class with lots of activities and games. \n\nThis was my last year at school and I already had a lot of experience doing these project days with the kids. I was running the thing with a friend, so it was just the two of us and 30-something 5th graders. We start off with a brief introduction and brainstorming: what do they know about Anne Frank and the Third Reich? You'd be surprised how much they know. Anyway after the brainstorming we do a few activities, and then we take a short break. After the break we split the class into two groups to make it easier to handle. One group watches a short movie about Anne Frank while the other gets a tour through our poster presentation that our student group has been perfecting over the years. Then the groups switch. \n\nI'm in the classroom to show my group the movie and I take attendance to make sure no one decided to run away during break. I'm going down the list when I come to the name Sandra (name changed). A kid with a boyish haircut and a somewhat deeper voice, wearing clothes from the boy's section at a big clothing chain in Germany, pipes up. \n\nNow keep in mind, these are all 11 year olds, they are all pre-pubescent, their bodies are not yet showing any sex specific features one would be able to see while they are fully clothed (e.g. boobs, beards,...). This being a 5th grade in the rather conservative (for German standards) Bavaria, I was confused. I looked down at the list again making sure I had read the name right. Look back up at the kid. \n\nMe: \"You're Sandra?\"\n\nKid: \"Yep.\"\n\nMe: \"Oh, sorry. *Thinking the kid must be from somewhere where Sandra is both a girl's and boy's name* Where are you from? I've only ever heard that as a girl's name before.\"\n\nThe class starts laughing. Sandra gets really quiet. \"I am a girl...\" she says. Some of the other students start saying that their parents made the same mistake when they met Sandra. I feel so sorry and stupid. I get the class to calm down and finish taking attendance. We watch the movie in silence. After the movie, when we walked down to where the poster presentation took place I apologised to Sandra. I felt so incredibly terrible, I still do to this day. Throughout the rest of the day I heard lots of whispers about Sandra. I tried to stop them whenever they came up, but there was no stopping the 5th grade gossip I had set in motion.\n\nSandra, if you're out there, I am so incredibly sorry for humiliating you in front of your class. I hope you are happy and healthy and continue to live your life the way you like. Don't let anyone tell you you have to dress or act a certain way just because of the body parts you were born with. I'm sorry if I made you feel like you were wrong for dressing and acting differently. I'm sorry I probably made that day hell for you. I'm sorry for my ignorance.\n\n**TL;DR: Confuse a 5th grade girl for a boy in front of half of her class. Kids are mean. Sorry Sandra.**", "tldr": " confuse a 5th grade girl for a boy in front of half of her class. kids are mean. sorry sandra.**", "summary_text": "tried to teach 5th graders about the holocaust by showing them a movie about the holocaust, but accidentally showed them a video of a girl having sex with a boy.", "rougescores": [{"rouge-1": {"f": 0.23529411280276827, "p": 0.2, "r": 0.2857142857142857}, "rouge-2": {"f": 0.040816321699292536, "p": 0.034482758620689655, "r": 0.05}, "rouge-l": {"f": 0.18604650669551123, "p": 0.16666666666666666, "r": 0.21052631578947367}}], "compression_ratio": 0.04580369843527738, "original_pos_tags": {"DT": 71, "RB": 43, "VBD": 32, "NN": 99, "IN": 73, "NNS": 27, ".": 45, "PRP": 64, "RP": 6, "NNP": 30, "WRB": 10, "TO": 17, "JJ": 40, "WDT": 2, "CD": 12, "(": 4, ",": 22, "VBP": 38, "VBN": 12, ")": 4, "PRP$": 11, "CC": 20, "VBG": 18, "POS": 5, ":": 8, "WP": 1, "VB": 22, "MD": 3, "JJR": 1, "VBZ": 10, "``": 4, "''": 4, "FW": 1, "UH": 1, "EX": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "VB": 1, "CD": 1, "NNS": 1, "IN": 5, "DT": 6, "NN": 7, "VBG": 2, "PRP": 2, ",": 1, "CC": 1, "RB": 1, "VBD": 1, ".": 1}}
{"original_text": "I tend to leave half-drank beers in my garage. Usually no more than a day old, often I'll end up finishing them off the next day. Last night there was a millipede outbreak. Little buggers were everywhere, including my beer when I drank it today. Burned my mouth, firehosing it all over myself, the walls, and the ground didn't help matters much, either.", "tldr": null, "summary_text": "left half-drank beer in garage, got millipede, drank it, burned my mouth, walls, and ground, and the ground didn't help matters.", "rougescores": null, "compression_ratio": 0.3626062322946176, "original_pos_tags": {"PRP": 7, "VBP": 1, "TO": 1, "VB": 3, "JJ": 6, "NNS": 4, "IN": 3, "PRP$": 3, "NN": 9, ".": 5, "RB": 6, "DT": 7, "JJR": 1, ",": 6, "MD": 1, "RP": 2, "VBG": 3, "EX": 1, "VBD": 4, "WRB": 1, "VBN": 1, "CC": 1}, "summary_pos_tags": {"VBN": 1, "JJ": 1, "NN": 5, "IN": 1, ",": 6, "VBD": 4, "RB": 2, "PRP": 1, "PRP$": 1, "NNS": 2, "CC": 2, "DT": 1, "VB": 1, ".": 1}}
{"original_text": "It was last October, but I'm feeling the fall-out from it the most today.  \n\nAfter my mom died from cancer last year, I started looking for my estranged father.  I had only known him for a short time when I was 6 and barely remembered more than his name.  I never knew why he left and my mom would not talk about him without obvious emotional pain, so I didn't push her for information about him.  I figured he didn't care about us.\n\nI had googled him multiple times over the years, but he was always unlisted and I didn't have an address with which to search.  After her death, I felt strongly that he should at least know that she died and that I have a beautiful little girl.  It felt wrong that he might be out there somewhere knowing nothing about us.\nI googled him again and came up with a phone number and address that seemed realistic.  I called, figuring it was going to be another person by the same name since I'd already experienced that several times while looking for him.  It wasn't.\n\nI had no idea how he would react to me, but he was ecstatic.  He told me that he had been a horrible alcoholic and that he didn't pursue custody of me because he felt himself to be selfish and unstable.  He said he knew that my mom and my family would love me and take wonderful care of me (he was right about that!  My mom was the best woman I've ever known).\n\nSo, we started talking and skyping.  We spent a lot of time learning about each other. Knowing how he had hurt my mom and bailed on me made it difficult to see him as the person he has grown to be, but I tried to believe that people can change for the better.  \n\nHe was exactly everything I needed in a father my entire life:  supportive, sweet, funny, loving.  Eventually, I told him that I loved him after months of talking with him.  He was over-the-moon.\n\nFast-forward to actually meeting him in person.  This is the part where, without knowing my dad or me, you might feel that I sound like an ass.  I say this because I don't have a precise reason or event that I can point to as to why I don't trust him.  Why he actually makes me really nervous.\n\nMy dad is really touchy and hovers all of the time.  He doesn't smell clean and his teeth are rotting and crumbled.  He doesn't give personal space and, when I spent a couple of nights staying at his trailer, he kept coming in to my room to check on me while I was sleeping.  He said that he was just so excited to have me there that he couldn't help it, but I really felt uncomfortable with it.  I couldn't sleep and was so glad that I didn't even consider bringing my daughter without spending time with him first.\n\nHe also asked me if he could kiss me on the mouth because his family does.  I said \"no\" and he accepted that, but the constant touchiness continued.  It wasn't anything strictly inappropriate, but it made my skin crawl.  \nI've spent very little actual time with him in person, maybe 2 weeks total over several trips.  I have, however, talked with him for countless hours on the phone and skype.  \n\nDuring the most acute months of grieving for my mom, he was so devoted to me, trying to talk me through whatever he could.  I was so grateful for it that I kept ignoring details about his character that really concerned me.  He actually demanded a lot of my time, like hours and hours every day and would get upset if I cited my daughter and husband as reasons that I needed to chill with the phone.  He never paid my mom child support and obviously was never there for us my entire life.  He also evaded taxes and told me he had been to court 9 times and jail once.  \n\nAgain, I know people can change, but at this point, I find myself wanting less contact with him.  The idea of him spending any time with my daughter alone is out of the question and my husband feels the same concerns.  I don't want to hurt him, but I just can't trust him.  I don't even know if I'm asking for advice or confessing to being stupid and rushing into something that will hurt someone.\n\nThank you for reading and I sincerely want to wish all the wonderful father's out there a very Happy Father's Day!\n\nETA:  TL;DR  I found my estranged Dad, thought I loved him after getting to know him, got to know him better and changed my mind.\n\n", "tldr": "  i found my estranged dad, thought i loved him after getting to know him, got to know him better and changed my mind.", "summary_text": "i met my dad for the first time in my entire life and i feel like an ass because i don't know why i don't trust him.", "rougescores": [{"rouge-1": {"f": 0.27999999503200007, "p": 0.25925925925925924, "r": 0.30434782608695654}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.1999999950500001, "p": 0.18181818181818182, "r": 0.2222222222222222}}], "compression_ratio": 0.027300541303836197, "original_pos_tags": {"PRP": 139, "VBD": 75, "JJ": 51, "NNP": 8, ",": 32, "CC": 41, "VBP": 17, "VBG": 30, "DT": 41, "NN": 89, "IN": 101, "RBS": 2, ".": 46, "PRP$": 29, "RB": 63, "VBN": 11, "WRB": 8, "CD": 3, "JJR": 3, "MD": 17, "VB": 40, "NNS": 20, "WDT": 4, "TO": 22, "JJS": 2, "RP": 1, "(": 1, ")": 1, "VBZ": 9, ":": 3, "``": 1, "''": 1, "RBR": 1, "PDT": 1, "POS": 2}, "summary_pos_tags": {"NN": 6, "VBD": 1, "PRP$": 2, "IN": 4, "DT": 2, "JJ": 3, "CC": 1, "VBP": 3, "RB": 2, "VB": 2, "WRB": 1, "NNS": 1, "PRP": 1, ".": 1}}
{"original_text": "Flashback to the past, almost exactly one year ago. You’re 25 and currently at your peak on many levels. Your physique is at its best it’s ever been and you’re excelling in your professional life. You just completed a big project, you’re driving home with a big smile on your face and amazing prospects are waiting. Your confidence is at its highest. You think making mistakes is not a problem, there’s all the time in the world to make apologies, fix what you’ve done wrong and make amends. Your social life is busy and just the way you want it. You’ve surrounded yourself with successful friends, hoping they would push and propel you in the right direction. A feel-good rush that seems to last forever. You still live at home though, saving all your money and have been doing that for years. There’s a good reason to do so: you don’t want to lock yourself into a position where you’d really wanted to do something but couldn’t because of financial or other reasons. You are convinced that at some time, some big change will come, something you really want to do, and you’ll be able to, by then relying on the resources you’ve been stashing for years. You find this very important.\n\nDuring your most successful, eventful and fulfilling month, right smack bang in the beginning of summer, when free time is abundant, an opportunity presents itself. And not just any opportunity. A once in a life-time thing and it’s huge. You know it. A sudden realization: your careful planning has worked out for you! Your friends have pushed you to the next level, the confidence is there to back it up and your conservative approach has paid off: you’re free to do whatever and go wherever you want. Everything has culminated into this night of big things and everything you need is there. Your skillset is complete to make it a big win. This opportunity is exactly what you’ve been waiting for.\n\nAnd it’s not like this opportunity was hard to get. No. It was *handed* to you. On a silver platter. Right in the middle of your face. You can’t miss it. Point blank. You didn’t ask for it, it just came to you. It came to you and sat on your face. It even showed you the way. This opportunity wasn’t opt-in, it was opt-out! The only thing you have to do, is take it home. Grab the opportunity with both hands and finish the damn job.\n\nYou start dreaming. You’d finally be done living conservatively. New goals were going to be set and those will be your main occupancy in the future. You won’t have to worry about what goals to set in your life, because the life you will be living *was the goal*. What you were saving for, is happening. It’s an all-in bet that you can’t lose: happiness awaits. Not bullshit happiness as in winning the lottery, but real happiness as in finally doing the things and living a life you envied for such a long time.\n\nUnfortunately, your short-sightedness, cockiness, testosteron-laden bullshit and a series of consecutive mistakes – pardon my French – fucked it up. You screw yourself royaly, and while you’re doing that, you *know* you’re doing it. The scale of your fuckup is so big it defies any rationality. No amount of words even begin to describe. This is an 8 on the INES scale. It’s worse than the Chernobyl and Fukushima nuclear disasters combined.\n\nIn the course of the following days, the realization of just how big of a mistake you’ve made is sinking in. It is making you physically ill. The emotional impact is unlike you’ve ever experienced before. You try a few mediocre attempts at fixing it, but you know it’s too late. Your failure and the future that could have been is the only thought on your mind and you’re constantly distracted by it. You could have had everything, you only had to take it home. Just a little bit of effort. That rush you were living on, and philosophy that you can fix anything, is gone. You are still stumped that you thought of yourself as a smart guy and you were still capable of blowing this up.\n\nFast forward to the present time. Now you’re 26. You’ve made several improvements in your life, but the opportunity you had in the past is gone. It will never return. All those years you’ve been saving and preparing are wasted and you simply cannot stop thinking about that fateful day. You recognize that your time here is finite and there’s no way back. It goes as far as willing to re-do your *entire* life, from birth, just to arrive at that same moment in the past and do it right that time. You feel old and time is passing you by. The emotions are like elephants tied to your chest and you have to tow them everywhere with you.\n\nEven a year later, when that fateful date is about to roll by again (it’s etched into your head), you still think about it. And in this period, the feeling is so strong you freeze. You even hope something similar will happen again, but you know that the chances of that are so low, that you are considering using the word impossible. You’re even setting up your agenda to make the weeks surrounding this particlar date to be similar to last year. To make matters worse, your scientific mind knows there’s no correlation between a date in the future and that something like that is going to happen again.\n\nThe question is. What do you do now?\n", "tldr": null, "summary_text": "– you’ve been waiting for a once in a life-time opportunity and it came to you, on a silver platter, right in the middle of your face.", "rougescores": null, "compression_ratio": 0.025572519083969465, "original_pos_tags": {"NN": 139, "TO": 33, "DT": 89, ",": 40, "RB": 70, "CD": 4, ".": 73, "PRP": 111, "VBP": 56, "VB": 56, "CC": 40, "IN": 97, "PRP$": 30, "JJ": 95, "NNS": 32, "VBZ": 39, "JJS": 2, "VBN": 26, "VBG": 35, "VBD": 25, "EX": 4, "PDT": 2, "WP": 5, "MD": 12, "WDT": 3, ":": 4, "WRB": 4, "RBS": 1, "RP": 5, "NNP": 10, "JJR": 2, "(": 1, ")": 1}, "summary_pos_tags": {"NN": 6, "PRP": 3, "VBP": 1, "RB": 3, "VBN": 1, "VBG": 1, "IN": 5, "DT": 4, "JJ": 1, "CC": 1, "VBD": 1, "TO": 1, ",": 2, "PRP$": 1, ".": 1}}
{"original_text": "So I had the brilliant idea to use Veet hair removal gel as the ol' danglies were in need of a trim and I had heard that Veet leaves them smoother for longer. Well I guess thats right when the skin has to grow back first. \n\nPre-Story: I tried this before and the results were great but I had decided to do it again because of how well it worked. \n\nSo I take out the gel/cream stuff and just lob it on and cover the forest. The slight peroxide kinda smell ensued and all was going well, there was a slight burning but thats to be expected, you know, melting pubes off does that. So comes the all and mighty time of scraping that stuff off, top half all good, no pain or anything. But, the danglies were what was burning, I scraped them and withstood the pain because well lets face it, men are men and a little pain for balls as smooth as jam jars is fine right? Wrong, it did great at taking the hair off it, but decided to take the first layer of skin too, my nuts now glow cherry red and walking is a painful expense that can't be justified.\nI feel sauron has just tipped them in mount doom and dragged me balls first down the side of a rock wall. \n\nTLDR: Had my balls burned by sauron and was left deveeted.", "tldr": " had my balls burned by sauron and was left deveeted.", "summary_text": "tried to get rid of hair on danglies, ended up burning them and now my balls look like they're going to fall off a rock wall.", "rougescores": [{"rouge-1": {"f": 0.16666666265432112, "p": 0.11538461538461539, "r": 0.3}, "rouge-2": {"f": 0.0588235255190314, "p": 0.04, "r": 0.1111111111111111}, "rouge-l": {"f": 0.11428571020408178, "p": 0.08, "r": 0.2}}], "compression_ratio": 0.10330578512396695, "original_pos_tags": {"RB": 19, "PRP": 19, "VBD": 17, "DT": 23, "JJ": 15, "NN": 37, "TO": 5, "VB": 8, "NNP": 4, "IN": 22, "POS": 1, "NNS": 12, "CC": 16, "VBN": 9, "VBZ": 9, "JJR": 2, ".": 10, "VBP": 6, "WRB": 2, ":": 2, "RP": 2, "JJS": 1, "VBG": 5, ",": 11, "EX": 1, "WP": 1, "UH": 1, "PRP$": 2, "WDT": 1, "MD": 1}, "summary_pos_tags": {"VBN": 1, "TO": 2, "VB": 2, "JJ": 1, "IN": 3, "NN": 3, "NNS": 2, ",": 1, "VBD": 1, "RP": 2, "VBG": 2, "PRP": 2, "CC": 1, "RB": 1, "PRP$": 1, "VBP": 2, "DT": 1, ".": 1}}
{"original_text": "I was in line at KFC and he was counting pennies in his hand in front of me. He turned around and said if I could spare some money for his lunch since he recently became homeless. The situation seemed genuine so I gave him $10.\n\nRight after he said bless you and walked out of the restaurant and across the street to a liquor store.\n\nSome scum have no shame.", "tldr": null, "summary_text": "gave a homeless man money for his lunch and he walked out of the restaurant and across the street to a liquor store right after he said bless you and walked out of the restaurant and across the street to a liquor store.", "rougescores": null, "compression_ratio": 0.611731843575419, "original_pos_tags": {"PRP": 10, "VBD": 9, "IN": 13, "NN": 13, "NNP": 1, "CC": 4, "VBG": 1, "NNS": 2, "PRP$": 2, ".": 5, "RP": 1, "MD": 1, "VB": 1, "DT": 7, "RB": 2, "JJ": 1, "$": 1, "CD": 1, "TO": 1, "VBP": 1}, "summary_pos_tags": {"VBD": 4, "DT": 7, "NN": 14, "IN": 8, "PRP$": 1, "CC": 4, "PRP": 3, "TO": 2, ".": 1}}
{"original_text": "Alright, Reddit. Gather round and hear of my shame.\n\nFirst, you must know, that I am white. Very white. Fucking blindingly white. I can handle sun - even have a tan - in places that are usually exposed (e.g., my forearms), but not in others.\n\nLike my back and shoulders.\n\nWell, I was at a pool party for the graduation of a friend of mine, and I had a blue shirt to wear, which I had expected to be wearing the entire time. I discovered within about fifteen minutes of getting in the water that it wasn't comfortable to wear, so I did away with it.\n\nThis wasn't the first time I'd done this. I did it once before, and paid dearly. But this wasn't an entire day at a waterpark, it was a couple hours in the pool. Truly my oversight of sunscreen couldn't be that bad.\n\nIt was. It very much was. Several hours later, as I sat watching a movie, I flexed, and realized the pain that began to spread across my shoulders. I'm currently sunburnt. Very, very sunburnt, across the entirety of my shoulders and upper arms and back.\n\nReddit. I fucked up.", "tldr": null, "summary_text": "didn't wear a shirt in the pool, got sunburnt across the entirety of my shoulders and upper arms and back. fuck you, sunscreen.", "rougescores": null, "compression_ratio": 0.1218809980806142, "original_pos_tags": {"NNP": 7, ",": 16, ".": 20, "NN": 22, "CC": 9, "IN": 24, "PRP$": 6, "PRP": 20, "MD": 4, "VB": 7, "VBP": 6, "JJ": 16, "RB": 19, "VBG": 4, ":": 2, "DT": 19, "NNS": 10, "WDT": 3, "VBN": 3, "(": 1, ")": 1, "VBD": 17, "TO": 4, "RP": 1}, "summary_pos_tags": {"VBD": 2, "RB": 2, "VB": 2, "DT": 3, "NN": 4, "IN": 3, ",": 2, "JJ": 2, "PRP$": 1, "NNS": 2, "CC": 2, ".": 2, "PRP": 1}}
{"original_text": "The other day me and my brother were playing Black Ops 2 and he had the mic and a girl came into the lobby we were in. He and her started talking while we were playing. They became friends on xbox and facebook. A few days later I told her who i was and sent her a friend request on facebook and xbox. She hasn't responded and I was going through the ingame friends list today and looked at her profile, only to accidentally push the invite to game button. Now I seem really creepy/annoying. Kat, if you're reading this, I just wanna play some xbox with you cus you seem cool as shit.", "tldr": null, "summary_text": "i accidentally invited a girl to play xbox with me and she hasn't responded so now i look like a creeper and she hasn't responded to my friend request.", "rougescores": null, "compression_ratio": 0.25900514579759865, "original_pos_tags": {"DT": 10, "JJ": 5, "NN": 18, "PRP": 17, "CC": 9, "PRP$": 2, "VBD": 13, "VBG": 6, "NNP": 3, "CD": 1, "IN": 10, ".": 7, "NNS": 3, "RB": 7, "WP": 1, "VBP": 5, "VBZ": 1, ",": 3, "TO": 3, "VB": 3}, "summary_pos_tags": {"NN": 6, "RB": 5, "VBD": 2, "DT": 2, "TO": 2, "VB": 1, "IN": 2, "PRP": 3, "CC": 2, "VBZ": 2, "JJ": 1, "VBP": 1, "VBN": 1, "PRP$": 1, ".": 1}}
{"original_text": "Today I was going to have a bath after a long day of painting kids faces at a carnival. All would go well, except being the genius I am, I put in some epsom salts (I always do for my bath), and I grabbed my bottle of peppermint essential oil.\n\n Lately, I've been on a diy-pinterest-tumblr-let's-make-my-own-shit-and-be-fancy spree. The other day I took a 'detox bath' (fyi did nothing for me guys. Uselessss). So, my brain totally went 'hey, trajectorys, put some peppermint in! It's good for your skin!' Okay brain!\n\nSo, instead of logically putting in like... 5 drops so it's nice and minty fresh smelling and just enough to work, I literally shook the thing full force all over the top of the bath water. I'm talking like... probably 50-100 drops. So I finish running the water, turn it off, and hop in.\n\nFirst five minutes went really well.. And then the cold started. Okay, this is fine, it just is the peppermint cooling my skin. Brain is like, just wait it out. So I stayed in.\n\nTen minutes in and I'm moving back and forth trying to keep the warm water warm, if I stopped moving it was like sitting in the water at the foot of a glacier. So I sit up.\n\nYou know that feeling when you brush your teeth and drink ice water? That immense cold in your mouth? My back felt like that immediately. \n\nSo now I'm sitting here and my back, my butt, and my ladybits are burning cold. Like, sitting in the snow naked kind of cold. It's really uncomfortable... So indeed, TIFU.\n\nTL;DR: Peppermint + bath = burning cold ladybits.", "tldr": " peppermint + bath = burning cold ladybits.", "summary_text": "put peppermint essential oil in my bath, it made me sit in the water at the foot of a glacier, and now my ladybits are burning cold.", "rougescores": [{"rouge-1": {"f": 0.23529411437716266, "p": 0.14814814814814814, "r": 0.5714285714285714}, "rouge-2": {"f": 0.06249999695312515, "p": 0.038461538461538464, "r": 0.16666666666666666}, "rouge-l": {"f": 0.19354838360041626, "p": 0.125, "r": 0.42857142857142855}}], "compression_ratio": 0.08672798948751642, "original_pos_tags": {"NN": 48, "PRP": 25, "VBD": 12, "VBG": 16, "TO": 3, "VB": 6, "DT": 25, "IN": 34, "JJ": 19, "NNS": 10, "VBZ": 8, ".": 24, "MD": 1, "RB": 28, ",": 19, "VBP": 14, "(": 2, "PRP$": 10, ")": 2, "CC": 10, "VBN": 1, "POS": 1, "NNP": 9, "CD": 4, "''": 1, ":": 5, "RP": 3, "WRB": 1}, "summary_pos_tags": {"VB": 2, "NN": 7, "JJ": 1, "IN": 4, "PRP$": 2, ",": 2, "PRP": 2, "VBD": 1, "DT": 3, "CC": 1, "RB": 1, "NNS": 1, "VBP": 1, "VBG": 1, ".": 1}}
{"original_text": "At the moment, a few of my printer ink cartridges are critically low, and have been for quite a while. My parents usually go shopping at Costco each weekend, and are usually already gone by the time I wake up.\n\nI kept missing out on the opportunity to \"drop off\" the empty cartridges before they are gone.\n\nThis week, I got the cartridges out and packed up and laid them in a visible spot last night. Cue this morning. Parents are still around. I thought that, for whatever reason, there would be no Costco run this weekend, so I took them back. Then they left behind my back without saying anything, which means I'm low on ink for yet another week through the fault of no one else but mine.", "tldr": null, "summary_text": "thought there would be no Costco run this weekend, took my empty printer ink cartridges back without telling my parents, and they left behind my back without saying anything.", "rougescores": null, "compression_ratio": 0.25180897250361794, "original_pos_tags": {"IN": 17, "DT": 16, "NN": 18, ",": 8, "JJ": 6, "PRP$": 3, "NNS": 5, "VBP": 8, "RB": 11, "CC": 5, "VBN": 3, ".": 8, "VBG": 3, "NNP": 3, "PRP": 11, "RP": 6, "VBD": 7, "TO": 1, "``": 1, "VB": 3, "''": 1, "WDT": 2, "EX": 1, "MD": 1, "VBZ": 1}, "summary_pos_tags": {"NN": 5, "EX": 1, "MD": 1, "VB": 2, "DT": 2, "NNP": 1, ",": 2, "VBD": 2, "PRP$": 3, "JJ": 1, "VBZ": 1, "RB": 2, "IN": 2, "VBG": 2, "NNS": 1, "CC": 1, "PRP": 1, "RP": 1, ".": 1}}
{"original_text": "I was at a park that had a festival going on to support cyclists, I was by myself looking for a place to smoke from my dugout. I wanted to be somewhat hidden so while the area was packed there was a gap in between which looked to me like a great little place to sneak a toke. I go over to the spot and sit down, AAANND I get caught up in the blackberry bushes thorny branches. \"No big deal.\" I say to myself whipping out my pocket knife. I swiped twice at the branch as I sat, it was cutting but not enough so the branch was just getting stuck to me. Then I swiped at it again with force, so much force that I cut through the branch and stabbed myself in the top of my knee. The blade went in half an inch into my kneecap. Never have I felt this stupid, luckily the festival had a medic on site so I go down get cleaned up and walk it off. \n\nNext day\n\n\"OH MY GOD WHY DOES THIS HURT SO FUCKING BADLY???\" I attempt to get up out of my bed and as I stand, it felt as if there was a sword in my kneecap, nearly bringing me to tears. Knee injuries are nothing to joke about, thought they were but they are not. Every time I have to sit or stand my leg has to be straight out or it's excruciating. \n\nTried to be stealth, ended up not being able to use my legs for now.", "tldr": null, "summary_text": "tried to sneak a toke, ended up stabbing myself in the knee with a pocket knife, can't use my legs for a few weeks now.", "rougescores": null, "compression_ratio": 0.09429477020602219, "original_pos_tags": {"PRP": 27, "VBD": 21, "IN": 32, "DT": 20, "NN": 35, "WDT": 3, "VBG": 8, "TO": 15, "VB": 14, "NNS": 5, ",": 9, "PRP$": 8, ".": 16, "RB": 15, "JJ": 10, "VBN": 6, "EX": 2, "VBP": 11, "CC": 8, "RP": 8, "NNP": 12, "VBZ": 3, "``": 1, "''": 3, "PDT": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "VB": 2, "DT": 4, "NN": 4, ",": 2, "VBD": 1, "RP": 1, "VBG": 1, "PRP": 1, "IN": 3, "MD": 1, "RB": 2, "PRP$": 1, "NNS": 2, "JJ": 1, ".": 1}}
{"original_text": "I haven't had a bath in practically years so, after finally moving into a house with a bath, I decide to have one. Having recently purchased a shiny new bag of weed, I thought combining the two would be a good idea.\n\nPicture this; a very cramped bathroom, no windows, a shitty extractor fan, closed door, steaming hot bath and a spliff. As I lay there gently swishing to and fro, giggling like a little school girl, I neglected to notice how hot the room was becoming. \n\nAfter a while I looked up and realised I could barely even see the taps in front of me. Naturally, I begin to panic and started scrambling around trying to escape. I grabbed a towel, stood up and immediately fell back to the floor. All I could see was black for what felt like 5 minutes, my heart was pounding and I could feel the blood rushing past my ears.\n\nOnce the feeling passed I stumbled into my bedroom and stood in front of the mirror, facing me was an extremely red version of myself with a bleeding shoulder. \n\nCurrently, my heart rate has almost returned to normal and I'm starting to feel and look less like a lobster. 2/10 would not recommend.\n\nTL;DR Got too high and too hot in the bath, almost cooked myself like a lobster.", "tldr": " got too high and too hot in the bath, almost cooked myself like a lobster.", "summary_text": "got too high and too hot in the bath, almost cooked myself like a lobster. 2/10 would not recommend. 3/10 would not recommend. 2/10 would not recommend.", "rougescores": [{"rouge-1": {"f": 0.7142857096938776, "p": 0.5555555555555556, "r": 1.0}, "rouge-2": {"f": 0.6999999954500001, "p": 0.5384615384615384, "r": 1.0}, "rouge-l": {"f": 0.8484848435996327, "p": 0.7368421052631579, "r": 1.0}}], "compression_ratio": 0.1256198347107438, "original_pos_tags": {"PRP": 17, "VBP": 5, "RB": 22, "VBD": 18, "DT": 26, "NN": 34, "IN": 22, "NNS": 5, ",": 15, "VBG": 13, "TO": 8, "VB": 13, "CD": 4, ".": 12, "VBN": 2, "JJ": 13, "MD": 5, ":": 2, "CC": 10, "WRB": 1, "RP": 1, "WP": 1, "PRP$": 4, "VBZ": 1, "JJR": 1, "NNP": 3}, "summary_pos_tags": {"VBD": 2, "RB": 6, "JJ": 2, "CC": 1, "IN": 2, "DT": 2, "NN": 2, ",": 1, "PRP": 1, ".": 4, "CD": 3, "MD": 3, "VB": 3}}
{"original_text": "I hit cancel when adding over an entire new album worth of pics and figured it wouldn't download any of them.. Dead wrong. It downloaded so many pictures. They have been up for like two days now. Some were NSFW party pics that I wouldn't even let myself be tagged in, and pics of this guy I used to talk to that were shirtless. Oh god and a range of selfies from me trying (keyword: trying) to be sexy. My grandma saw them!! ", "tldr": null, "summary_text": "hit cancel when adding over an entire new album worth of pics and figured it wouldn't download any of them.. it downloaded all of them and my grandma saw them.", "rougescores": null, "compression_ratio": 0.37411764705882355, "original_pos_tags": {"PRP": 9, "VBP": 2, "NNS": 7, "WRB": 1, "VBG": 3, "IN": 10, "DT": 6, "JJ": 5, "NN": 9, "CC": 3, "VBD": 6, "MD": 2, "RB": 6, "VB": 5, "NNP": 3, ".": 7, "VBN": 2, "RP": 1, "CD": 1, ",": 1, "TO": 3, "(": 1, ":": 1, ")": 1, "PRP$": 1}, "summary_pos_tags": {"VBN": 1, "NNS": 2, "WRB": 1, "VBG": 1, "IN": 4, "DT": 3, "JJ": 2, "NN": 4, "CC": 2, "VBD": 3, "PRP": 4, "MD": 1, "RB": 1, "VB": 1, "PRP$": 1, ".": 1}}
{"original_text": "Ok, so I've been seeing this stunning girl for a while and things are going really well, but today I fucked up. While going down on her, I got a tickle in the back of my throat (possibly a hair, I don't fucking  know), and I coughed, in a big way. Right into her pussy. I blew a raspberry into her pussy. \n\nShe was bewildered. I  was trying to apologize, but was in the midst of a coughing fit. \n\nFUCK. ", "tldr": null, "summary_text": "got a tickle in the back of my throat, coughed into my girlfriend's pussy, blew a raspberry into her pussy, she was bewildered.", "rougescores": null, "compression_ratio": 0.315136476426799, "original_pos_tags": {"NNP": 3, ",": 7, "RB": 5, "PRP": 9, "VBP": 3, "VBN": 2, "VBG": 4, "DT": 9, "JJ": 2, "NN": 14, "IN": 10, "CC": 4, "NNS": 1, "VBD": 7, "RP": 2, ".": 7, "PRP$": 3, "(": 1, "VB": 3, ")": 1, "TO": 1}, "summary_pos_tags": {"VBD": 3, "DT": 3, "NN": 7, "IN": 4, "PRP$": 3, ",": 3, "VBN": 2, "POS": 1, "PRP": 1, ".": 1}}
{"original_text": "So I've been living in a big house with 9 other guys. We had a cable company come in while most us were gone for a few days. I was living there with 1 other guy.\n\nOne of my roommates, lets call him Sam, left a note in his room with an arrow pointing to where he wanted his cable outlet installed. I went in the room a few hours after all the cable installation was done and I saw that the cable company didn't install his outlet where he asked. They installed it across the room.\n\nI thought it would be funny to leave a fake note from the cable company saying things like \"screw you\", \"don't tell me what to do\", and some more vulgar things. I drew a penis with the cable company's name on the back. I tried to make it so over the top that no one would think it was real.\n\nFlash forward to a few days later, Sam's parents came in and thought it was real. This escalates quickly and my roommate who is our primary tenant calls the cable and flips out on them. I guess it's a big deal at the cable company now.\n\nI'm so scared now. I don't want the police to get involved over a stupid joke.", "tldr": null, "summary_text": "i made a fake note from the cable company saying things like \"screw you\" and \"don't tell me what to do\" and my roommate flips out on them.", "rougescores": null, "compression_ratio": 0.12683823529411764, "original_pos_tags": {"RB": 12, "PRP": 25, "VBP": 6, "VBN": 6, "VBG": 3, "IN": 23, "DT": 25, "JJ": 16, "NN": 35, "CD": 3, "NNS": 9, ".": 14, "VBD": 18, "JJS": 1, "PRP$": 6, ",": 5, "NNP": 3, "TO": 6, "WRB": 2, "PDT": 1, "CC": 5, "VB": 9, "MD": 2, "``": 2, "''": 2, "WP": 2, "RBR": 1, "POS": 2, "VBZ": 5, "RP": 1}, "summary_pos_tags": {"NN": 6, "VBD": 1, "DT": 2, "JJ": 1, "IN": 3, "VBG": 1, "NNS": 1, "``": 2, "PRP": 3, "''": 2, "CC": 2, "VBP": 1, "RB": 1, "VB": 2, "WP": 1, "TO": 1, "PRP$": 1, "VBZ": 1, "RP": 1, ".": 1}}
{"original_text": "Edit: *by sink I think I mean basin. In the UK we call it a bathroom sink.*\n\nLet me preface this by saying I've been going through a bit of a rough time since chewing on a spider in my soup at work just less than 48 hours ago. It seems that since then, spiders have been trying their best to get their revenge on me almost (albeit accidentally) consuming their unfortunate cousin.\n\nSo, this morning I woke up, and needed to piss. Common event, right? So I pad along the hallway to the bathroom, lock the door, face the toilet and lift the lid, preparing to sit down (as I am female and we unfortunately our genitalia does not easily allow us to pee standing up). Well luckily I looked first, because under the toilet lid, some huge spindly 8-legged fucker was right their chilling on his web, giving me the look like \"dear lord your ass looks like it'd be fantastic to crawl on/bite/tickle affectionately with my spindly-ass 4\" legs\" so I noped the fuck out and clanged the lid back on the seat. However, I had not yet achieved post-piss status. The golden liquid still had to come out, and I was not willing to get trolled by another goddamn arachnid.\n\nThe sink. She has a drain. I remembered all of 3 years ago, listening to Ke$ha's first ever radio interview (BBC Radio 1, Scott Mills show) which was when I fell in love with her. I remembered al the anecdotes she shared. **Including the one where she recounted pissing in a sink in a London pub with either Lily Allen or Pixie Lott present (I don't remember which of the 2).** Aha, I thought to myself. I can finally act like my idol of my teenagehood.\n\nI hastily dropped trou, stepped upon the step we keep in the bathroom (I am a lass of an inadequate altitude) and sat down on the sink to do my business.\n\nNow, I am not a heavy girl. I could afford to lose a little weight but I'm probably around 120 pounds. Wateva. The sink cracked while I was mid-urination. Don't know what do. Wish I'd manned the fuck up and sorted out the spider but seriously, I hate those fuckers at the moment. At least I got to piss spider-free. :/", "tldr": null, "summary_text": "tifu by pissing in a sink that has a drain and now the sink is cracked and my asshole looks like it's about to be eaten by a spider.", "rougescores": null, "compression_ratio": 0.06340057636887608, "original_pos_tags": {"NN": 63, ":": 2, "JJ": 19, "VBP": 16, "PRP": 39, ".": 25, "IN": 41, "DT": 41, "NNP": 14, "VB": 22, "VBG": 11, "VBN": 6, "PRP$": 12, "RB": 35, "JJR": 1, "CD": 7, "NNS": 6, "VBZ": 5, ",": 18, "JJS": 2, "TO": 13, "(": 5, ")": 5, "VBD": 22, "CC": 10, "RP": 6, "UH": 1, "``": 1, "MD": 4, "''": 2, "$": 1, "POS": 1, "WDT": 2, "WRB": 2, "WP": 1}, "summary_pos_tags": {"NN": 5, "IN": 5, "VBG": 1, "DT": 4, "WDT": 1, "VBZ": 3, "CC": 2, "RB": 1, "VBN": 2, "PRP$": 1, "JJ": 1, "NNS": 1, "PRP": 1, "TO": 1, "VB": 1, ".": 1}}
{"original_text": "This was like 2 and a half weeks ago maybe 3. So i left my house to meet up with my girlfriend at a spot in some sorta wood type thing near some nice houses. on my way i saw landscape workers working around the houses and cleaning.  i meet my gf and go find a spot in the woods. The spot we went to seemed nice and lonely for the both of us to hang out. I cant remember if we smoked or not (fried) but i was horny and I'm sure she was too so we start making out and start touching each other all over the place. Then we start having sex in the woods. We were having sex peacefully until we heard workers. They sounded far but every second they seemed to get closer.  We realized that they were just a few feet away.  quickly me And my gf got up and get dressed and  head over to a different spot which was not a good idea. We were kinda laying there and i told her that i wanted to finish, she said okay but she wanted to do it right there.I don't know what made me look back but when i do i see the landscapers and they were looking our way. There was about 3 or 4 workers. We quickly got off each other. I don't know for how long they were watching but they were watching. One kept looking our way. I was so embarrassed. Bastards ruined it too ;) we just hung out for a bit after and went our separate ways. I wont forget that day. \nTL;DR- i had sex with my gf in the woods and got caught by landscape workers.", "tldr": " i had sex with my gf in the woods and got caught by landscape workers.", "summary_text": "had sex with my gf in the woods and got caught by landscape workers. i was so embarrassed that i didn't want to talk about it.", "rougescores": [{"rouge-1": {"f": 0.7317073124330755, "p": 0.5769230769230769, "r": 1.0}, "rouge-2": {"f": 0.6666666620644314, "p": 0.52, "r": 0.9285714285714286}, "rouge-l": {"f": 0.7499999953125, "p": 0.6, "r": 1.0}}], "compression_ratio": 0.08923512747875353, "original_pos_tags": {"DT": 24, "VBD": 33, "IN": 24, "CD": 5, "CC": 20, "JJ": 18, "NNS": 14, "RB": 24, ".": 20, "PRP$": 9, "NN": 32, "TO": 7, "VB": 18, "RP": 5, "VBG": 11, "PRP": 30, "VBP": 8, "(": 1, "VBN": 4, ")": 2, "JJR": 1, "WDT": 1, ",": 1, "WP": 1, "WRB": 2, "EX": 1, ":": 2, "NNP": 2}, "summary_pos_tags": {"VBD": 4, "NN": 5, "IN": 5, "PRP$": 1, "DT": 1, "NNS": 2, "CC": 1, "VBN": 1, ".": 2, "RB": 2, "JJ": 1, "VB": 2, "TO": 1, "PRP": 1}}
{"original_text": "I work at a day camp for my summer job. its a good job and doesn't pay that bad. i had been having problems with some coworkers for awhile, and felt like i kinda had no friends there. there are some coworkers that are nice to me, but i dont hang out with any them. Anyway, things got heated a couple days ago at work, and i was in the middle of it. The head counselor yelled at me pretty bad for something that wasn't my fault, and also in front of my kids. She was forced to apologize to me and in front of everyone. I was already at pretty high tensions with these group of girl counselors, and her having to apologize to me i think pissed them all off. I think they also found out i went behind the head counselor's back and asked my real boss if this head counselor was my boss, she is not. Here is where i fucked up. So today at work, i kinda got fed up with them and how lazy these girls can be and told on them to my boss. the reason i told on them though was so i could quit early(logic is flawed and story is paraphrased but essentially i said it would be best for both parties if i could quit early). I just really did not want to be around these people any longer. unfortunately, my boss said basically it would be a big shame and we could really use every counselor we can get because numbers are big this time of year. I reluctantly said yes, because my boss is good friends with my mom and i felt i owed it to both of them to finish out the last week. I also asked for monday off though and my boss said ok. I feel really selfish now and like shit for going behind these coworkers backs. To add to my feeling of shit, the boss had a special meeting after work with all of the counselors about how she has been hearing that some counselors are having problems with each other and to cut that shit out. it seemed obvious to me that the people involved knew it was me that caused this big mess.\n", "tldr": null, "summary_text": "i went behind the head counselor's back and asked my real boss if this head counselor was my boss, she is not. she was forced to apologize to me and in front of everyone.", "rougescores": null, "compression_ratio": 0.08919202518363065, "original_pos_tags": {"PRP": 31, "VBP": 9, "IN": 50, "DT": 34, "NN": 58, "PRP$": 13, ".": 19, "JJ": 24, "CC": 17, "VBZ": 7, "RB": 26, "VB": 16, "VBD": 32, "VBN": 9, "VBG": 5, "NNS": 21, ",": 11, "EX": 1, "WDT": 2, "TO": 13, "RP": 5, "POS": 1, "WRB": 3, "MD": 7, "(": 1, "JJS": 1, ")": 1, "UH": 1}, "summary_pos_tags": {"NN": 10, "VBD": 4, "IN": 4, "DT": 2, "POS": 1, "CC": 2, "PRP$": 2, "JJ": 1, ",": 1, "PRP": 3, "VBZ": 1, "RB": 1, ".": 2, "VBN": 1, "TO": 2, "VB": 1}}
{"original_text": "So, my oven is broken...and I'm out of cooking oil, but I want some french fries. So I search the internet and find that if you cover french fries with something, either napkins or another plate and microwave them, they turn out ok. So I tried it, I took to plates, smushed em together and put the french fries in the microwave. (Don't try this at home) \n Half way through the five minute cooking cycle I pull the plate out. Steam billowing out the crack between the two plates. I lift off the top plate and let it cool down a but, I touch the french fry and it's warm but a tad bit cold, I feel around and flip them with my fingers (Genius!) And then I reach the center of the plate. \n Freeze frame, have you ever microwaved something, like chicken nuggets, and the nuggets near the edge of the plate are colder than the ones in the middle? Well this is exactly what happened, but a thousand times worse. Since the fries have been blanched, frozen, bagged, and then put into my freezer, that means there's still some oil in the fries, and the microwave brought out that oil and boiled it, \n So I was poking around the fries when my finger squishes into a really soft one, right into the hell-fire center, where broiling hot potato smushes under my finger nail, I jump back in shock and flail around my hand whispering \"Ow, stop, Ow, stop, Ow, stop\" I cover the plate, start the microwave, and walk away, suddenly, this Burning sensation just erupts over the tip of my finger, full on pain train. I step into the bathroom and run it under cold water, only to find out. We're out of burn cream!\n\nSo now I'm sitting at my desk, with first degree burns on my index finger which I stuck in a bag of frozen corn \nas I type with one hand.\n\nTL;DR Tried to microwave french fries and stuck my finger into a franken-fuck of pain causing first degree burns\n\nUPDATE: I put aloe vera on the end of my finger and it feels like little tiny snow angels grinding up against my finger, so gud", "tldr": " tried to microwave french fries and stuck my finger into a franken-fuck of pain causing first degree burns", "summary_text": "tried to microwave french fries and stuck my finger into a franken-fuck of pain causing first degree burns, now sitting at my desk with first degree burns on my index finger.", "rougescores": [{"rouge-1": {"f": 0.7346938729029573, "p": 0.5806451612903226, "r": 1.0}, "rouge-2": {"f": 0.723404250701675, "p": 0.5666666666666667, "r": 1.0}, "rouge-l": {"f": 0.8181818133471075, "p": 0.6923076923076923, "r": 1.0}}], "compression_ratio": 0.08810126582278481, "original_pos_tags": {"RB": 22, ",": 34, "PRP$": 12, "NN": 69, "VBZ": 8, "VBN": 5, ":": 3, "CC": 23, "PRP": 30, "VBP": 20, "IN": 47, "VBG": 8, "DT": 39, "JJ": 21, "NNS": 19, ".": 13, "VB": 13, "RP": 10, "VBD": 11, "TO": 3, "(": 2, ")": 2, "NNP": 9, "CD": 4, "JJR": 1, "UH": 1, "WP": 1, "RBR": 1, "EX": 1, "WRB": 2, "``": 1, "''": 1, "WDT": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "VB": 2, "JJ": 3, "NNS": 3, "CC": 1, "PRP$": 3, "NN": 8, "IN": 5, "DT": 1, "VBG": 2, ",": 1, "RB": 1, ".": 1}}
{"original_text": "This technically happened yesterday since it 1:30 am here, but I can't sleep because I'm worried. \n\nBefore I start, let me set the scene. It's getting close to 6 on a mildly wet Western North Carolina summer day. Not too much rain, but enough to get the grass wet, and I'm in the really mountainous part of WNC. \n\nSo anyway, after hanging out with a friend of mine, we decide to visit another friend at her house since we're nearby.  I pull up the driveway, see other friends' truck in the way, so I try to go around. The friend I was riding with got \"Wait there's a-\" out just as I heard a *thunk*. \"-ditch there.\" Got-dang it Bobby. So I get out, lo and behold I'm stuck. If my truck had 4 wheel drive, I wouldn't have been as concerned. So I try to go further forward. I hear a *SNAP*. \"Well you broke my pipe, but that's fine.\" Turns out I snapped a ~3 inch PVC pipe (I guess for drainage) and it was now lodged in front of my right front tire.\n\nNow here's where it gets interesting.\n\nI leave my truck in neutral, go out to look at the pipe. Think *Oh, I can get that out from under there.* When I do, the whole truck comes rolling forward (remember; mountain country, I'm stuck on a slope.) I dodge the truck, which hits the girl's barn. Neither the barn nor the truck was hurt, but I was pinned between the truck and the barbed wire fence on the passenger side. After reassuring everyone there I was A-okay, one of the girls called her cousin, who brought a Jeep and a chain. I wriggle my way out of the wire, ever-so carefully step over the wire to make sure I can still have both boys and girls, not just one or the other, and make my way over to help hook things up and such. \n\nLong story short, we get it uphill a little, get another truck involved, get it angled better, cut the fence, and I drive my truck down the adjacent field (what the fence was there to fence off), and everything is okay. I ended up with just as many scratches as the truck. I just got a text to call the girl's mom tomorrow, and I'm worried that she'll tear me a new butthole after this. \n\nTl;dr- My truck went vroom vroom into a ditch. I tried to get it out, and it tried to kill me. After shouting \"Ole!\" and getting scratched up more than a husband having sex with a kinky cougar, two rednecks helped me out of a perilous predicament. And now me, my testicles, and my truck are all safe and sound.", "tldr": " my truck went vroom vroom into a ditch. i tried to get it out, and it tried to kill me. after shouting \"ole!\" and getting scratched up more than a husband having sex with a kinky cougar, two rednecks helped me out of a perilous predicament. and now me, my testicles, and my truck are all safe and sound.", "summary_text": "broke a pipe, got pinned between my truck and a barbed wire fence, and now my friend's mom is probably going to tear down her barn.", "rougescores": [{"rouge-1": {"f": 0.21176470163598624, "p": 0.34615384615384615, "r": 0.15254237288135594}, "rouge-2": {"f": 0.0481927668747282, "p": 0.08, "r": 0.034482758620689655}, "rouge-l": {"f": 0.14925372683448443, "p": 0.21739130434782608, "r": 0.11363636363636363}}], "compression_ratio": 0.05490360435875943, "original_pos_tags": {"DT": 47, "RB": 31, "VBN": 8, "NN": 83, "IN": 46, "PRP": 49, "CD": 6, "VBP": 23, ",": 33, "CC": 23, "MD": 5, "VB": 25, "JJ": 30, ".": 31, "VBZ": 10, "VBG": 8, "TO": 12, "NNP": 16, "RP": 9, "PRP$": 10, "NNS": 8, "POS": 3, "VBD": 19, "``": 4, "EX": 3, "''": 4, "(": 3, ")": 3, "WRB": 2, ":": 2, "WDT": 1, "WP": 2, "RBR": 1, "FW": 1, "JJR": 1}, "summary_pos_tags": {"VBD": 2, "DT": 2, "NN": 7, ",": 2, "VBN": 1, "IN": 1, "PRP$": 3, "CC": 2, "JJ": 1, "RB": 2, "POS": 1, "VBZ": 1, "VBG": 1, "TO": 1, "VB": 1, "RP": 1, ".": 1}}
{"original_text": "My boyfriend is in my school's marching band. Sports are huge at my university and tickets sell out very, very quickly. Boyfriend was really wanting me to get a student sports package which guarantees you seats so I can watch him in the band this year. He reminded me to do it back in July when we were in San Francisco together and, since I'm naturally a very forgetful person, I tried to file it away with an URGENT stamp in my mind so I wouldn't forget to do it right when I got home.\n\nWell, fast forward to today, almost a month after that trip, and I just remembered to go online and check how to buy a package. Turns out the last day you could buy one was ten days ago. I'm really kicking myself. Boyfriend is going to be so upset. It's his last year in the marching band.\n\n:(", "tldr": null, "summary_text": "forgot to buy a student sports package for my boyfriend's last year in the marching band, now he won't be in the band this year.", "rougescores": null, "compression_ratio": 0.1636828644501279, "original_pos_tags": {"PRP$": 5, "NN": 22, "VBZ": 5, "IN": 12, "POS": 1, ".": 9, "NNS": 5, "VBP": 4, "JJ": 6, "CC": 4, "RP": 3, "RB": 16, ",": 6, "NNP": 7, "VBD": 7, "VBG": 3, "PRP": 19, "TO": 8, "VB": 11, "DT": 10, "WDT": 1, "MD": 3, "WRB": 3, "CD": 1, "VBN": 1, ":": 1, "(": 1}, "summary_pos_tags": {"NN": 9, "TO": 1, "VB": 2, "DT": 4, "NNS": 1, "IN": 3, "PRP$": 1, "POS": 1, "JJ": 1, ",": 1, "RB": 2, "PRP": 1, "MD": 1, ".": 1}}
{"original_text": "My dad was recently cheated on by his wife and so I greeted him this morning with a nice cup of coffee and a question of how did his dick taste?", "tldr": null, "summary_text": "my dad was recently cheated on by his wife and so i greeted him this morning with a nice cup of coffee and a question of how did his dick taste?", "rougescores": null, "compression_ratio": 1.0, "original_pos_tags": {"PRP$": 3, "NN": 8, "VBD": 3, "RB": 2, "VBN": 1, "IN": 5, "CC": 2, "PRP": 2, "DT": 3, "JJ": 1, "WRB": 1, ".": 1}, "summary_pos_tags": {"PRP$": 3, "NN": 8, "VBD": 3, "RB": 2, "VBN": 1, "IN": 5, "CC": 2, "JJ": 2, "PRP": 1, "DT": 3, "WRB": 1, ".": 1}}
{"original_text": "Earlier today, I was at the local county fair in the lovely county of Adams in Wisconsin. I was there to enjoy the fair, help out and have a wonderful day. However, later in the afternoon, I found myself in the Rabbit, Chicken, Duck, Goose and Dairy Barn. I was behind a row of rabbit cages with my cousin, which bordered up to the wooden fence divider between the rabbits and dairy cows. \n\nThis beautiful Heifer decided she wanted to poke her head through to the rabbit side  for what I thought, was to get a good scratch behind the ears, and on her bump. She however, had other thoughts. She was just interested in getting the bucket of water on the floor that was meant for watering the rabbits.\n\nWhen I reached down to scratch her, she tolerated it for about 10-15 seconds. At the end of those few seconds, I was looking away speaking to my husband, son, and cousin. All of a sudden, a loud thwack and searing pain in my right hand. I looked down, and she had my hand squished in between her head/head bump and the wooden fence post in the barn. \n\nAfter I got my hand loose, about ten seconds after the initial hit, it was already turning purple with a huge blood pool underneath my middle finger nail, as well as the base of the nail was bleeding in the cuticle. My other finger nails felt like I had played that stupid bite down on them as hard as you can, then push your fingers together game. So as of right now, my hand is still in serious pain, the nail is purple and has some serious blood build up underneath it. As well, all the rest of the blood vessels in the top of my finger have burst so its about three times the size it should be. So this is how I screwed my hand up, by fucking up and mistaking a heifer's want for water, as the want for attention.\n\nTL;DR I fucked up by mistaking a heifer's want for water as a want for attention, petted it, and screwed my hand up pretty bad. Mainly the middle finger.", "tldr": " i fucked up by mistaking a heifer's want for water as a want for attention, petted it, and screwed my hand up pretty bad. mainly the middle finger.", "summary_text": "i fucked up by mistaking a heifer's want for water as a want for attention, petted it, and screwed my hand up pretty bad.", "rougescores": [{"rouge-1": {"f": 0.9230769181065088, "p": 1.0, "r": 0.8571428571428571}, "rouge-2": {"f": 0.919999995032, "p": 1.0, "r": 0.8518518518518519}, "rouge-l": {"f": 0.9090909041322315, "p": 1.0, "r": 0.8333333333333334}}], "compression_ratio": 0.0628898128898129, "original_pos_tags": {"RBR": 1, "NN": 70, ",": 28, "PRP": 26, "VBD": 26, "IN": 54, "DT": 40, "JJ": 26, "NNP": 11, ".": 18, "RB": 26, "TO": 7, "VB": 8, "CC": 11, "VBP": 3, "NNS": 13, "PRP$": 16, "WDT": 2, "RP": 6, "WP": 1, "VBG": 10, "VBN": 4, "WRB": 2, "MD": 2, "VBZ": 4, "PDT": 1, "CD": 1, "POS": 2, ":": 1}, "summary_pos_tags": {"NN": 7, "VBD": 3, "RP": 2, "IN": 4, "VBG": 1, "DT": 2, "POS": 1, ",": 2, "PRP": 1, "CC": 1, "PRP$": 1, "RB": 1, "JJ": 1, ".": 1}}
{"original_text": "[Throwaway]\nAfter a long day at work, I came home to my family being gone--cooling off at the public pool. Being the normal \"home alone dude\", I decided that it's been a while since I've had a good fap. I opened up Chrome, had a decent experience, closed off the tabs, and sat down to watch some TV.\nShortly after, my wife and kids arrived, we had dinner, and all was well in life. \nThat is until my wife wanted to check her FB account and so she popped on the computer, opened up chrome, and came face to face with my vids. She called me over and asked who was the person who last used the computer. Out of instinct, I said it was my 14 year old son.\n\nNow he's grounded, and I feel guilty knowing that my wife thinks my son is into bukkake.\n\nEdit: I will have Ice Cream with my boy tomorrow and make up for it...now..how to make my wife to understand..\n\nEdit 2: My wife decided that my son's punishment be lifted, after I told her that I was the one watching nsfw. She didn't believe me at first and we just had sex that night :D\nWhen I talked to my son this morning, HE DID LEAVE BEHIND A PORN TRACE BECAUSE HE DOESN'T USE INCOGNITO WINDOWNS. I KNEW I COULDN'T HAVE BEEN THAT STUPID TO LEAVE A TRACE BEHIND.\nill still take him to ice cream later :D\n\nWooo\n\nLast edit: truths out, gave son the talk,  got my wife in a kinky mood early this morning as a reward for being honest :D\nGlad to see reddit has people who actually give advice,  this fuck up wouldnt happen with my youngest son. \n\n\"Over-and-out\"", "tldr": null, "summary_text": "my 14 year old son watched nsfw on the computer and my wife thinks he's into bukkake. now he's grounded, and i feel guilty knowing that my wife thinks my son is into bukkake.", "rougescores": null, "compression_ratio": 0.1157684630738523, "original_pos_tags": {"JJ": 14, "NNP": 32, "NN": 59, "IN": 27, "DT": 20, ",": 17, "PRP": 25, "VBD": 28, "TO": 9, "PRP$": 15, "VBG": 4, "VBN": 4, ":": 8, "RP": 7, ".": 12, "``": 2, "RB": 12, "''": 2, "VBZ": 6, "VBP": 5, "CC": 9, "VB": 12, "NNS": 5, "WP": 3, "CD": 3, "MD": 1, "POS": 1, "WRB": 1, "JJS": 2}, "summary_pos_tags": {"PRP$": 4, "CD": 1, "NN": 9, "JJ": 3, "VBD": 1, "RB": 2, "IN": 4, "DT": 1, "CC": 2, "VBZ": 4, "PRP": 2, ".": 2, "VBN": 1, ",": 1, "VBP": 1, "NNS": 1}}
{"original_text": " WARNING: NSFW\n_____________________________________________________________\n\nOkay so today, i was jerking off, and i had just \"finished\". i exited out, and on the tab below, i had the picture of the seal born at the new england aquarium. (this one: http://i.imgur.com/6Hy2lgg.jpg ) my computer is just in front of my bedroom door, but off to the left a tad, so once you walk in, you immediately see the screen, and i was on an angle. (lefty) so, my mom walks in, sees me, pants off, seal on the screen, junk out, all done. i look up, made eye contact. my mom just staggered out of the room and went out somewhere. we haven't spoken all night. i fucked up. HARD.\n\nEDIT: My Mom just gave me the acceptance speech. ", "tldr": null, "summary_text": "mom walks in, sees me jerking off, seal on the screen, junk out, all done. we haven't spoken since. fuck.", "rougescores": null, "compression_ratio": 0.14726507713884993, "original_pos_tags": {"NN": 35, ":": 4, "NNP": 5, "RB": 11, ",": 15, "VBD": 9, "VBG": 1, "RP": 7, "CC": 5, "VB": 3, "``": 1, "VBN": 5, "''": 1, ".": 10, "IN": 13, "DT": 14, "JJ": 2, "(": 2, ")": 2, "PRP$": 5, "VBZ": 1, "TO": 1, "PRP": 5, "VBP": 3, "NNS": 3}, "summary_pos_tags": {"NN": 5, "NNS": 2, "IN": 3, ",": 4, "PRP": 2, "VBG": 1, "RP": 2, "DT": 2, "VBN": 2, ".": 3, "VBP": 1, "RB": 1}}
{"original_text": "And again on our honeymoon.\n\n>FIL: \"You're in good shape! Have you been working out?\"\n\n\"Yeah, started about 6 months ago. I'm looking to be in the best shape of my life come wedding day!\"\n\n>FIL: \"Oh! But you play sport, don't you? So you'll be getting in shape for that too?\"\n\n\"Well, I guess, but the season won't have started until after the honeymoon, and as we are going somewhere hot, I want to make sure I look good! I'm on track to being the most muscly i've ever been, I should peak around honeymoon time!\nDid I mention that i'm really excited that me and * are getting married? I really can't wait!\"\n\nWalked out of the room, and realised what I'd just heavily implied. *facepalm*", "tldr": null, "summary_text": "told my fiance i'm going to be the most muscly i've ever been on our honeymoon because i want to be in the best shape of my life.", "rougescores": null, "compression_ratio": 0.18777292576419213, "original_pos_tags": {"CC": 6, "RB": 14, "IN": 16, "PRP$": 2, "NN": 14, ".": 13, "JJ": 8, "NNP": 4, ":": 2, "``": 4, "PRP": 16, "VBP": 14, "VBN": 6, "VBG": 6, "RP": 1, "''": 4, "UH": 2, ",": 8, "VBD": 3, "CD": 1, "NNS": 2, "TO": 3, "VB": 8, "DT": 6, "JJS": 1, "MD": 5, "RBS": 1, "WP": 1}, "summary_pos_tags": {"VB": 3, "PRP$": 3, "NN": 7, "VBP": 3, "VBG": 1, "TO": 2, "DT": 2, "RBS": 1, "JJ": 1, "RB": 1, "VBN": 1, "IN": 4, "JJS": 1, ".": 1}}
{"original_text": "So recently I have come down with a nasty upper respiratory infection and have been coughing a lot.  \n\nToday, I was sitting in the cafeteria at my college when I felt a particularly big cough coming on. It was a very effective cough, and apparently too effective, because instantly I realized I had shat my pants.  While some may have been embarrassed, I was actually quite excited.  After spending so much time reading about people who shat them selves, you start to wonder what it feels like.  Well, now I know. \n\nTL;DR: I coughed so hard I shat my self and was happy about it.", "tldr": " i coughed so hard i shat my self and was happy about it.", "summary_text": "i coughed so hard that i shat my self and was happy about it. i'm not sure if i'll ever get over it.", "rougescores": [{"rouge-1": {"f": 0.7222222176080247, "p": 0.5652173913043478, "r": 1.0}, "rouge-2": {"f": 0.6470588189619378, "p": 0.5, "r": 0.9166666666666666}, "rouge-l": {"f": 0.7272727226446282, "p": 0.5714285714285714, "r": 1.0}}], "compression_ratio": 0.17271157167530224, "original_pos_tags": {"RB": 12, "PRP": 14, "VBP": 6, "VBN": 5, "RP": 1, "IN": 10, "DT": 6, "JJ": 9, "NN": 10, "CC": 3, "VBG": 5, ".": 7, ",": 6, "VBD": 8, "PRP$": 3, "WRB": 1, "NNS": 2, "MD": 1, "VB": 2, "WP": 2, "VBZ": 2, "TO": 1, "NNP": 3, ":": 2}, "summary_pos_tags": {"NN": 3, "VBD": 2, "RB": 3, "JJ": 4, "IN": 4, "VBP": 2, "PRP$": 1, "CC": 1, "PRP": 2, ".": 2, "VB": 2, "MD": 1}}
{"original_text": "I have a bit of a fear of disembodied eyes in darkness, where some creepy reflective eyes seemingly not connected to a face float about behind some poor unsuspecting person.\n\nBut anyway I was walking to the toilet and I see 3 pairs of disembodied eyes floating towards me like something out of my worst nightmare. I proceed to perform the highest, most ridiculous girly scream ever and began to turn to run. As I do this I wrap my foot up in some cable and I fall over smashing my face off the floor. My mum rushes to my aid to see me lying on the floor covered in blood with 3 cats demanding my attention.\n\nToday I fucked up, by being a girly idiot.", "tldr": null, "summary_text": "my fear of disembodied eyes led me to smash my face off the floor with a cable and get covered in blood with 3 cats demanding my attention.", "rougescores": null, "compression_ratio": 0.21384615384615385, "original_pos_tags": {"PRP": 10, "VBP": 6, "DT": 12, "NN": 21, "IN": 18, "JJ": 9, "NNS": 6, ",": 3, "WRB": 1, "RB": 4, "VBN": 1, "TO": 7, ".": 6, "CC": 4, "VBD": 4, "VBG": 6, "CD": 2, "PRP$": 6, "JJS": 2, "VB": 4, "RBS": 1, "RP": 2}, "summary_pos_tags": {"PRP$": 3, "NN": 6, "IN": 5, "JJ": 1, "NNS": 2, "VBD": 1, "PRP": 1, "TO": 1, "VB": 2, "DT": 2, "CC": 1, "VBN": 1, "CD": 1, "VBG": 1, ".": 1}}
{"original_text": "TIFU. I am currently working at a temp agency until my full-time job landscaping can start (it's because of the bad weather up here in Ontario). I went to the temp job yesterday from 3pm-11pm. I told them I'd be fine to work from 7am-3pm the next day. I decided I'd stay up since I had slept until 1:30pm yesterday. Well, for some reason... I showed up to work at 6:30am, sat in my car for 30 minutes, and then decided I'm going home. Now I have to register with another temp agency, and what's worse, I have to find a new place to live since my parents are kicking me out of the house.", "tldr": null, "summary_text": "i went to work at 6:30am, sat in my car for 30 minutes, and then decided to go home. now i have to find a new place to live.", "rougescores": null, "compression_ratio": 0.21160409556313994, "original_pos_tags": {"NNP": 3, ".": 7, "PRP": 14, "VBP": 5, "RB": 5, "VBG": 3, "IN": 18, "DT": 8, "JJ": 8, "NN": 16, "PRP$": 3, "MD": 3, "VB": 8, "(": 1, "VBZ": 2, ")": 1, "VBD": 7, "TO": 6, "VBN": 1, "CD": 3, ",": 5, ":": 1, "RP": 1, "NNS": 2, "CC": 2, "WP": 1, "JJR": 1}, "summary_pos_tags": {"JJ": 2, "VBD": 3, "TO": 4, "VB": 4, "IN": 3, "CD": 2, ",": 2, "PRP$": 1, "NN": 3, "NNS": 1, "CC": 1, "RB": 3, ".": 2, "VBP": 1, "DT": 1}}
{"original_text": "I went to go study with a friend outdoors. There are these nice chairs and small tables on a raised terrace, and we decide to go there. I sat down, and realized that the chair was a bit small for my hips. You see, I do even lift.\n\nI was getting settled in, but little did I know the small decorative holes in the back of the chair had caught the bottom part of my belt loop on the back of my pants. I shifted my weight around, but felt a tear. I check my belt loop, and it had ripped at the bottom seam and created a fucking hole in my pants where it was sewn to.\n\nMost annoying fuckup ever. ", "tldr": null, "summary_text": "i ripped my belt loop while sitting on a small chair and created a fucking hole in my pants where it was sewn to. i'm an idiot.", "rougescores": null, "compression_ratio": 0.21452702702702703, "original_pos_tags": {"PRP": 11, "VBD": 12, "TO": 3, "VB": 3, "NN": 18, "IN": 12, "DT": 13, "NNS": 7, ".": 8, "EX": 1, "VBP": 6, "JJ": 10, "CC": 7, ",": 6, "RB": 5, "PRP$": 6, "VBG": 2, "VBN": 4, "WRB": 1, "JJS": 1}, "summary_pos_tags": {"NN": 6, "VBD": 3, "PRP$": 2, "IN": 3, "VBG": 1, "DT": 3, "JJ": 2, "CC": 1, "NNS": 1, "WRB": 1, "PRP": 1, "VBN": 1, "TO": 1, ".": 2, "VB": 1, "VBP": 1}}
{"original_text": "first off, the title alone tells you i don't know jackshit about cars. i can check the oil, i can inflate the tires, i can even change a tire, but apparently i can't even clean corrosion from my battery terminals without making one stupid mistake. i tried to do a little preventative maintenance of my own and ended up fucking myself over.\n\na few days ago when i went to jump off a friend's battery, i noticed that the terminals of mine were corroded and needed cleaning badly. i decided this morning that i'd do it because it was a nice morning and hey, all i needed were a few tools and a can of coke, right? so i loosened the nuts, but to get to one particularly difficult one, i had to lift the flap covering the battery cells first. so i did, removed the nut, and was able to pour a little coke on it to get rid of the corrosion...only i didn't think to put the flap back on before i did it. rookie mistake! coke spilled into the cells and i immediately knew that that probably was NOT supposed to happen.\n\ntried to crank the car. no click...nothing! there wasn't even that much coke in there, but apparently it was enough to kill my battery.\n\n[how i felt.]\n(http://bit.ly/Wlu3gq)\n\nmoral of the story-- if you don't know shit about cars, don't attempt anything you see on the internet, no matter how simple it may be, without some sort of supervisory assistance.\n\nthe good part-- my super cute firefighter neighbor came to my rescue by removing the dead battery, driving me to buy a new one, and subsequently installing it. i was so grateful for his help, i didn't even mind that he had few laughs at my expense!", "tldr": null, "summary_text": "i tried to clean my battery terminals with coke, spilled coke into the cells, killed my battery, and had my cute firefighter neighbor drive me to buy a new one.", "rougescores": null, "compression_ratio": 0.09894867037724181, "original_pos_tags": {"RB": 32, ",": 18, "DT": 31, "NN": 58, "VBZ": 1, "PRP": 13, "VB": 29, "VBP": 4, "IN": 27, "NNS": 12, ".": 16, "MD": 7, "CC": 10, "JJ": 25, "PRP$": 7, "VBG": 6, "CD": 4, "VBD": 24, "TO": 13, "RP": 2, "WRB": 3, "POS": 1, "VBN": 5, ":": 5, "NNP": 1, "EX": 1, "(": 1, ")": 1}, "summary_pos_tags": {"NN": 8, "VBD": 3, "TO": 2, "VB": 2, "PRP$": 3, "NNS": 2, "IN": 2, ",": 3, "DT": 2, "VBN": 1, "CC": 1, "JJ": 2, "PRP": 1, "CD": 1, ".": 1}}
{"original_text": "So I'm a junior in high school and my \"friend\" takes my phone. I ask for it back and as a joke I search up some terms like porn, kinky porn, kinky midget porn and even more porn. I hand it back to him and he finds the terms. He practically shows the entire classroom including the teacher. I really doubt most people knew it was a joke, so I just try to play along and make sure to laugh a lot. I am thinking about just telling people who ask that he searched the terms or letting them know it was a joke. I really don't want to be known as the midget porn guy for the next year and half. Can TIFU offer some advice as to what to do tomorrow? Sorry for the block of text, I don't know how to format", "tldr": null, "summary_text": "i searched midget porn on my friend's phone as a joke and he showed the entire class. i don't want to be known as the midget porn guy for the next year and half.", "rougescores": null, "compression_ratio": 0.23065902578796563, "original_pos_tags": {"RB": 13, "PRP": 18, "VBP": 8, "DT": 14, "NN": 23, "IN": 11, "JJ": 6, "CC": 7, "PRP$": 2, "``": 1, "''": 1, "VBZ": 3, ".": 8, "RP": 1, "NNS": 5, ",": 4, "FW": 1, "VB": 12, "JJR": 1, "TO": 7, "VBG": 4, "JJS": 1, "VBD": 4, "WP": 2, "VBN": 1, "MD": 1, "NNP": 2, "WRB": 1}, "summary_pos_tags": {"NN": 12, "VBD": 2, "IN": 4, "PRP$": 1, "POS": 1, "DT": 4, "CC": 2, "PRP": 1, "JJ": 3, ".": 2, "VBP": 1, "RB": 1, "VB": 2, "TO": 1, "VBN": 1}}
{"original_text": "Ok so. I live with my boyfriend. Our toilet is broken and we have to manually fill it up. I had to take a dump SOOOO bad. So I waited til he was sleeping. I do the deed and flush. Suddenly, every tap in the house starts vibrating. It was like something out of a cartoon. Seriously. So I started frantically running around turning all the taps on. \n\n\nAnd guess what. It didn't flush. So what do I do?? I wrap my hands in toilet paper, after checking my bf was still sleeping, and I grab the giant shit. It literally felt like a subway six inch that had been filled with too much meat. It was heavy. And long. And hard. \n\n\n\nI didn't know what to do with it so I go outside to check the bins. They'd been taken out the front. So I run down there. And then I realise that because they're empty, he will definitely notice a giant turd in the bottom of the bin when he opens it. So I do the next best thing and I throw it down the rain water drain. \n\n\nThat was about two weeks ago. Today, I went outside and notice some construction workers. I asked my boyfriend what they were doing. 'Just replacing some pipes'. \n\n\n\nWell. Fuck me dead. This is all i can think: You know what that means? They'll find my shame. And probably tell us there was a huge shit under our driveway. \n\n \n\nI am PRAYING that they don't. \n\n\n", "tldr": null, "summary_text": "had to take a dump. toilet didn't flush. grabbed the giant shit. threw it down the rain water drain. construction workers saw it two weeks later.", "rougescores": null, "compression_ratio": 0.11094108645753634, "original_pos_tags": {"NNP": 4, "RB": 20, ".": 34, "PRP": 37, "VBP": 14, "IN": 18, "PRP$": 7, "NN": 32, "VBZ": 5, "VBN": 5, "CC": 11, "TO": 4, "VB": 14, "RP": 4, "VBD": 16, "DT": 23, "JJ": 15, "VBG": 9, ",": 5, "PDT": 1, "NNS": 6, "WP": 5, "CD": 3, "WDT": 1, "MD": 4, "WRB": 1, "POS": 1, ":": 1, "EX": 1}, "summary_pos_tags": {"VBD": 4, "TO": 1, "VB": 3, "DT": 3, "NN": 7, ".": 5, "RB": 2, "JJ": 1, "PRP": 2, "RP": 1, "NNS": 2, "CD": 1}}
{"original_text": "TL; DR: Giving blood then playing hero to a girl is a bad idea.\n\nSo today was our school's blood drive, I sign up with great enthusiasm and notice my friend who happens to be a girl is in the same slot as me. We go together to the Blood Drive Bus and get signed up, strapped in, and they tap our veins. It takes about 10 minutes and my pack is full, I feel a lil light headed and I sit around while my friend finishes and we leave together. I tried to make her sit and rest but she insisted in goin to class. Now I should have told you this girl is 110 pounds and 5'1 (is that the right sign for height? ) so she is pretty dizzy. I turn to go back to Chorus class and the next thing I hear in a dead silent hallway is a faint thump. I turn around and she's on the floor, passed out. \n\nAt this point I go full on panic mode and run to her and pick her up. I tell her we are goin to the nurse but she murmurs that she has to puke and so I hoist her up and carry her to the restroom, once she is situated I flat out RUN to the nurses office across the school and get the nurse up there then run back and forth with a wheelchair and finally grab her stuff from class, all within 20-30 minutes of giving blood..I ended up in the nurses office soon after because I fainted from all the running after losing all that blood from donation.  Along with detention for going into the Girls Bathroom. So I would count this as a Fuck Up. \n\nSorry for wall of text bt the way.", "tldr": null, "summary_text": "gave blood then played hero to a girl, she passed out and puked, then fainted from all the running after losing all the blood from donation.", "rougescores": null, "compression_ratio": 0.0958904109589041, "original_pos_tags": {"NNP": 12, ":": 2, "VBG": 5, "NN": 51, "RB": 17, "TO": 12, "DT": 27, "VBZ": 13, "JJ": 15, ".": 14, "VBD": 5, "PRP$": 11, "POS": 1, ",": 7, "PRP": 28, "VBP": 14, "RP": 4, "IN": 35, "CC": 19, "WP": 1, "VB": 13, "VBN": 6, "NNS": 7, "CD": 3, "MD": 2, "(": 1, ")": 1, "PDT": 2}, "summary_pos_tags": {"VBD": 4, "NN": 6, "RB": 3, "TO": 1, "DT": 3, ",": 2, "PRP": 1, "CC": 1, "VBN": 1, "IN": 3, "PDT": 2, "VBG": 1, ".": 1}}
{"original_text": "So yeah it actually didn't happen today but about 5 years ago. I was still a virgin and kind of frustrated about it. You know how it goes \"shit i'm still a virgin...\"\n\nSo I was at this party and I heard that there was a girl which I heard she was pretty easy(Let's call her easy girl from now on). So for the rest of the evening I spent drinking, I went outside to smoke. There was easy girl. I was really fucked up, but I thought hey, let's try this! I took her apart to someones driveway. We began to kiss, started to go down on her. Everything went alright I even brought a condom! (well look at that!) I started fumbling around with my dick since I was drunk and never done it before.\n\nWe fucked for a while but then I decided since I couldn't feel anything, let's take the condom off! Great idea! Now I was so fucked up I couldn't come so I asked her if she maybe would give me a blowjob. She agreed and gave me a blowjob (here is where the fuck up comes) When I thought I came I actually peed in her fucking mouth, no shit. I thought I came but my prostate thought otherwise. \n\nShe gargled a little bit and then spit it out...Never spoke to her since and sometimes when I see her mother, she gives me this weird look. I don't know if she knows...\n\nTL;DR: Lost my virginity on someones driveway with a girl I didn't give a shit about and peed in her mouth. \n", "tldr": " lost my virginity on someones driveway with a girl i didn't give a shit about and peed in her mouth. ", "summary_text": "lost my virginity on someones driveway with a girl i didn't give a shit about and peed in her mouth. never spoke to her since.", "rougescores": [{"rouge-1": {"f": 0.8695652124291116, "p": 0.8, "r": 0.9523809523809523}, "rouge-2": {"f": 0.8636363586776858, "p": 0.7916666666666666, "r": 0.95}, "rouge-l": {"f": 0.8837209252568958, "p": 0.8260869565217391, "r": 0.95}}], "compression_ratio": 0.09244314013206163, "original_pos_tags": {"RB": 32, "VB": 19, "PRP": 44, "VBD": 32, "NN": 34, "CC": 11, "IN": 28, "CD": 1, "NNS": 2, ".": 18, "DT": 19, "VBN": 4, "VBP": 6, "WRB": 4, "VBZ": 5, "``": 1, "JJ": 8, ":": 5, "''": 1, "EX": 2, "WDT": 1, "(": 3, "NNP": 4, "POS": 3, "PRP$": 9, ")": 3, ",": 7, "TO": 5, "RP": 4, "VBG": 2, "MD": 3}, "summary_pos_tags": {"VBN": 1, "PRP$": 3, "NN": 5, "IN": 5, "NNS": 1, "RB": 3, "DT": 2, "VBD": 2, "VB": 2, "CC": 1, ".": 2, "TO": 1}}
{"original_text": "Technically, this was a couple of years ago but whatever. It was around 11 PM and I was in my parents dining room on my laptop screwing around on facebook. I noticed my ex had posted a couple of pictures and decided to have a quick look. I've always found it interesting how even the least bit of skin can make me succumb to my urges and, to be fair, she was my first sexual experience and was a master in bed. Well, I looked at a couple of pictures and decided she wasn't going to cut it so I went ahead to more interesting things (should read as youporn). As I was about to finish I realized I hadn't gotten any toilet paper and wasn't wearing any socks so I had no other choice than to let loose on the carpet. Once wasn't going to do anything so I didn't really think much of it. 10 minutes later, my dad walks in. Normally, by 11 he's asleep or in his room so this really wasn't in my plans.\nLong story short, he stepped right on my man juices and immediately asked \"what the fuck is this\". Nervous as I was, I said it was water.. water?? really? how fucking retarded of a person can I be to come up with water. My dad turned around, wiped his foot on the carpet and left walking slowly. He has never mentioned this after that night and to this day, I am still unsure if he knew what is was or not.", "tldr": null, "summary_text": "my dad walked in on me jerking it on the carpet and thought it was water. he has never mentioned it to me ever since. fml.", "rougescores": null, "compression_ratio": 0.09363008442056792, "original_pos_tags": {"RB": 31, ",": 10, "DT": 19, "VBD": 29, "NN": 29, "IN": 25, "NNS": 11, "CC": 12, ".": 16, "PRP": 26, "CD": 3, "NNP": 6, "PRP$": 11, "VBG": 8, "JJ": 12, "VBN": 6, "TO": 10, "VB": 13, "VBP": 2, "WRB": 2, "JJS": 1, "MD": 3, "RBR": 1, "(": 1, ")": 1, "VBZ": 4, "``": 1, "WP": 2, "''": 1, "RP": 2}, "summary_pos_tags": {"PRP$": 1, "NN": 4, "VBD": 3, "IN": 4, "PRP": 6, "VBG": 1, "DT": 1, "CC": 1, ".": 3, "VBZ": 1, "RB": 2, "VBN": 1, "TO": 1}}
{"original_text": "My boss had a stroke. He was hospitalized today. While a coworker was explaining his status I had my ear buds in and was laughing hysterically like a hyena at adviceanimals. \nTl;Dr caught laughing during bad news ", "tldr": " caught laughing during bad news ", "summary_text": "my boss had a stroke. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today.", "rougescores": [{"rouge-1": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.0, "p": 0.0, "r": 0.0}}], "compression_ratio": 3.140845070422535, "original_pos_tags": {"PRP$": 3, "NN": 8, "VBD": 6, "DT": 3, ".": 3, "PRP": 2, "VBN": 1, "IN": 5, "VBG": 3, "JJ": 2, "CC": 1, "RB": 1, "NNS": 1, "NNP": 2, ":": 1}, "summary_pos_tags": {"PRP$": 1, "NN": 26, "VBD": 25, "DT": 1, ".": 25, "PRP": 24, "VBN": 24}}
{"original_text": "So, I was masturbating, and had a giant orgasm that made me clench m teeth really hard.   \nMy tooth felt weird, and apparently, I chipped it.  \nNow it hurts and my tooth is crooked.  \n\nI orgasmed so hard I chipped a tooth. What the hell is wrong with me.", "tldr": null, "summary_text": "masturbated so hard that i chipped a tooth, now it hurts and my tooth is crooked, and what the fuck is wrong with me? i just masturbated so hard that i chipped a tooth, now it hurts and my tooth is crooked, and what the fuck is wrong with me? i just masturbated so hard that i chipped a tooth, now it hurts and my tooth is crooked, and what the fuck is wrong with me? i just masturbated so hard that i chipped a tooth, now it hurts and my tooth is crooked, and what the fuck is wrong with me?", "rougescores": null, "compression_ratio": 1.937007874015748, "original_pos_tags": {"RB": 6, ",": 4, "PRP": 8, "VBD": 7, "VBG": 1, "CC": 3, "DT": 3, "JJ": 5, "NN": 5, "WDT": 1, "FW": 1, "NNS": 1, ".": 5, "PRP$": 2, "VBZ": 3, "VBN": 1, "WP": 1, "IN": 1}, "summary_pos_tags": {"VBN": 8, "RB": 11, "JJ": 8, "IN": 8, "NN": 16, "VBD": 4, "DT": 8, ",": 8, "PRP": 8, "VBZ": 12, "CC": 8, "PRP$": 4, "WP": 4, ".": 4, "VB": 3}}
{"original_text": "In a process of it this morning, I ripped the shirt around the chest area about good 3~4 inches. Ugh it was my only light purple color shirt. ", "tldr": null, "summary_text": "tifu by ripping a shirt off my chest in the middle of the night and not realizing it until it was too late to do anything about it.**", "rougescores": null, "compression_ratio": 0.9366197183098591, "original_pos_tags": {"IN": 4, "DT": 4, "NN": 6, "PRP": 3, ",": 1, "VBD": 2, "JJS": 1, "RB": 1, "JJ": 3, "CD": 1, "NNS": 2, ".": 2, "PRP$": 1}, "summary_pos_tags": {"NN": 6, "IN": 6, "VBG": 2, "DT": 3, "PRP$": 1, "CC": 1, "RB": 2, "PRP": 3, "VBD": 1, "JJ": 1, "TO": 1, "VB": 2, ".": 1}}
{"original_text": "I feel like there has been an influx of \"This happened x amount of time ago but anyway....\" type post. While these stories can be interesting it's not something that you did TODAY or hell even in the past couple weeks. Personally, I enjoy this subreddit because it allows users to A) talk about a bad situation. but it also B) allows people to comment on it in an effort to HELP with the situation. When the story happened 3 years ago *coughcough* There's then no room for discussions like \"well what are you gonna do now?\" or \"you can fix it by _____\" because it happened sooooo long ago we already know the result. I realize some people didn't know about this place when they had their fuckup and thats why something within a few weeks is even okay in my book. Anyway that's just my two cents.", "tldr": null, "summary_text": "tifu by not allowing people to talk about a bad situation when it happened 3 years ago and not allowing them to talk about how they can fix it.", "rougescores": null, "compression_ratio": 0.17987421383647798, "original_pos_tags": {"PRP": 14, "VBP": 6, "IN": 21, "EX": 2, "VBZ": 7, "VBN": 1, "DT": 15, "NN": 20, "``": 3, "VBD": 6, "JJ": 5, "CC": 5, "RB": 15, ":": 1, ".": 9, "''": 3, "NNS": 10, "MD": 2, "VB": 9, "VBG": 1, ",": 1, "TO": 4, ")": 2, "NNP": 2, "WRB": 3, "CD": 2, "WP": 1, "PRP$": 3}, "summary_pos_tags": {"NN": 2, "IN": 3, "RB": 3, "VBG": 2, "NNS": 2, "TO": 2, "VB": 3, "DT": 1, "JJ": 1, "WRB": 2, "PRP": 4, "VBD": 1, "CD": 1, "CC": 1, "MD": 1, ".": 1}}
{"original_text": "This happened this last weekend  we all know that \"I'm glad you came\" song right? yeah i now will forever HATE that song \n\nlet me rewind i am 22 years old and in college my mom and sister came to pick me up for the weekend because my car is at the shop\nwell anyways that song comes on my sister starts singing it and of course, me the idiot would be the one to say \"THATS WHAT YOUR MOM SAID LAST NIGHT' she immediatley smacked me and the mouth and pretended nothing even happened.  \n\n\nTL;DR : I told my sister i came on my mother last night because of a song she was singing", "tldr": " i told my sister i came on my mother last night because of a song she was singing", "summary_text": "i told my sister i came on my mother last night because of a song she was singing and i pretended to be the one to say \"thats what your mom said last night' she smacked me and the mouth and nothing even happened.", "rougescores": [{"rouge-1": {"f": 0.5806451571696151, "p": 0.4090909090909091, "r": 1.0}, "rouge-2": {"f": 0.5666666626055555, "p": 0.3953488372093023, "r": 1.0}, "rouge-l": {"f": 0.6274509760861208, "p": 0.45714285714285713, "r": 1.0}}], "compression_ratio": 0.3693379790940767, "original_pos_tags": {"DT": 9, "VBD": 9, "JJ": 5, "NN": 21, "PRP": 11, "VBP": 3, "IN": 12, "``": 2, "''": 1, "RB": 4, ".": 2, "UH": 1, "MD": 2, "VB": 6, "NNP": 10, "CD": 2, "NNS": 1, "CC": 5, "PRP$": 5, "TO": 2, "RP": 1, "VBZ": 5, "VBG": 2, ",": 1, "POS": 1, ":": 2}, "summary_pos_tags": {"NN": 11, "VBD": 7, "PRP$": 3, "IN": 3, "JJ": 2, "DT": 3, "PRP": 3, "VBG": 1, "CC": 3, "TO": 2, "VB": 2, "CD": 1, "``": 1, "NNS": 1, "WP": 1, "POS": 1, "RB": 1, ".": 1}}
{"original_text": "Every day I drive to a park and ride, which is about 2 miles away from my place. Well this morning as I was leaving, I left my keys on the counter and locked the door on the way out. It was both my car keys and my condo keys and I had no way back in. My wife had left for work 5 minutes earlier; I tried calling her and she didn't answer. \n\n\nSo I decided to walk...not three steps down the stairs I felt a fart coming on...I let it out slowly because I haven't been feeling great lately, and I felt a wet juicy fart slip out of my cheeks, only it wasn't just a fart it was diarrhea. It wasn't a lot, but enough to feel terrible.  \n\n\nI had no choice though, but to walk; and of course, living the greater Seattle area, it started raining. It was a 25 minute walk, then a 30 minute bus-ride with runny crap between my cheeks. The only good news was that when I got to work, my underwear wasn't too badly stained.\n\n\n**TL;DR:** Locked myself out of my car and condo, sharted, had to walk in the rain 2 miles to the bus. ", "tldr": " locked myself out of my car and condo, sharted, had to walk in the rain 2 miles to the bus. ", "summary_text": "locked myself out of my car and condo, sharted, had to walk in the rain 2 miles to the bus. *shit my pants.*", "rougescores": [{"rouge-1": {"f": 0.8888888839111112, "p": 0.8333333333333334, "r": 0.9523809523809523}, "rouge-2": {"f": 0.8837209252568958, "p": 0.8260869565217391, "r": 0.95}, "rouge-l": {"f": 0.8999999950125, "p": 0.8571428571428571, "r": 0.9473684210526315}}], "compression_ratio": 0.1062992125984252, "original_pos_tags": {"DT": 20, "NN": 38, "PRP": 21, "VBP": 3, "TO": 7, "CC": 10, ",": 12, "WDT": 1, "VBZ": 2, "IN": 22, "CD": 6, "NNS": 7, "RB": 19, "PRP$": 9, ".": 10, "VBD": 22, "VBG": 6, "NNP": 3, "VBN": 4, "RBR": 1, ":": 6, "VB": 6, "RP": 1, "JJ": 4, "JJR": 1, "WRB": 1}, "summary_pos_tags": {"VBN": 2, "PRP": 1, "IN": 3, "PRP$": 2, "NN": 5, "CC": 1, ",": 2, "VBD": 1, "TO": 2, "VB": 2, "DT": 2, "CD": 1, "NNS": 2, ".": 2}}
{"original_text": "i got up all groggy n shit, was all like \"shit, i gotta pee. cool, i dont have a boner.\" i sit down, with my good posture and a halfy goin on, i peed right through the gap and into my pajama pants. i didnt notice until my left foot started getting warmer than usual. that hasnt happened since i was in grade school. i would've gotten mad if i wasnt so tired.", "tldr": null, "summary_text": "i peed in my pajama pants and it was the first time i've done that since i was in grade school. i'm an idiot.", "rougescores": null, "compression_ratio": 0.30446927374301674, "original_pos_tags": {"NN": 18, "VBD": 7, "RB": 3, "DT": 5, "NNS": 3, "MD": 2, "VB": 1, ",": 5, "IN": 11, "``": 1, "JJ": 12, ".": 6, "VBP": 5, "''": 1, "PRP$": 3, "CC": 2, "VBG": 1, "JJR": 1, "VBN": 1}, "summary_pos_tags": {"NNS": 2, "VBP": 3, "IN": 4, "PRP$": 1, "NN": 7, "CC": 1, "PRP": 1, "VBD": 2, "DT": 2, "JJ": 2, "VBN": 1, ".": 2}}
{"original_text": "So, this girl in my class and I have been working on a number of projects lately and we've developed a great connection.  There seems to have been a number of signals, her calling things \"our song,\" texts for no reason, etc...  The only problem was that I was her group leader (she was working under me) and I felt it inapropriate to make my move while that was still the case.\n\nFast forward to last night, she comes over for a few drinks before we meet up with other classmates for a night at the bar.  The project finished the day before and I was starting to make more physical contact between us.  \n\nFriends come over, I get wasted....wake up the next morning with a different girl in my bed and her ignoring my calls.\n\nReddit, I fucked up!\n\ntl;dr - Like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up", "tldr": " like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up", "summary_text": "tried to make a move on a girl, slept with a different girl, fucked everything up tl;dr - like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up tl;dr - like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up tl;dr - like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up tl;dr - like a girl, finally decided it was safe to make a move, slept with a different girl", "rougescores": [{"rouge-1": {"f": 0.33057850963731994, "p": 0.19801980198019803, "r": 1.0}, "rouge-2": {"f": 0.31932772840901075, "p": 0.19, "r": 1.0}, "rouge-l": {"f": 0.8499999951125, "p": 0.7391304347826086, "r": 1.0}}], "compression_ratio": 0.6034883720930233, "original_pos_tags": {"RB": 4, ",": 10, "DT": 18, "NN": 30, "IN": 20, "PRP$": 7, "CC": 6, "PRP": 15, "VBP": 5, "VBN": 4, "VBG": 4, "NNS": 7, "JJ": 11, ".": 6, "EX": 1, "VBZ": 2, "TO": 5, "VB": 6, "``": 1, "''": 1, ":": 4, "VBD": 11, "(": 1, ")": 1, "NNP": 2, "RP": 5, "JJR": 1}, "summary_pos_tags": {"VBN": 1, "TO": 5, "VB": 5, "DT": 15, "NN": 28, "IN": 10, ",": 13, "JJ": 9, "VBD": 12, "RP": 4, ":": 8, "CC": 4, "RB": 4, "PRP": 4}}
{"original_text": "(Technically this is more of a Three Years Ago I Fucked Up, but I digress...)\n\nBack in the good old school days, we had Friday sport. This term, myself and a group of friends decided to join the Representative Touch Footy team, and we were waiting for the bus to take us to our semi final match.\nMy friend was sitting on the side of the grassy hill where we were waiting, and yelled \"Oi, come over here!\" and patted her lap.\n\nSo, naturally I went over and jumped into her lap, in a weak attempt to crush her legs. Much laughing ensued, which attracted the attention of our other friends. So, we ended up in a pile of about 10, resembling a pile of stacked-up chairs.\n\nOne of my teachers noticed, and walked over to us, shaking his head slightly. Of course, what is the most natural response to seeing a stack of people sitting in each others laps? Push the stack.\nSo, with eight people in front of me (with some pretty serious weight adding up there), we fell over sideways.\n\nAs the laughter increased tenfold, I heard a very faint clicking sound. Feeling my leg tense up, I looked down. Bad move.\n\nAbout five centimetres to the right of my leg was my knee cap, hanging (or levitating as it appeared from my angle) in midair.\n\nSo, after a number of very unladylike expletives and a bit of yelling/screaming, people noticed that my knee cap had attempted to escape my leg and called an ambulance. \nThen the bus showed up.\n\nSo, while my friends went to sport and got their asses kicked by a fellow high school, I sat on the side of the hill with my fucked up leg.\nThe paramedics show up, and ask if they can try and put my knee cap back in place without pain killers. At this point, the extremely light spring breeze which is flowing feels like razor blades cutting into my tendons, so I wasn't exactly keen on this idea.\n\nSo, they picked up the end of my leg and pulled.\n\nI think I punctured an eardrum, screaming. \n\nThey realise that this might not be the best plan, so I'm bundled up onto a stretcher and head off to hospital. Driving in an ambulance with a dislocated knee cap was never on my bucket list, but at least I've crossed it off?\n\nWhen I arrive at the hospital, I'm finally given the good pain killers (Nitrous oxide for the win, none of that \"Green Whistle\" shit) and the ER physio walks in. It took three people to stabilise me, while he pulled my foot and twisted. Behold, my knee cap FINALLY pops back in! They waited for me to come down of the high of the nitrous before fitting me in a knee brace and crutches.\n\nNote for the wise - a knee brace which holds your leg completely straight, thus making one leg longer than the other, will fuck you over. Worst two weeks ever.\n\nAfter a month, with crutches, a knee brace and some really pleasant taping, physiotherapy and an inability to climb stairs easily, my knee was finally released from its self-induced prison.\n\nI've never sat in that friend's lap again. I also got an A in Geography from that teacher at the end of that term.\n\nEdit: tl;dr: Sat in my friend's lap, douchebag teacher dislocates my knee, kneecap decides to stay locked to the side until I got to the hospital, drugs then two weeks on crutches.", "tldr": " sat in my friend's lap, douchebag teacher dislocates my knee, kneecap decides to stay locked to the side until i got to the hospital, drugs then two weeks on crutches.", "summary_text": "tried to crush my friend's legs, fell over, dislocated my knee cap, had to drive to hospital in an ambulance with a dislocated knee cap.", "rougescores": [{"rouge-1": {"f": 0.25454544958677694, "p": 0.28, "r": 0.23333333333333334}, "rouge-2": {"f": 0.03773584410110425, "p": 0.041666666666666664, "r": 0.034482758620689655}, "rouge-l": {"f": 0.13043477769376202, "p": 0.15, "r": 0.11538461538461539}}], "compression_ratio": 0.042794210195091255, "original_pos_tags": {"(": 4, "RB": 37, "DT": 60, "VBZ": 5, "JJR": 2, "IN": 84, "CD": 9, "NNS": 32, "PRP": 37, "VBD": 36, "RP": 10, ",": 43, "CC": 21, "VBP": 12, ":": 5, ")": 4, "JJ": 28, "NN": 110, "NNP": 13, ".": 34, "TO": 16, "VB": 17, "VBG": 18, "PRP$": 28, "WRB": 2, "``": 2, "''": 2, "VBN": 11, "WDT": 3, "WP": 1, "RBS": 1, "MD": 3, "JJS": 2, "POS": 2}, "summary_pos_tags": {"VBN": 2, "TO": 3, "VB": 3, "PRP$": 2, "NN": 6, "POS": 1, "NNS": 1, ",": 3, "VBD": 2, "RB": 1, "IN": 2, "DT": 2, "JJ": 1, ".": 1}}
{"original_text": "Today I fucked up by reading TIFU while my teacher was explaining my exam and what we were going to do at our exam.", "tldr": null, "summary_text": "today i fucked up by reading TIFU while my teacher was explaining my exam and what we were going to do at our exam. i fucked up by reading it while my teacher was explaining my exam and what we were going to do at our exam. i fucked up by reading it while my teacher was explaining my exam and what we were going to do at our exam. i fucked up by reading it while my teacher was explaining my exam and what we were going to do at our exam. i fucked up by reading it while my teacher was explaining my exam and what we were going to do at our exam. i fucked up by", "rougescores": null, "compression_ratio": 4.886956521739131, "original_pos_tags": {"NN": 4, "PRP": 2, "VBD": 3, "RP": 1, "IN": 3, "VBG": 3, "NNP": 1, "PRP$": 3, "CC": 1, "WP": 1, "TO": 1, "VB": 1, ".": 1}, "summary_pos_tags": {"NN": 22, "VBD": 16, "RP": 6, "IN": 16, "VBG": 15, "NNP": 1, "PRP$": 15, "CC": 5, "WP": 5, "PRP": 9, "TO": 5, "VB": 5, ".": 5}}
{"original_text": "I was at my girl's house today and her parents left to go watch a game. So I decide to move in and start putting my hand down in her pants, I finger her and she starts moaning. We were in the living room because nobody was there, as she was moaning I looked around and I see her brother pass by me, I stare at him for a quick second and he walks back into his room, she looks at me and we stop. I have him for classes and it's going to be really awkward for him knowing I fingered his sister at his house. So that's how I fucked up on fingering a girl at her place.", "tldr": null, "summary_text": "i fingered a girl at her house, her brother walks in and sees me, it's going to be awkward for him. i'm a dumbass.", "rougescores": null, "compression_ratio": 0.20176991150442478, "original_pos_tags": {"PRP": 21, "VBD": 8, "IN": 18, "PRP$": 10, "NN": 16, "POS": 1, "CC": 8, "NNS": 3, "TO": 3, "VB": 5, "DT": 5, ".": 5, "VBP": 6, "VBG": 6, "RP": 2, ",": 4, "VBZ": 5, "RB": 3, "JJ": 2, "WRB": 1}, "summary_pos_tags": {"NN": 6, "VBD": 1, "DT": 2, "IN": 3, "PRP$": 2, ",": 2, "NNS": 2, "CC": 1, "PRP": 3, "VBZ": 1, "VBG": 1, "TO": 1, "VB": 1, "RB": 1, ".": 2, "VBP": 1}}
{"original_text": "dirty sex toys were found, and I have to be out by the end of the month...  ", "tldr": null, "summary_text": "dirty sex toys were found, and i have to be out by the end of the month... dirty sex toys were found, and i have to be out by the end of the month...", "rougescores": null, "compression_ratio": 1.9605263157894737, "original_pos_tags": {"NN": 4, "NNS": 1, "VBD": 1, "VBN": 1, ",": 1, "CC": 1, "PRP": 1, "VBP": 1, "TO": 1, "VB": 1, "RP": 1, "IN": 2, "DT": 2, ":": 1}, "summary_pos_tags": {"NN": 8, "NNS": 4, "VBD": 2, "VBN": 2, ",": 2, "CC": 2, "VBP": 2, "TO": 2, "VB": 2, "RP": 2, "IN": 4, "DT": 4, ":": 2}}
{"original_text": "First of all, this occurred many years ago, but that doesn't change the amount of fuckuppery that took place.\n\nSo, I was in grade 6 or 7, it was November 11, and my school was having a Remembrance Day assembly. The assembly was typical - poems, a couple videos, etc, and then one of the younger grades had a song that they were going to perform. So they head up to the front of the gym and start doing their thing, and meanwhile I'm sitting on the floor with the rest of my class and I can feel a fart building up.\n\nIn retrospect, it would have been a good idea to unleash the gaseous buildup in my bowels while those younger kids were just beginning to belt out the lyrics to their song, but no, I was positive I could hold it in. \n\nSo I start awkwardly fidgeting around because of the discomfort from holding in the gaseous buildup. This fart was going to be enormous. I had stopped paying any attention to the ongoing song and instead put all of my focus towards holding this bad boy in. It was a valiant effort on my part, but I could tell it was a hopeless battle. I logically decided that I should let it come out while there's loud music being played and everyone is focused on how adorable the singing children are. Just as I am committing to the fart, the song ends.\n\nRemember how this was a Remembrance Day assembly? That means there is no clapping at any point because it would be disrespectful. Once that song ended, it was pure silence. But I had already gave the fart the green light to come out and there was no way to call it back. \n\nOn the bright side of things, it wasn't a wet fart, and nothing more than gas came out. But my god, everyone within a 3 metre radius stared at me, and what is my reaction? I try to laugh it off. So not only was I the kid who let out a huge-ass fart, but I'm also the kid who started laughing during a super-serious Remembrance day assembly.\n\n", "tldr": null, "summary_text": "let out a huge-ass fart during a Remembrance day assembly, everyone stared at me, and then laughed at me when the fart came out.", "rougescores": null, "compression_ratio": 0.06765327695560254, "original_pos_tags": {"NNP": 8, "IN": 34, "RB": 23, ",": 20, "DT": 45, "VBD": 27, "JJ": 20, "NNS": 8, "CC": 18, "VBZ": 7, "VB": 17, "NN": 55, "WDT": 1, ".": 19, "PRP": 29, "CD": 5, "PRP$": 9, "VBG": 15, ":": 1, "FW": 1, "JJR": 3, "TO": 11, "VBP": 7, "MD": 6, "RP": 7, "VBN": 5, "EX": 3, "WRB": 2, "WP": 3}, "summary_pos_tags": {"VB": 1, "RP": 2, "DT": 3, "JJ": 1, "NN": 4, "IN": 3, "NNP": 1, "RB": 2, ",": 2, "VBD": 3, "PRP": 2, "CC": 1, "WRB": 1, ".": 1}}
{"original_text": "So I got a windows 7 ultimate disc and decided i should upgrade and start fresh. I decide that I will keep all my files (about 400 gigs) so I brought my laptop to school to hook up to one of the extra hard drives while I had decided to reinstall. So get to school and whats the first thing my dumbass self does? Put the installation disc in and format the whole hard drive without backing up. so now I have lost all my videos, half finished projects, notes and school work. \n\nTL;DR: I wanted to upgrade my windows but didn't back up my files so now i have 400 gigs of videos and school work to redo/redownload. ", "tldr": " i wanted to upgrade my windows but didn't back up my files so now i have 400 gigs of videos and school work to redo/redownload. ", "summary_text": "i wanted to upgrade my windows but didn't back up my files so now i have 400 gigs of videos and school work to redo/redownload.", "rougescores": [{"rouge-1": {"f": 0.9803921518646674, "p": 1.0, "r": 0.9615384615384616}, "rouge-2": {"f": 0.9795918317367763, "p": 1.0, "r": 0.96}, "rouge-l": {"f": 0.977777772780247, "p": 1.0, "r": 0.9565217391304348}}], "compression_ratio": 0.2078559738134206, "original_pos_tags": {"RB": 8, "PRP": 7, "VBD": 6, "DT": 7, "NNS": 11, "CD": 4, "JJ": 8, "NN": 16, "CC": 7, "MD": 2, "VB": 12, ".": 6, "VBP": 4, "IN": 7, "PRP$": 6, "(": 1, ")": 1, "TO": 7, "RP": 3, "VBN": 2, "VBZ": 1, "VBG": 1, ",": 2, "NNP": 2, ":": 2}, "summary_pos_tags": {"RB": 4, "VBD": 2, "TO": 2, "VB": 3, "PRP$": 2, "NNS": 4, "CC": 2, "RP": 1, "VBP": 2, "CD": 1, "IN": 1, "NN": 2, ".": 1}}
{"original_text": "some friends of mine convinced me to play catch with them, but we didn't have a ball, so one of the kids found a sharpie, and I didn't wash my hands after.\n\nNow that I think about it, the pen did smell like ass, but I thought all black sharpies smell like ass. Besides, if someone was gonna stick a sharpie in their butt, wouldn't they throw it in the trash instead of just out the window?\n\nMy god, this is just like the time we found all those balloons", "tldr": null, "summary_text": "didn't wash my hands after playing catch with my friends, one of them found a sharpie, it smelled like ass, and if someone was gonna stick a sharpie in their butt, wouldn't they throw it in the trash?", "rougescores": null, "compression_ratio": 0.44150110375275936, "original_pos_tags": {"DT": 13, "NNS": 5, "IN": 16, "NN": 14, "VBN": 1, "PRP": 10, "TO": 2, "VB": 6, ",": 8, "CC": 3, "VBD": 7, "RB": 7, "CD": 1, "PRP$": 2, ".": 3, "VBP": 2, "JJ": 1, "VBG": 1, "MD": 1, "NNP": 1, "VBZ": 1}, "summary_pos_tags": {"VBD": 4, "RB": 2, "VB": 3, "PRP$": 3, "NNS": 2, "IN": 6, "VBG": 2, "NN": 7, ",": 4, "CD": 1, "PRP": 4, "DT": 3, "JJ": 1, "CC": 1, "TO": 1, "MD": 1, ".": 1}}
{"original_text": "This happened 2 minutes ago.  Me and my girlfriend were laying in my bed at my parents house relaxing (long distance relationship so things heat up fast) and naturally we start fooling around.  I'm feeling good she's doing great, and were both really into it, and this is where the fuck up begins.\n        In the heat of the moment we forgot to shut the door.  It kind of bothered me but we have gotten away with it before so no biggie.  Well today our luck ran out and right as she has my Steve Johnson in her hand and getting close, in barges my step-mom with papers to sign for school.  There we were... pants undone and my little-big man 2 inches from my girlfriends face,  we all made eye contact, dinner is in 15 minutes, and I'm not sure how this will go. Wish me luck!\n        Update 1: Turns out it wasn't as big of a deal as I made it out to be.  Dinner went fine with a minimal amount of dick jokes on the part of my step-mom and girlfriend.  I will always make time to shut the door before sexy times in the future!", "tldr": null, "summary_text": "had sexy time with girlfriend, forgot to shut the door, step-mom barges in, we all make eye contact, dinner is in 15 minutes.", "rougescores": null, "compression_ratio": 0.12171372930866602, "original_pos_tags": {"DT": 15, "VBD": 10, "CD": 4, "NNS": 12, "RB": 12, ".": 11, "NNP": 4, "CC": 10, "PRP$": 10, "NN": 28, "VBG": 5, "IN": 25, "(": 1, "JJ": 14, "VBP": 6, "RP": 6, ")": 1, "PRP": 18, "VBZ": 5, ",": 6, "WRB": 2, "TO": 4, "VB": 7, "VBN": 2, "EX": 1, ":": 2, "MD": 2}, "summary_pos_tags": {"VBD": 2, "JJ": 2, "NN": 6, "IN": 3, ",": 4, "TO": 1, "VB": 1, "DT": 2, "NNS": 2, "PRP": 1, "VBP": 1, "VBZ": 1, "CD": 1, ".": 1}}
{"original_text": "Okay so this morning I woke up extremely tired, looking for a way to wake my self up (I don't go back to sleep easily, so i decided to wake up instead). I chose food (what else!?)\n\nSo I went to the kitchen, poured some cereal into a bowl and got a cup, got out the milk and juice (I have the same god damn thing every day), and poured the milk into the cup and the juice on the cereal.\n\nThing is, as I was tired as fuck, I didn't notice until i put the first mouthful in my mouth. I noticed the odd taste, and actually LIKED it. I finished my breakfast as it is, no complaints. Won't do it again though, as it was a ridiculous amount of juice.\n\n**TL;DR: Woke up tired as fuck and poured juice on my cereal and liked it**", "tldr": " woke up tired as fuck and poured juice on my cereal and liked it**", "summary_text": "i woke up tired as fuck and poured juice on my cereal and liked it, but didn't notice until i put the first mouthful in my mouth.", "rougescores": [{"rouge-1": {"f": 0.6341463369660917, "p": 0.48148148148148145, "r": 0.9285714285714286}, "rouge-2": {"f": 0.6153846109401712, "p": 0.46153846153846156, "r": 0.9230769230769231}, "rouge-l": {"f": 0.6486486440905771, "p": 0.5, "r": 0.9230769230769231}}], "compression_ratio": 0.17916666666666667, "original_pos_tags": {"NNP": 3, "RB": 14, "DT": 17, "NN": 31, "PRP": 13, "VBD": 16, "RP": 3, "VBN": 3, ",": 10, "VBG": 1, "IN": 16, "TO": 4, "VB": 6, "PRP$": 4, "(": 3, "VBP": 3, ")": 3, ".": 8, "WP": 1, "CC": 7, "JJ": 6, "VBZ": 2, "NNS": 1, ":": 2}, "summary_pos_tags": {"NN": 6, "VBD": 4, "RB": 2, "VBN": 1, "IN": 4, "CC": 3, "JJ": 3, "PRP$": 2, "PRP": 1, ",": 1, "VB": 1, "DT": 1, ".": 1}}
{"original_text": "Okay, so this technically happened about a week or two ago, but I didn't decide to post it here until just now.\n\nSo my friends and I were walking down the hall before first period. This woman (whose face I never actually saw) was walking the opposite direction, carrying a lot of stuff. I saw her drop something small and, being the dashing young gentleman I am, I decided to help a sista out and pick it up for her. As I was bending over, I heard her say, \"No, you don't have to do that.\" Thinking she was just trying to be polite and not save me from any impending fuckup-ery, I continued bending over and placed my hand upon the fallen object. Noticing what it was, my eyes got wide.\n\nIt was a tissue. *Freshly used.*\n\nI guess she had a cold or whatever and had been blowing her schnozz all morning. Anyway, I managed to prevent any further embarrassment by not actually touching her snot (I was only a few centimeters away but it was far enough). I quickly got up and scurried away.\n\nI didn't get a good look at her face but she damn sure saw mine. So now there's a woman walking around my school who knows I almost touched a clump of her nasal discharge. I can never feel safe there, not ever.", "tldr": null, "summary_text": "tried to help a sista, almost touched a clump of her snot, now there's a woman walking around my school who knows.", "rougescores": null, "compression_ratio": 0.09515859766277128, "original_pos_tags": {"NNP": 2, ",": 12, "IN": 17, "DT": 19, "RB": 29, "VBN": 4, "NN": 30, "CC": 12, "CD": 1, "PRP": 28, "VBD": 23, "VB": 12, "TO": 5, ".": 15, "PRP$": 9, "NNS": 3, "VBG": 12, "RP": 2, "JJ": 14, "(": 2, "WP$": 1, ")": 2, "VBP": 3, "``": 1, "UH": 1, "''": 1, "WP": 2, "WDT": 1, "VBZ": 3, "EX": 1, "MD": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "VB": 1, "DT": 3, "NN": 5, ",": 2, "RB": 2, "VBD": 1, "IN": 2, "PRP$": 2, "EX": 1, "VBZ": 2, "VBG": 1, "WP": 1, ".": 1}}
{"original_text": "So here i am chillin in bed, my bong besides me with a packed bowl.. I decide to roast the little bugger and upon taking this huge rip while my lungs expand i tilt back a little too far and, I end up swallowing a gulp of week old bong water (daily smoker too). Shocked is an understatement...I did everything i could to stay calm and not think about what just happened.. I immediately run while gagging to the closest thing i could eat to mask this huge mistake and grab a jar of mustard.. lol. It worked but i was still \"shocked\" about what had just happened and wondering why i still felt the cold, grimy, nasty-ass taste had started to feel like a lump in my throat. There wasnt anything stuck there, it was just so vile the feeling lingered for at least 10 minutes after eating.\n\nI seriously advise everyone who does smoke, to do everything to avoid this.. and if you try to drink it all on a bet, you will regret it and you will puke. Stay safe people!", "tldr": null, "summary_text": "took a huge rip on my bong, tilt back a little too far and end up swallowing a gulp of week old bong water (daily smoker too).. ran to the closest thing i could eat to mask this huge mistake and grab a jar of mustard.. it worked but i was still \"shocked\" about what had just happened and wondering why i still felt the cold, grimy, nasty-ass taste had started to feel like a lump in my throat. there wasnt anything stuck there, it was just so vile the feeling lingered for at least 10 minutes after eating.", "rougescores": null, "compression_ratio": 0.5287356321839081, "original_pos_tags": {"RB": 16, "JJ": 14, "VBP": 9, "NN": 32, "IN": 18, ",": 7, "PRP$": 3, "PRP": 13, "DT": 14, "TO": 8, "VB": 13, "CC": 8, "VBG": 5, "NNS": 4, "RP": 1, "(": 1, ")": 1, ".": 6, "VBN": 4, "VBZ": 2, ":": 1, "VBD": 8, "MD": 4, "WP": 3, "JJS": 2, "``": 1, "''": 1, "WRB": 1, "EX": 1, "CD": 1, "NNP": 1}, "summary_pos_tags": {"VBD": 8, "DT": 9, "JJ": 8, "NN": 22, "IN": 10, "PRP$": 2, ",": 4, "VBN": 4, "RP": 2, "RB": 9, "CC": 4, "VB": 5, "VBG": 3, "(": 1, ")": 1, "VBZ": 1, "TO": 3, "JJS": 2, "MD": 1, "PRP": 2, "``": 1, "''": 1, "WP": 1, "WRB": 1, ".": 2, "EX": 1, "CD": 1, "NNS": 1}}
{"original_text": "**WARNING!: WALL OF TEXT WHICH COULD EASILY BE VIEWED AS REALLY FUCKING BORING**\n\nThe background of the relationship is that we had met online and hadn't met yet. He lives 200 miles away from where I live, but my life's rather busy and he doesn't have a job right now (unemployment in his region is over 50%, so I don't blame him). He's a very kind, sweet human being, and I probably would have been lucky to end up with him. Now, I'm not from the country I'm currently studying in, but I would like to end up here eventually. It seemed that the stars had aligned in showing me that there was hope for love here… Boy, was I wrong.\n\nThere's a huge secessionist movement within a different region (one which neither of us live in), which has been gaining traction over the years, especially with the recent economic collapse. I am a lover of said region; it's the place where I feel the most comfortable in the entire world — the people, the cuisine, the culture… all of it just *fits*.\n\nHe, however, does not feel the same way about this region. I already knew that, but it had been bothering me since he had called people from there \"obnoxious sheeps [sic]\", amongst other things. We have always had different communication styles (I'm a fucking loudmouth and he's rather reserved), but we had been making it work. This morning, however, I couldn't hold back some of my worries, and amongst other things, I mentioned how he wants to live in an entirely different country and how I would not.\n\nThe **tl;dr** would be that **he effectively told me I should live in a region he hates and I admire because I clearly don't understand the political climate — in so many words, we should break things off.** However, it's much deeper than that. Apparently, half his family is from said region (and it's the half he dislikes, of course), and he had lived there a very brief period of time. Despite all that, apparently he had never had a bad time there and no one ever did any harm to him. So I really couldn't figure out what his beef was with this place that has always seemed so charming to me.\n\nI don't know what else to say, really. I debated with him my point as best as I could, calling out flaws in his argument about the nature of the secessionist movement and the national identity of the people from that region. For a while I thought he could at least be tolerant of my deep regard for it but… it would appear that even that was impossible. I got fed up with his ad hominem attacks on me and on the people who live out there, and I told him he can act like a child all he likes, but it doesn't make a whole group of people terrible just for their geographical location.\n\nTbph, I'm a bit numb to it all. In January I had a whirlwind romance which tore me to pieces by the end of it. And having this happen without ever even meeting to see if we're compatible in the real world… Welp, I'm just done with men for a while. I don't feel anything and my only reaction to this whole thing was to clean my room and wash my sheets in a fervor. He apparently felt awful that he'd lost my respect, but rather I deleted him from all of our sources of communication, which I did so I wouldn't have to deal with his remorse.\n\nI'm not sure if I really fucked up today but… it would have been nice to at least have *tried* to make things work instead of leaving things off on such a sour note. C'est la vie.", "tldr": " would be that **he effectively told me i should live in a region he hates and i admire because i clearly don't understand the political climate — in so many words, we should break things off.** however, it's much deeper than that. apparently, half his family is from said region (and it's the half he dislikes, of course), and he had lived there a very brief period of time. despite all that, apparently he had never had a bad time there and no one ever did any harm to him. so i really couldn't figure out what his beef was with this place that has always seemed so charming to me.", "summary_text": "told my boyfriend that he should live in a region he hates and i admire because i don't understand the political climate. he doesn't feel the same way.", "rougescores": [{"rouge-1": {"f": 0.3142857110857143, "p": 0.7857142857142857, "r": 0.19642857142857142}, "rouge-2": {"f": 0.2173913012003781, "p": 0.5555555555555556, "r": 0.13513513513513514}, "rouge-l": {"f": 0.3333333298765432, "p": 0.75, "r": 0.21428571428571427}}], "compression_ratio": 0.04447717231222386, "original_pos_tags": {"NN": 84, ".": 28, ":": 3, "NNP": 17, "DT": 58, "IN": 75, "VBZ": 23, "PRP": 80, "VBD": 31, "VBN": 16, "CC": 22, "RB": 63, "CD": 3, "NNS": 23, "WRB": 4, "VBP": 20, ",": 34, "PRP$": 16, "POS": 1, "JJ": 40, "VB": 30, "(": 4, ")": 4, "VBG": 11, "MD": 15, "TO": 14, "RP": 8, "EX": 4, "WDT": 5, "RBS": 2, "``": 1, "''": 1, "JJR": 1, "PDT": 3, "WP": 3, "JJS": 2}, "summary_pos_tags": {"VB": 5, "PRP$": 1, "NN": 6, "IN": 3, "PRP": 3, "MD": 1, "DT": 3, "VBZ": 2, "CC": 1, "VBP": 1, "RB": 2, "JJ": 2, ".": 2}}
{"original_text": "A family has contacted me to paint a portrait of their grandmother who is dying. Emails have been sent back and forth about how they want it done, what I'm going to charge, and I just sent one now with the last line being \"Do I have a deadline?\" As soon as I clicked \"send\" my stomach flipped. I've never wanted an email to come back more.\n\n I hope they don't take it the wrong way because it really was a normal question to ask. I just wish I had used a different word. \n\nUpdate to come later. I feel like an insensitive jerk.\n\nUPDATE: I sent her an email saying, \"After sending the previous email I hadn't realized my wording in the last sentence. It came across as being insensitive and I apologize.\"\n\n\nUPDATE2: thanks for all the kind responses. Now if only I could get a response from the woman I've been talking to. It would put my mind at ease!\n\nFINAL EDIT: Her response, \"Haha you're fine. It wasn't insensitive at all. No set deadline.\"\nTHANKS EVERYONE, FALSE ALARM! :)", "tldr": null, "summary_text": "asked a family if they had a deadline for a portrait of their dying grandmother. feel like an insensitive jerk for using the word deadline in the last sentence.", "rougescores": null, "compression_ratio": 0.16359918200409, "original_pos_tags": {"DT": 17, "NN": 28, "VBZ": 2, "VBN": 8, "PRP": 25, "TO": 6, "VB": 10, "IN": 15, "PRP$": 5, "WP": 2, "VBG": 7, ".": 17, "NNS": 3, "VBP": 12, "RB": 15, "CC": 3, "WRB": 1, ",": 5, "VBD": 9, "CD": 1, "JJ": 10, "``": 4, "''": 4, "RBR": 1, ":": 4, "PDT": 1, "MD": 2, "NNP": 6, ")": 1}, "summary_pos_tags": {"VBN": 1, "DT": 6, "NN": 9, "IN": 6, "PRP": 1, "VBD": 1, "PRP$": 1, ".": 2, "VB": 1, "JJ": 2, "VBG": 1}}
{"original_text": "Some of you may remember this post from 4 months ago, (tripping in gym class and kising a girl by accident). Well, she (Emily) and I (Mark) are still going strong, we've been on about 15 dates, kissed numerous times, and, (can't belive I'm saying this) she put out once. This was all thanks to one redditor, (I cant remember his name). He was the one that gave me the courage to ask her out, and, even though he might not see this, I wanted to say thank you, from both Emily, and I.\n\nEDIT: I screwed the title up, no changing it now! \n\nEDIT(again): For those of you that I know will ask, this is her. http://imgur.com/zPO42LC\n\nEDIT(yet again): The top comment is about the phrasing of my words. For that, I'm very sorry I used that phrase. I was dumb in posting that, and, for that, I humbly ask for Reddit's forgivness. Thank you.", "tldr": null, "summary_text": "thank you redditor for giving me the courage to ask out a girl, and, for that, i want to say thank you to both of you.", "rougescores": null, "compression_ratio": 0.14199759326113118, "original_pos_tags": {"DT": 19, "IN": 18, "PRP": 22, "MD": 4, "VB": 8, "NN": 16, "CD": 3, "NNS": 5, "RB": 12, ",": 18, "(": 7, "VBG": 6, "JJ": 5, "CC": 6, ")": 7, ".": 9, "UH": 1, "NNP": 8, "VBP": 7, "VBN": 2, "VBD": 9, "RP": 3, "TO": 3, "PRP$": 3, "WDT": 1, ":": 4, "VBZ": 2, "POS": 1}, "summary_pos_tags": {"NN": 5, "PRP": 4, "VBP": 2, "IN": 3, "VBG": 1, "DT": 4, "TO": 3, "VB": 2, "RP": 1, ",": 3, "CC": 1, ".": 1}}
{"original_text": "I showed my mom my tumblr blog today. Everything was going great; she liked my pictures, but we never made it past my first page. After seeing my blog she wanted to make her own. \nAfter hearing her say that, I realized. OH MY GOODNESS, my mom will be able to see my blog and all the pictures of half naked men in that i have posted over the past few months. I closed my computer and immediately proceeded to try and convince her against it. Learned my lesson about trying to find something in common with my mom.", "tldr": null, "summary_text": "my mom will be able to see my tumblr blog and all the pictures of half naked men in that i have posted over the past few months. learned my lesson about trying to find something in common with my mom.", "rougescores": null, "compression_ratio": 0.390625, "original_pos_tags": {"PRP": 8, "VBD": 8, "PRP$": 13, "NN": 16, ".": 7, "VBG": 4, "JJ": 8, ":": 1, "NNS": 4, ",": 3, "CC": 4, "RB": 2, "IN": 11, "TO": 4, "VB": 6, "NNP": 3, "MD": 1, "PDT": 1, "DT": 3, "VBP": 1, "VBN": 2}, "summary_pos_tags": {"PRP$": 4, "NN": 7, "MD": 1, "VB": 3, "JJ": 6, "TO": 2, "CC": 1, "PDT": 1, "DT": 3, "NNS": 3, "IN": 6, "VBP": 1, "VBN": 2, ".": 2, "VBG": 1}}
{"original_text": "I had my electronics class today and my professor gave us an assignment where we have to make something from nothing. Nothing being the broken computers and other electronics that we could find in our workroom. \n\nMy group decided to build a boat, because honestly, hot gluing a block of styrofoam to a CPU fan is the easiest idea that any of us could think of, but we wanted to get a bit more creative. We found a couple of speakers in an old bin, and one with the audio output still intact with an auxiliary headphone cable, so we decided to play around with them a bit and see if we could mount them on our boat. \n\nBefore we began work on them, we had to see that they worked, so I took the speaker with the intact audio output, plugged it into my phone, hooked up the speaker to the oscillator, kicked it up to five volts, and started playing a song on my phone.\n\nLittle did I know that the current would travel through the speaker, up the auxiliary cable, into my phone's audio input where the battery beyond had a maximum load capacity of only three point eight volts. \n\nI literally held my phone in my hands as the voltage fried my motherboard and the screen turned black, never to turn on again. \n\n**TL;DR: I bricked my phone by giving it shock therapy with an oscillator.** ", "tldr": " i bricked my phone by giving it shock therapy with an oscillator.** ", "summary_text": "gave my phone shock therapy with an oscillator, bricked my phone by giving it shock therapy with an oscillator, and now my phone won't work.", "rougescores": [{"rouge-1": {"f": 0.5263157849722992, "p": 0.4, "r": 0.7692307692307693}, "rouge-2": {"f": 0.49999999555555563, "p": 0.375, "r": 0.75}, "rouge-l": {"f": 0.6896551674673009, "p": 0.625, "r": 0.7692307692307693}}], "compression_ratio": 0.10920436817472699, "original_pos_tags": {"PRP": 22, "VBD": 20, "PRP$": 11, "NNS": 7, "NN": 48, "CC": 7, "DT": 26, "WRB": 2, "VBP": 2, "TO": 9, "VB": 12, "IN": 33, ".": 8, "VBG": 4, "JJ": 15, "MD": 4, "NNP": 3, ",": 14, "RB": 7, "VBZ": 1, "JJS": 1, "RBR": 1, "CD": 4, "RP": 3, "POS": 1, ":": 2}, "summary_pos_tags": {"VBD": 2, "PRP$": 3, "NN": 8, "IN": 3, "DT": 2, ",": 2, "VBG": 1, "PRP": 1, "JJ": 1, "CC": 1, "RB": 2, "MD": 1, "VB": 1, ".": 1}}
{"original_text": "Hey bitches. Today I had a fucks ups cause I took a wee wee and got some piss dribbles on me hands and when I went to WASH MY HANDS I forgot bout those urine droplets and I cusped my hands together to get a drink, allowing for my leak and my wawa to mix and run down my throat. WEEEEEEEEEEEEEEEEEEEEEEEEEEE", "tldr": null, "summary_text": "took a wee, got piss dribbles on my hands, went to wash hands, wawa to mix and run down my throat, got piss dribbles on my hands, went to wash hands, wawa to mix and run down my throat, got piss dribbles on my hands, took a wee, got piss dribbles on my hands, went to wash hands, wawa to mix and run down my throat, got piss dribbles on my hands, took a wee, got piss dribbles on my hands, went to wash hands, wawa to mix and run down my throat, got piss dribbles on my", "rougescores": null, "compression_ratio": 1.5326797385620916, "original_pos_tags": {"NNP": 4, "NNS": 6, ".": 2, "NN": 7, "PRP": 6, "VBD": 6, "DT": 5, "IN": 4, "JJ": 3, "CC": 5, "WRB": 1, "TO": 3, "PRP$": 4, "RB": 1, "VB": 4, ",": 1, "VBG": 1, "RP": 1}, "summary_pos_tags": {"VBD": 14, "DT": 3, "NN": 11, ",": 17, "JJ": 7, "NNS": 17, "IN": 7, "PRP$": 11, "TO": 8, "VB": 12, "CC": 4, "RP": 4}}
{"original_text": "My sisters boyfriend sexually assaulted me in my sleep. I knew no one would react well, but I told them anyway. Now my little sister hates me because she thinks I tried to seduce her boyfriend because he told her I did and he rejected me. She believes him. My other family think I had a ptsd reaction or did what he said I did. \n\nI already didn't have friends. My boyfriends a porn addcit who is probably going to dump me soon. We were living together and then had a lot of problems and moved apart. He has trouble with me sexually in part because he thinks about all the timrs i was violated while we do it. He told me, not to be cruel but so i wouldnt think its because im ugly. Now i think im ugly and damaged goods. \n\nI had to give away my pets because I'm broke. I had a miscarriage. Everything and everyone I love dies or leaves and doesn't want or love me. Dark thoughts are crowding my head and I think about killing myself a lot because its hard to see the point of caring and you're alone. And it scares me because Im coming up with less and less reasons to even live. And that's not who I am. I just shouldn't have ever told anyone what happened to me because maybe then I'd have my family and my boyfriend would want to touch me. But I guess you never know.", "tldr": null, "summary_text": "i told my family my sisters boyfriend sexually assaulted me in my sleep and now my family hates me and my boyfriend is going to dump me and i'm broke.", "rougescores": null, "compression_ratio": 0.1182033096926714, "original_pos_tags": {"PRP$": 12, "NNS": 10, "VBP": 13, "RB": 26, "VBN": 4, "PRP": 44, "IN": 17, "NN": 23, ".": 19, "VBD": 19, "DT": 9, "MD": 4, "VB": 15, ",": 2, "CC": 18, "RP": 3, "JJ": 10, "VBZ": 9, "TO": 8, "WP": 4, "VBG": 5, "PDT": 1, "NNP": 2, "JJR": 1, "RBR": 1}, "summary_pos_tags": {"NN": 6, "VBD": 1, "PRP$": 5, "NNS": 1, "VBP": 2, "RB": 2, "VBN": 1, "PRP": 3, "IN": 1, "CC": 3, "VBZ": 2, "VBG": 1, "TO": 1, "VB": 2, ".": 1}}
{"original_text": "This I've liked for a while tells me she likes me, and she wants to text me over break. She puts the number in my sketchbook on Wednesday. Today is Thursday, last day. Usually, I have my sketchbook, but I didn't have anything I wanted to draw, so I left it in my locker all day. When the time came to go, I didn't have it, and I talked to her on the bus like always. \n\nShe even asks me if I had it, and, being a dumbass, says \"Uh, yeah.\"\n\nI get home and try to enter it in my phone. BUT NO, JNC96 is too smart to check if he has everything. I have my other sketchbook, but not the one she wrote on.\n\n\"...\"\n\n\"Ah *fuck*!\"\n\nSo now her mom wants to meet me, she wants to text me, and I don't have a number to text. I've done a similar thing with a ticket to a school play! I DON'T LEARN!\n\nFuck My Life Sideways. ", "tldr": null, "summary_text": "i didn't have my sketchbook, a girl wants to text me, i don't have a number to text, and she wants to meet me.", "rougescores": null, "compression_ratio": 0.13613861386138615, "original_pos_tags": {"DT": 12, "PRP": 30, "VBP": 7, "VBN": 2, "IN": 13, "NN": 25, "VBZ": 11, ",": 15, "CC": 7, "TO": 10, "VB": 13, ".": 14, "PRP$": 7, "NNP": 11, "JJ": 4, "RB": 11, "VBD": 8, "WRB": 1, "VBG": 1, "``": 2, "''": 4, "CD": 1, ":": 1}, "summary_pos_tags": {"NN": 4, "VBD": 1, "RB": 3, "VB": 5, "PRP$": 1, ",": 3, "DT": 2, "VBZ": 2, "TO": 3, "PRP": 3, "VBP": 1, "CC": 1, ".": 1}}
{"original_text": "I seldom go to Starbucks but today i decided i should go, well inner me decides, \"hey! Lets get a frappucino!\"  I'm lactose intolerant and coffee usually upsets my stomach, but hey I really wanted to go to try the new Hazelnut Frappe and this totally escaped my mind. Just because hey I'm thirsty! So I order it and drink it, shockingly for the first time in a while it didnt upset my stomach. Wow! So I go on about my day and go to the library for a couple of hours, leave campus and go to my local grocery store to buy lunch. \n\nI finally feel a rumble and start feeling cramps. Fuck this isn't good so I hurry about my business. I walk through the store and thought i had to fart. I was too trusting because next thing I feel is a warm splooge leaving my ass. Fuck this is not good! So I hurry and check out and get to my car. I squeeze my ass cheeks together and semi waddle to my car. Right when I get to my car it builds up and my body decides,\" fuck you bro!\" I shit myself. I felt warm hot liquid leave my ass, I cry a little. Thankfully I did have a change of clothes and found a public restroom. \n\nTl;dr go to starbucks, shit myself. ", "tldr": " go to starbucks, shit myself. ", "summary_text": "went to starbucks, got a frappucino, shit my ass, cried a little, went to starbucks, shit my ass, cried a little, went to starbucks, shit my ass, cried a little.", "rougescores": [{"rouge-1": {"f": 0.16666666388888893, "p": 0.1, "r": 0.5}, "rouge-2": {"f": 0.11764705631487893, "p": 0.06896551724137931, "r": 0.4}, "rouge-l": {"f": 0.33333332888888895, "p": 0.25, "r": 0.5}}], "compression_ratio": 0.14085739282589677, "original_pos_tags": {"PRP": 26, "RB": 18, "VBP": 17, "TO": 11, "NNP": 7, "CC": 14, "NN": 39, "VBD": 10, "MD": 1, "VB": 14, ",": 8, "IN": 12, "VBZ": 7, "``": 1, ".": 19, "DT": 15, "''": 3, "JJ": 19, "PRP$": 13, "UH": 1, "NNS": 6, "VBG": 1, "RP": 1, "WRB": 1, ":": 1}, "summary_pos_tags": {"VBD": 7, "TO": 3, "NNS": 3, ",": 9, "DT": 4, "NN": 4, "VB": 3, "PRP$": 3, "JJ": 3, ".": 1}}
{"original_text": "This was actually a few weeks ago, but over the course of my relationship with my girlfriend we have shared quite a lot of intimate texts between each other. Among those however are the rest of our texts, usually filled with sweet messages, thoughtful things, important life events, etc. I have my phone set to back up all of my texts and upload them to my Dropbox account, which is synced with my computer.\n\nOne day, I had to help share a file between my computer and my brother's. I set up my Dropbox account on his computer so that the file transfer could be easier. Little did I know, his computer would not only have access to my files, but be notified when a new file was uploaded.\n\nA few days later, my phone uploads the recent backup of my texts, and my brother sees it. Since it had a weird file name, he opened it to make sure it wasn't some virus. Sure enough, the first text he sees is the beginning of a sext from my girlfriend, going into much detail about how we want to fuck each other and how horny we are. He didn't read the whole thing, but now my younger knows about my sex life in excruciating detail.\n\nEdit**TL;DR: Accidentally backed up sexts to brother's computer, he discovered them, he now knows the things my girlfriend and I do in bed.", "tldr": " accidentally backed up sexts to brother's computer, he discovered them, he now knows the things my girlfriend and i do in bed.", "summary_text": "accidentally backed up sexts to brother's computer, he discovered them, he now knows the things my girlfriend and I do in bed. oops.", "rougescores": [{"rouge-1": {"f": 0.9333333283358024, "p": 0.9130434782608695, "r": 0.9545454545454546}, "rouge-2": {"f": 0.8837209252352624, "p": 0.8636363636363636, "r": 0.9047619047619048}, "rouge-l": {"f": 0.9302325531422391, "p": 0.9090909090909091, "r": 0.9523809523809523}}], "compression_ratio": 0.10451306413301663, "original_pos_tags": {"DT": 21, "VBD": 10, "RB": 15, "JJ": 17, "NNS": 9, ",": 17, "CC": 8, "IN": 22, "NN": 45, "PRP$": 20, "PRP": 19, "VBP": 8, "VBN": 6, ".": 11, "FW": 1, "TO": 7, "VB": 9, "RP": 3, "NNP": 4, "WDT": 1, "VBZ": 7, "CD": 1, "POS": 2, "MD": 2, "JJR": 1, "WRB": 3, "VBG": 2, ":": 2}, "summary_pos_tags": {"RB": 2, "VBD": 2, "RP": 1, "NN": 5, "TO": 1, "POS": 1, ",": 2, "PRP": 4, "VBZ": 1, "DT": 1, "NNS": 2, "PRP$": 1, "CC": 1, "VBP": 1, "IN": 1, ".": 2}}
{"original_text": "My life has gone to hell recently. About a month ago, my ex and I broke up, which I am over now, but then today happened.\nIt was a normal schoolday, and I had gotten home. I dropped my phone, cracking the inner screen (which means it won't work anymore), and in addition, there was a break in the motherboard of the phone. A few days prior to this, I've been working on my computer, because it wouldn't boot into BIOS properly, and I threw my phone in a fit of rage. It flew towards the computer whose case was open from yesterday, and my phone slammed into the 660TI graphics card, damaging the fan, and the PCI port. I'm currently typing this from my XBox 360, Phoneless, Computerless, and alone. :(", "tldr": null, "summary_text": "dropped my phone, broke the motherboard, and threw my phone at my computer, damaging the graphics card, fan, and the port on the motherboard.**", "rougescores": null, "compression_ratio": 0.20399429386590584, "original_pos_tags": {"PRP$": 7, "NN": 25, "VBZ": 2, "VBN": 3, "TO": 2, "VB": 3, "RB": 12, ".": 7, "IN": 13, "DT": 14, ",": 16, "CC": 8, "PRP": 11, "VBD": 10, "RP": 1, "WDT": 2, "VBP": 3, "JJ": 3, "VBG": 4, "(": 2, "MD": 2, ")": 1, "EX": 1, "NNS": 2, "NNP": 4, "WP$": 1, "CD": 2, ":": 1}, "summary_pos_tags": {"VBD": 3, "PRP$": 3, "NN": 9, ",": 5, "DT": 4, "CC": 2, "IN": 2, "VBG": 1, "NNS": 1, ".": 1}}
{"original_text": "My cat likes to sit on my toilet as I'm showering. Probably because he likes how warm the bathroom gets as I'm showering. And my house had (or has in this instance) a mouse. So the other day I jump in the shower. And sure enough my cat is sitting on the toilet, as usual. So I'm showering and I decide to shave my pubes. So I grab my razor and start shaving. Not even 5 seconds after starting, my cat jumps at my shower curtains, startling me, and in the process, I nick my dick. Apparently my cat was pouncing at the mouse. I'm still wondering why he would jump at the curtains, I'm fairly sure the mouse wasn't on the edge of the tub, but at least he got it. Fortunately it was a small nick, bled a little and stung like a bitch. Can't imagine how terrible it would be if it were any bigger. I'm not letting my cat sit on the toilet when I shower anymore\n\nNow that I read this over, I don't think this should be on tifu. Oh well", "tldr": null, "summary_text": "my cat jumped at my shower curtains, startling me, and i nicked my dick because he was pouncing at a mouse. don't let your cat sit on the toilet when you shower.", "rougescores": null, "compression_ratio": 0.17311827956989248, "original_pos_tags": {"PRP$": 11, "NN": 27, "NNS": 6, "TO": 2, "VB": 8, "IN": 24, "PRP": 21, "VBP": 13, "VBG": 10, ".": 13, "RB": 15, "VBZ": 4, "WRB": 4, "JJ": 9, "DT": 19, "CC": 8, "VBD": 7, "(": 1, ")": 1, ",": 9, "CD": 1, "MD": 3, "JJS": 1, "NNP": 1, "JJR": 1, "UH": 1}, "summary_pos_tags": {"PRP$": 4, "NN": 8, "VBD": 3, "IN": 4, "NNS": 1, ",": 2, "VBG": 2, "PRP": 3, "CC": 1, "DT": 2, ".": 2, "VBP": 2, "RB": 1, "VB": 1, "WRB": 1}}
{"original_text": "Bitches, man.", "tldr": null, "summary_text": "", "rougescores": null, "compression_ratio": 0.0, "original_pos_tags": {"NNS": 1, ",": 1, "NN": 1, ".": 1}, "summary_pos_tags": {}}
{"original_text": "Forgive me for any grammar mistakes, I'm not very good with words\n\nSo, I was watching my little cousin fiddling around on my moms iPad, just playing games and the usual until he stumbled across bachelor party photos. THANK GOD this wasn't my mom's bachelor party, it was actually a distant aunt's, I saw some of the following: balloons shaped like dicks, distant aunt sucking a dildo, distant aunt pretending dido is her penis while she has another person suck it. My cousin is only 3 years old, so he understands none of that, I quickly snatch up the iPad and replace it with mine. I go to the living room and I hear a loud bang. My iPad was on the floor and it wasn't broken but the screen was veeery dark.", "tldr": null, "summary_text": "cousin found bachelor party photos on my mom's ipad, i replaced it with my own and now my screen is veeery dark and my ipad is on the floor.", "rougescores": null, "compression_ratio": 0.1977401129943503, "original_pos_tags": {"CD": 2, "PRP": 14, "IN": 11, "DT": 14, "NN": 27, "NNS": 7, ",": 9, "VBP": 4, "RB": 10, "JJ": 9, "NNP": 3, "VBD": 9, "VBG": 5, "PRP$": 6, "VB": 3, "CC": 5, ".": 5, "POS": 2, ":": 1, "VBZ": 4, "RP": 1, "TO": 1, "VBN": 1}, "summary_pos_tags": {"NN": 11, "VBD": 2, "IN": 3, "PRP$": 4, "POS": 1, ",": 1, "PRP": 1, "JJ": 2, "CC": 2, "RB": 1, "VBZ": 2, "DT": 1, ".": 1}}
{"original_text": "I say today i fucked up but really it was on St Patricks day.\n\nBeing irish, St Patricks day is a big deal to us and that means getting shit faced and having a good time, and thats what i did. I got pretty drunk, went to a club and had a great St Paddys day. There were bands playing and it was genrally just a great night!\n\nI left the club at about 2am and ended up fucking about outside for a while with my friends, i had to get a bus at 2.30am so i had 30 minutes to kill.\n\nThose 30 minutes soon past and the bus pulled up to collect us and bring us home but there was a problem. The bus was on the other side of a waist high, stone wall. I could have walked round it but no, i wanted to jump over it.\n\nI sprinted at the wall and being pretty drunk i stumbled, but continued running at the wall even though i was off balance. Jumped. Foot slipped, and my leg went straight down onto a pointy rock. It hurt like fuck. Didnt care though, so i got on the bus. It was really sore so i rolled my jeans up and seen a massive bloody hole in my leg (http://i.imgur.com/0OUC95X.jpg) I didnt want to go to hospital so i just flicked blood at everyone on the bus for the craic. I was told to go to the hospital by my friends but all i could say was \"dont worry, ill wake up tomorrow and it will be gone.\"\n\nWoke up the next morning. It wasnt gone. So i went to the hospital and they stitched it up. (http://i.imgur.com/rCh9Fpo.jpg)\n\n8 stitches.\n\nHurts like fuck but id do it all again. I love St Patricks Day!\n\nBonus pic: http://i.imgur.com/IkNTXy0.jpg", "tldr": null, "summary_text": "got drunk, ran over a wall, cut my leg open, went to hospital and got 8 stitches. (http://i.imgur.com/rCh9Fpo.jpg)", "rougescores": null, "compression_ratio": 0.07392996108949416, "original_pos_tags": {"PRP": 22, "VBP": 5, "NN": 57, "VBD": 31, "RP": 4, "CC": 19, "RB": 20, "IN": 27, "NNP": 11, ".": 21, "VBG": 7, "JJ": 19, ",": 10, "VBZ": 4, "DT": 28, "TO": 11, "NNS": 9, "VBN": 7, "WP": 1, "EX": 2, "CD": 5, "PRP$": 5, "VB": 13, "MD": 3, "(": 2, ":": 4, ")": 2, "``": 1, "''": 1}, "summary_pos_tags": {"VBD": 4, "NN": 6, ",": 3, "IN": 1, "DT": 1, "VB": 1, "PRP$": 1, "JJ": 1, "TO": 1, "CC": 1, "CD": 1, "NNS": 1, ".": 1, "(": 1, ":": 1, ")": 1}}
{"original_text": "Well it wasn't today but rather last night.... After a few drinks and a blunt (we are both ents), my boyfriend and I decided to \"do the dirty\" since its been a few days. We were getting really into it when he decides he wants to do anal again. I'm not a big fan but we have done it before and he knows to be gentle so I said why not. I'm pretty sure he was on e too because he lasted way longer than normal and he was going pretty fast when we switched it up. After telling him a few times to slow down because it hurt, he switched back to good old vaginal intercourse from behind. Well, here is where the Fuck up happened. Any of you ladies who have done anal are probably aware of that \"poopy feeling\" after, so of course that was happening. He was still going in from behind, so I decided to stick my butt up and arch my back down because it drives him insane, when all of a sudden I felt a fart rumbling through.....then it happened. Though, It was more than a fart. We both stopped and I asked sheepishly if there was a mess, he said no then promptly ran to the bathroom. I heard the shower go on and that's when I knew he was just trying to not make a big deal of it. \n\nWhen he came out of the shower I ran in the bathroom almost in tears and showered as well. I came back out and didn't even want to say anything, I was horrified. He assured me it was ok and that we would pretend it never happened, and all night and all day he was being a lot nicer than usual knowing that although I'm not embarrassed by much at all, when I am embarrassed, i don't take it lightly. \n\nTL;DR: I sharted on my boyfriend during sex.", "tldr": " i sharted on my boyfriend during sex.", "summary_text": "sharted on my boyfriend during sex, he didn't make a big deal of it, and we were both nice about it all day and all night.", "rougescores": [{"rouge-1": {"f": 0.303030299687787, "p": 0.19230769230769232, "r": 0.7142857142857143}, "rouge-2": {"f": 0.2580645130072841, "p": 0.16, "r": 0.6666666666666666}, "rouge-l": {"f": 0.3225806416649324, "p": 0.20833333333333334, "r": 0.7142857142857143}}], "compression_ratio": 0.07526218383713756, "original_pos_tags": {"IN": 40, "PRP": 50, "VBD": 36, "RB": 34, "NN": 33, "CC": 14, "JJ": 20, ":": 4, ".": 16, "DT": 27, "NNS": 6, "(": 1, "VBP": 10, ")": 1, ",": 12, "PRP$": 5, "TO": 9, "``": 2, "VB": 12, "''": 2, "VBN": 5, "VBG": 8, "WRB": 8, "VBZ": 6, "RP": 3, "UH": 1, "NNP": 3, "WP": 1, "WDT": 1, "RBR": 1, "EX": 1, "MD": 1}, "summary_pos_tags": {"VBN": 1, "IN": 4, "PRP$": 1, "NN": 5, ",": 2, "PRP": 4, "VBD": 2, "RB": 1, "VB": 1, "DT": 4, "JJ": 2, "CC": 2, ".": 1}}
{"original_text": "I swallowed a Prozac capsule with some water and things seemed fine. About 10 minutes later, I burped and what looked like *smoke* puffed out of my mouth.\n\nI was alarmed, but then remembered the pill I had taken. I'm guessing it became lodged in my throat somewhere and dissolved, and I burped up the powder.\n\nThe powder was very acidic and gave me a sore throat made me queasy for awhile.", "tldr": null, "summary_text": "swallowed a pill, burped up the pill, burped up acidic powder, had a sore throat for a few minutes, thought it looked like smoke.", "rougescores": null, "compression_ratio": 0.33161953727506427, "original_pos_tags": {"PRP": 9, "VBD": 13, "DT": 6, "NNP": 2, "NN": 10, "IN": 6, "CC": 6, "NNS": 2, "JJ": 3, ".": 5, "CD": 1, "RB": 4, ",": 3, "WP": 1, "PRP$": 2, "VBN": 4, "VBP": 1, "VBG": 1, "RP": 1, "VB": 1}, "summary_pos_tags": {"VBD": 6, "DT": 4, "NN": 6, ",": 4, "RP": 2, "JJ": 2, "IN": 2, "NNS": 1, "PRP": 1, ".": 1}}
{"original_text": "Throwaway because she reads here some times.\n\nSo I bought a tablet because I was moving, and planning to keep my gaming computer in a public area. The intent was for the tablet to be, primarily, a medium for streaming porn to private parts of the house where I could enjoy it and not be creepy with porn in the living room.\n\nAnyway, she and I play together in a band. I play bass, she plays flute. At practice last night I handed her my tablet so she could look up sheet music for a piece we're working on. I notice this look of amusement on her face as she opens the browser but it doesn't hit me until she hands it back...it opened to my last session.\n\nSo there she sat, in the middle of band practice, as I reveal my tastes in porn to her. She didn't say anything, just opened a new tab and pulled up sheet music. Handed it back to me when we were done, and that's when it hit me that she had seen. \n\nDunno how to face her now.\n\n**update:** asked her out tonight, shot down again :/ oh well, worth it.", "tldr": null, "summary_text": "gave my girlfriend my tablet so she could look up sheet music for a piece we're working on, she saw my porn collection in the middle of band practice.", "rougescores": null, "compression_ratio": 0.14940239043824702, "original_pos_tags": {"RB": 13, "IN": 25, "PRP": 31, "VBZ": 6, "DT": 15, "NNS": 3, ".": 12, "VBD": 14, "NN": 36, "VBG": 5, ",": 11, "CC": 6, "TO": 7, "VB": 8, "PRP$": 7, "JJ": 6, "WRB": 4, "MD": 2, "VBN": 3, "NNP": 2, "VBP": 6, "RP": 5, ":": 3, "EX": 1}, "summary_pos_tags": {"VBD": 2, "PRP$": 3, "NN": 9, "IN": 5, "PRP": 3, "MD": 1, "VB": 1, "RP": 1, "DT": 2, "VBP": 1, "VBG": 1, ",": 1, "JJ": 1, ".": 1}}
{"original_text": "So closing time rolls around at the restaurant where I work and I see that one of the waitresses is emptying the ice machine into an almost full bucket with water. I thought that it would be really heavy if she filled it up all the way so I decided I would help out and dump it out for her before she finished, making it lighter. Well, apparently the manager who is a good friend tells the (hot)waitress that she owes me a hug and a kiss...\n\nHere's where I Fuck up. I come back and she says \"Michael (the manger) told me I owe you a hug and a kiss for helping me.\" Me, being an anxious, never-been-kissed and never had a real girlfriend virgin, freak the Fuck out and stutter out \"nah, don't worry about it.\" She didn't...", "tldr": null, "summary_text": "manager told hot waitress she owes me a hug and a kiss for helping her out, i freak out and stutter out and she doesn't worry about it.", "rougescores": null, "compression_ratio": 0.18698060941828254, "original_pos_tags": {"IN": 14, "NN": 18, "NNS": 2, "RB": 11, "DT": 16, "WRB": 2, "PRP": 22, "VBP": 6, "CC": 7, "CD": 1, "VBZ": 6, "VBG": 4, "JJ": 7, ".": 5, "VBD": 8, "MD": 2, "VB": 5, "RP": 5, "PDT": 1, "PRP$": 1, ",": 6, "JJR": 1, "NNP": 4, "WP": 1, "(": 2, ")": 2, ":": 2, "``": 2, "''": 2}, "summary_pos_tags": {"NN": 4, "VBD": 1, "JJ": 1, "PRP": 5, "VBZ": 2, "DT": 2, "CC": 3, "IN": 3, "VBG": 1, ",": 1, "VB": 3, "VBP": 1, "RP": 2, "RB": 1, ".": 1}}
{"original_text": "Ok so first off i would like to say its not funny till the end so prepare to be like \"o shit\" and then \"is this ever going to end\" but enjoy.\n So i was going downstairs about 2 hours ago to get something to eat and possibly to drink. While downstairs i notice my mother eating a salad, and naturally i was like fuck yea salad i love me some salad. upon investigation of the refrigerator I notice that there isn't any salad left. (btw fuck you grammer nazi's because i dont care about my punctuation) I decide that im going to be crafty...so i grab it and sneak behind my mother and yell loudly that i was the salad ninja and stole a bite. Now as this happens she turns and looks at me with dissapointment  in her eyes as she yells \"stay off my fu-.......\" and at that moment she looks up at me and gasps that she cant breathe and needs help. so i do what i think the fucking Heimlich maneuver is, which wasnt pretty at all, and fail horribly and start yelling for her to breathe because it was all i could think to do and this woke my step-dad. at this moment i realized she was coughing which means she was breathing to some extent. my stepdad rolls in the kitchen and tries to pull off his version of the Heimlich maneuver as well which also wasnt pretty at all. and after some trial and error he looks at me realizing she is breathing as well sort of saying \"what the hell are we in here doing as far as i know shes fine.\" then he looks back down at her only to look up again and stare into my eyes as if he is looking at my soul or something for at least 15 seconds which felt like a year or something. then my wife comes down the stairs and she starts freaking out and calls the ambulance and i realize why she was shocked as i saw the puddle of blood coming from my mothers mouth. The squad showed up and they asked questions like her name and other various things a squad would ask before packing her up in the gurney and rolling out to the hospital. my step-dad left shortly after and i havnt seen or heard from them yet. Although i had a terrible realization just a few minutes ago...\n\nI would like to start off by saying that my step-fathers half mexican daughter is coming to ohio tomorrow to see her father for the first time in her life. (she is 29 years old) So tomorrow is a very special day, but just like the dumbass idea of salad ninja i decided to be an ass again and do something even more stupid. I decided that since she is part mexican she must be catholic right? riiiiiiiiiiiiiight. So i also think who is the biggest catholic ever....Muffuckin hitler. So since i was going to be the first person she sees at 10 AM tomorrow morning i thought i would shave my head and all of my facial hair except for a hitler mustache and completely act like it was normal and this is how i look all the time. \n\nOf course i forget about this completely as it was several hours before and no one else had known about it. This also made me realize that the 15 seconds my step-dad stared into my soul was actually the 15 seconds my step-dad was wondering why in the fuck does this dumbass have a fucking hitler mustache. As i have said i hadnt talked to anyone about it and no one knew anything about it, nor have i talked to anyone since it happened and im sure im going to hear about his when they all get home. Im not really sure how to explain a hitler mustache to anyone, if anyone has ideas im open for them. However i definitely would say that i fucked up hardcore and this isnt going to be a good convo at all...fml.\n\nTL:DR: I damn near killed my mom while being the \"salad ninja\" and had to explain what had happened to the paramedics while having a hitler mustache.", "tldr": " i damn near killed my mom while being the \"salad ninja\" and had to explain what had happened to the paramedics while having a hitler mustache.", "summary_text": "tried to be a salad ninja and save my mother's life and now my step-fathers half mexican daughter is coming to see her father for the first time in her life.", "rougescores": [{"rouge-1": {"f": 0.21052631082794718, "p": 0.1935483870967742, "r": 0.23076923076923078}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.16666666170138905, "p": 0.15384615384615385, "r": 0.18181818181818182}}], "compression_ratio": 0.042663043478260866, "original_pos_tags": {"NNP": 6, "RB": 52, "IN": 91, "NN": 118, "MD": 7, "VB": 38, "TO": 26, "PRP$": 28, "JJ": 47, "DT": 59, "``": 5, "''": 5, "CC": 39, "VBZ": 26, "VBG": 24, "VBP": 26, ".": 27, "VBD": 31, "NNS": 22, "CD": 7, ",": 6, "PRP": 40, "EX": 1, "(": 2, "POS": 1, ")": 2, ":": 8, "RP": 8, "WP": 4, "WDT": 4, "JJS": 2, "WRB": 5, "VBN": 10, "RBR": 1, "PDT": 1}, "summary_pos_tags": {"VBN": 1, "TO": 2, "VB": 3, "DT": 2, "JJ": 4, "NN": 7, "CC": 2, "PRP$": 4, "POS": 1, "RB": 1, "NNS": 1, "VBZ": 1, "VBG": 1, "IN": 2, ".": 1}}
{"original_text": "Well, today was farming day, and I was needed to do a lot of job outdoors. So I thought about applying mosquito repellent on my skin to not to be distracted by stings. There was two bottles of spray on the shelf - mosquito repellent and \"do not apply directly on skin\" tick repellent. Guess what spray I used without looking.\n\nThe first cases of my fuck-up was that mosquitoes still stang me. Well, I thought, time for the refill. I went home and applied some real mosquito repellent. After roughly 15 minutes the burning started. Goddammit, it must be an allergy. Oh well, gonna get some anti-allergen pills and everything will be fine. Nope, after half a hour the burning still continued to incapacitate me from doing anything but wander around and swear to my body. Time to head to shower - there I would get my relief. NOOOOOPE. It started to burn even worse - it was like I jumped into nettle and started to roll all over it. The more time I spend in water - the more unbearable it became. Body lotion? Uh-uh. Oil? Spent. Welp, there's only one solution - right now I'm standing under air conditioner - cold air ceases the burning a little. \n\nSo, mates, what should I apply to get rid of burning?", "tldr": null, "summary_text": "didn't read the label, applied mosquito repellent on my skin instead of tick repellent. burned like hell for half an hour. what should i apply to get rid of burning?", "rougescores": null, "compression_ratio": 0.13738551207327226, "original_pos_tags": {"RB": 13, ",": 10, "NN": 34, "VBD": 16, "VBG": 8, "CC": 7, "PRP": 17, "VBN": 2, "TO": 11, "VB": 17, "DT": 15, "IN": 22, "NNS": 8, ".": 21, "JJ": 13, "PRP$": 4, "EX": 3, "CD": 3, ":": 6, "``": 1, "VBP": 4, "''": 1, "WP": 2, "NNP": 8, "MD": 4, "PDT": 1, "JJR": 2, "RBR": 1, "VBZ": 2, "SYM": 1}, "summary_pos_tags": {"VBD": 1, "RB": 2, "VB": 4, "DT": 2, "NN": 5, ",": 1, "VBN": 2, "JJ": 4, "IN": 5, "PRP$": 1, ".": 3, "PDT": 1, "WP": 1, "MD": 1, "TO": 1, "VBG": 1}}
{"original_text": "Using my spare-throwaway account for this...\n\nRight, I went to the shops are bought myself some chocolate milk (there is a bloody amazing brand of it in the shops) and I came home, browsed reddit on my phone for 15 minutes, then went to drink my milk. As I was drinking some, my little sister comes up to me and says \"Give me some milk.\" I said \"No, get your own milk.\" \"Please?\" \"No\". She the got really pissed off, walked into the kitchen and grabbed a bowl and smashed it on the floor. I said \"What the hell did you do that for?!\" I went up to the shards and called for my Mum, just as my little sis grabs one of the shards are stabs me in the arm. \n\nMy little sister is 2 years old.", "tldr": null, "summary_text": "didn't give my little sister her own milk, she smashed a bowl and stabbed me in the arm with one of the shards, just as my little sis grabs one of the shards and stabs me in the arm.", "rougescores": null, "compression_ratio": 0.2653061224489796, "original_pos_tags": {"VBG": 2, "PRP$": 8, "JJ": 9, "NN": 17, "IN": 13, "DT": 17, ":": 1, "NNP": 4, ",": 7, "PRP": 14, "VBD": 13, "TO": 4, "NNS": 6, "VBP": 3, "VBN": 4, "(": 1, "EX": 1, "VBZ": 4, ")": 1, "CC": 5, "CD": 3, "RB": 4, "VB": 4, ".": 10, "RP": 2, "``": 5, "''": 5, "WP": 1}, "summary_pos_tags": {"VBD": 4, "RB": 2, "VB": 2, "PRP$": 3, "JJ": 4, "NN": 5, ",": 2, "PRP": 3, "DT": 5, "CC": 2, "IN": 6, "CD": 2, "NNS": 2, ".": 1}}
{"original_text": "It's my birthday today and I'm skimming the edge of life right now. What do I mean by that? I've got two bald tires on my car and one has a slow leak. I have to pump that tire up (150 strokes) to get it to 30 lbs of pressure almost every time I have to drive anywhere. At least I have a car that runs. My wages were just garnished by the state to the tune of 25% of each paycheck for the next 4 months in order to pay taxes I couldn't pay a couple of years ago (my own damn fault). I'm surviving by the skin of my teeth and it's a rough go but not as rough as the brothers and sisters I see living on the street. I exited a store today and laying next to my car, was a wallet. I picked it up, got into my car and immediately looked to see how much money was in it. $30. Damn! I could really use that money! Damn! I looked at the driver's license and recognized the person that I had just seen in the store. I really wanted to just drive away and think of that money as a (birthday present presented to me by the powers that be) but my stomach started to flip flop and I knew that if I had lost my wallet, I would hope that some kind person would return it to me, un-molested. I went into the store, found the guy and gave him his wallet back. He was very appreciative and I felt happy for him while wanting that $30 at the same time. I was conflicted. In the end, I felt good doing what's right. Right now, sitting here writing this, I know I made the right decision. There are no 'buts' here. We must all look out for each other. That realization is the best present I will receive today. Take care of each other. Peace.  Oh, wait...  This isn't a fuck up...  unless I was a bankster.", "tldr": null, "summary_text": "i lost a wallet with $30 in it and gave it back to the person who found it. i felt good doing what's right but i felt bad doing what's right at the same time.", "rougescores": null, "compression_ratio": 0.09376854599406528, "original_pos_tags": {"PRP": 38, "VBZ": 7, "PRP$": 10, "NN": 54, "CC": 13, "VBP": 10, "VBG": 8, "DT": 40, "IN": 35, "RB": 22, ".": 26, "WP": 2, "VB": 16, "VBN": 7, "CD": 7, "JJ": 18, "NNS": 11, "TO": 12, "(": 3, ")": 3, "JJS": 2, "WDT": 2, "VBD": 23, "MD": 6, ",": 9, "RP": 4, "WRB": 1, "$": 2, "NNP": 4, "POS": 2, "EX": 1, ":": 2}, "summary_pos_tags": {"NN": 4, "VBD": 5, "DT": 3, "IN": 3, "$": 1, "CD": 1, "PRP": 3, "CC": 2, "RB": 1, "TO": 1, "WP": 3, ".": 2, "VB": 1, "JJ": 6, "VBG": 2, "VBZ": 2}}
{"original_text": "So Reddit, I think I may have just fucked up real hard. I decided to get a late night snack in the dark, so I grabbed a hotdog bun from the package. In hindsight, it did feel a little stale, but I'll get to that later. So I get back to watching a movie and eating my delicious hotdog bun, when I realized, 95% done with it mind you, that it feels a little *too* stale. I stop and examine it in my phone's light, and lo and behold, it wasn't stale, there was some mold on it!\n\nThis was all less than an hour ago, so I'll be updating this as the inevitable and very literal shitstorm rolls in.\n\nUPDATE: So I think I'm gonna be alright. Aside from the mental disgust of eating moldy bread, I am otherwise unharmed. Sorry I didn't shit myself, I know you guys would have been pretty entertained.", "tldr": null, "summary_text": "ate a hotdog bun in the dark, it felt stale, but it wasn't, it had mold on it, and now i'm going to shit myself.", "rougescores": null, "compression_ratio": 0.1415929203539823, "original_pos_tags": {"RB": 12, "NNP": 2, ",": 13, "PRP": 23, "VBP": 8, "MD": 4, "VB": 8, "VBN": 5, "RP": 1, "JJ": 13, ".": 9, "VBD": 8, "TO": 4, "DT": 15, "NN": 23, "IN": 15, "CC": 7, "VBG": 5, "PRP$": 2, "WRB": 1, "CD": 1, "VBZ": 1, "POS": 1, "EX": 1, "JJR": 1, "NNS": 2, ":": 1}, "summary_pos_tags": {"VB": 3, "DT": 2, "NN": 3, "IN": 2, ",": 4, "PRP": 5, "VBD": 3, "JJ": 1, "CC": 2, "RB": 2, "VBN": 1, "VBP": 1, "VBG": 1, "TO": 1, ".": 1}}
{"original_text": "So I forgot to get my mother a gift on mothers day and I though it would be fine. Although what I did forget to also do is even say happy mothers day to her. I should have said something before but now my mom's upset thinking that I don't like her. I'm mad at myself that I even stopped this low. It's not that I don't like her I just forget things really easily. It may sound like I'm rambling on a bit but damn TIFU.", "tldr": null, "summary_text": "i forgot to say happy mothers day to my mom and now she's mad at me and i'm mad at myself for not saying something before.", "rougescores": null, "compression_ratio": 0.291866028708134, "original_pos_tags": {"RB": 11, "PRP": 15, "VBP": 6, "TO": 3, "VB": 8, "PRP$": 4, "NN": 9, "DT": 3, "IN": 11, "NNS": 3, "CC": 3, "MD": 3, "JJ": 5, ".": 6, "WP": 1, "VBD": 3, "VBZ": 2, "POS": 1, "VBG": 1, "NNP": 1}, "summary_pos_tags": {"NN": 5, "VBD": 1, "TO": 2, "VB": 2, "JJ": 2, "NNS": 1, "PRP$": 1, "CC": 2, "RB": 3, "PRP": 3, "VBZ": 1, "IN": 3, "VBP": 1, "VBG": 1, ".": 1}}
{"original_text": "I woke up around 10, and as I walk out my room, I stretch and whack my left elbow against the door frame. (You know the tingling sensation you get, I got that strong.) I go to the bathroom and I make my way to the stairs.\n\n(My house is weird so it's set on four levels with three sets of stairs. The middle set is made of 7 steps whilst the other two sets are made of 6. What I like to do with the middle set is put my arms halfway down the rails and swing myself down to the bottom.)\n\nI notice my pet dog (Freya) is laying down just over a meter away from the bottom of the staircase and it currently sleeping. I decide to say hello to her by landing next to her (I was half asleep).\n\nI put my arms halfway down and push of the ground to swing. Instantly I regret this as my left arm gives out completely, and I go flying down the stairs and land straight on top of Freya, aswell as smacking my head against the dining room dresser.\n\nNeedless to say, Freya ignored me for a few hours before forgiving me, and I definitely woke up.\n\n(If you were wondering what she looks like. Here is a picture of my adorable-bundle of fur: http://i.imgur.com/fnWzDk0.jpg)\n\nEDIT: Fixed some spelling.", "tldr": null, "summary_text": "tried to say hello to my dog, ended up flying down the stairs and hitting my head on the dresser. dog ignored me for a few hours before forgiving me.", "rougescores": null, "compression_ratio": 0.1258445945945946, "original_pos_tags": {"PRP": 23, "VBD": 7, "RB": 12, "CD": 6, ",": 7, "CC": 9, "IN": 28, "VBP": 16, "PRP$": 12, "NN": 35, "JJ": 11, "DT": 19, ".": 13, "(": 5, "VBG": 10, ")": 5, "TO": 9, "NNS": 10, "VBZ": 8, "VBN": 5, "WP": 2, "VB": 3, "RP": 5, "NNP": 3, ":": 3}, "summary_pos_tags": {"VBN": 1, "TO": 2, "VB": 1, "NN": 5, "PRP$": 2, ",": 1, "VBD": 2, "RP": 1, "VBG": 3, "IN": 4, "DT": 3, "NNS": 2, "CC": 1, ".": 2, "PRP": 2, "JJ": 1}}
{"original_text": "So I got shitface drunk last might.\n\nOn my way home I decided to stop in an alley and take a piss.\n\nI ended up writing my initals beautifully in the snow.\n\nI figured it would be a good idea to take a picture and post it to facebook seeing it was going to be spring.\n\nWell I'm shitfaced and the flash on my camera wasn't working. I stood there for about 20 minutes snaping pics of my urine.\n\nI eventually gave up and decided to head hom when I realise there's a man standing there watching me.\n\nIt's then that I realised how fucking stupid what I'm doing is and I fucking run off cringing.\n\n\nI'm a fucking idiot.", "tldr": null, "summary_text": "took a piss in the snow, decided to take a picture of it and post it to facebook, camera didn't work, ran off cringing.", "rougescores": null, "compression_ratio": 0.19476268412438624, "original_pos_tags": {"RB": 7, "PRP": 17, "VBD": 10, "NN": 18, "JJ": 5, "MD": 2, ".": 9, "IN": 8, "PRP$": 4, "TO": 5, "VB": 8, "DT": 8, "CC": 5, "RP": 3, "VBG": 10, "NNS": 3, "NNP": 1, "VBP": 4, "CD": 1, "WRB": 2, "EX": 1, "VBZ": 3, "WP": 1}, "summary_pos_tags": {"VBD": 3, "DT": 3, "NN": 4, "IN": 2, ",": 3, "TO": 2, "VB": 5, "PRP": 2, "CC": 1, "RB": 1, "RP": 1, "VBG": 1, ".": 1}}
{"original_text": "(This actually happened yesterday, but whatever) \n\nStupid brainfart. I forgot, the women's room is right next to the classroom and the men's room is across the hall. I didn't even realize until I noticed there were no urinals. When I walked out, I saw a girl I know about to walk in. I just muttered \"wrong bathroom\" and quickly walked to the men's. Embarrassing as fuck.\n\nIn my defense, a couple floors below the one where this happened, the men's room is in a spot roughly analogous to where the women's room is on this floor and visa-versa, and I'd had classes all last year on that floor. And I hadn't eaten anything since breakfast, and hadn't gotten a full night's sleep.", "tldr": null, "summary_text": "didn't realize there were no urinals in the men's room, walked in on a girl in the women's room, muttered \"wrong bathroom\" and quickly walked to the men's room.", "rougescores": null, "compression_ratio": 0.2363367799113737, "original_pos_tags": {"(": 1, "DT": 18, "RB": 8, "VBN": 4, "NN": 22, ",": 7, "CC": 7, "WDT": 1, ")": 1, "NNP": 2, ".": 8, "PRP": 9, "VBD": 11, "NNS": 8, "POS": 6, "VBZ": 4, "JJ": 6, "TO": 4, "IN": 11, "VB": 2, "EX": 1, "WRB": 3, "RP": 1, "VBP": 1, "``": 1, "''": 1, "PRP$": 1, "CD": 1, "MD": 1}, "summary_pos_tags": {"VBD": 5, "RB": 2, "VB": 1, "EX": 1, "DT": 5, "NNS": 4, "IN": 4, "POS": 3, "NN": 5, ",": 2, "``": 1, "JJ": 1, "''": 1, "CC": 1, "TO": 1, ".": 1}}
{"original_text": "This actually happened weeks ago, but I still find it amusing.\n\nAnyway,\n\nIt was a cold Wednesday morning, meaning late start at my high school, so I have extra time to do whatever in the morning if I don't sleep in. Me and my father always go to Bojangles' where my uncle is the manager on Wednesday mornings to eat and talk for shits and giggles. It was about 8:00, and I was heading out of the door to take my brother and sister to school, then to meet my father at the restaurant, when I see something.\n\nRain has come to punish me again. Hard.\n\nI get in the car and drop the kids off, I then proceed to meet my father and uncle. I have to take back country roads to get there, if I want to get there quick. I'm heading 60 in a 55 (mistake, shat) and the moderate rain situation is all under control.\n\nSo far.\n\nA sensation comes to me and I cough. Not hard, not soft. But seconds after, I realize for some reason the cough brought up a loogie in my mouth. Not nasty to me or uneasing, so keep driving for a short while before I decide to ditch the giant green glob of shit on my tongue. For some reason, instead of looking for a tissue or receipt or something related, my dumbass rolls down the window and spits.\n\nFatal mistake.\n\nSomehow, someway, I see the disgusting thing on the inside of the door running down fast, Usain Bolt if he bleached his skin. I try to look around finally for something to wipe it up, but nothing is present. Another tragic result is that the window is still down, rain flooding me and the inside of the vehicle. Fiddling with the window and wiping up the snot glob up with my finger, I look back up to the road.\n\nI'm heading straight for oncoming traffic.\n\nNot in 10, 20, or 30 seconds, but less than 5 seconds away from destroying myself and a ninety year old woman.\n\nI panic and try to correct my course, but I end up over-correcting.\n\nA 2009 Honda Civic does not handle well with these demands.\n\nI spin out and somehow narrowly miss the cars heading toward me and actually swing around back to my lane, somehow vomiting from the fear of wrecking. I am a vomit tornado, a hurling hurricane, a barf storm. I end up facing the direction I was heading in. All is good but unfortunately, the inertia of the spin caused the goo to come off the door and land on me. I'm now sitting still, scared and covered in snot, vomit, rain, and shame.\n\nI ended up going back home to shower and changing clothes. Thank Saint Turn-Up for no one being home, I ended just telling my dad I didn't wanna go.\n\nInstead of family time and food, I used that terrible Wednesday morning getting the interior of the car shampooed and vacuumed completely.", "tldr": null, "summary_text": "coughed up a loogie in my mouth, spit it down the window of my car, almost crashed into a ninety year old woman, vomited from the fear of wrecking.", "rougescores": null, "compression_ratio": 0.055304740406320545, "original_pos_tags": {"DT": 47, "RB": 46, "VBN": 3, "NNS": 13, ",": 35, "CC": 32, "PRP": 40, "VBP": 21, "VBG": 25, ".": 32, "VBD": 15, "JJ": 21, "NNP": 13, "NN": 90, "IN": 51, "PRP$": 14, "TO": 21, "VB": 23, "POS": 1, "WRB": 2, "VBZ": 11, "CD": 9, "RP": 13, "(": 1, "WP": 1, ")": 1, "JJR": 1}, "summary_pos_tags": {"VBN": 3, "RP": 2, "DT": 4, "NN": 9, "IN": 5, "PRP$": 2, ",": 3, "VB": 1, "PRP": 1, "RB": 1, "JJ": 1, ".": 1}}
{"original_text": "This happened a few years back so i know its not today, but its my cake day and i do what i want. \n\nSo i was working at a fast food restaurant working the grill. It was a particularly busy day, and I didn't have a lot of experience on the grill. I was working with a few good friends and this girl lets call her Cathy. Now Cathy has burns on about 90% of her body which is very unfortunate, but Cathy is also a huge bitch. Cathy was working transfer(basically taking hamburger patties and putting them on the buns). So you can imagine what happens next... Cathy is waiting for me to finish up a couple of patties but I know they have another half a minute or so until she should take them. Then all of a sudden a wild order appears, I think it was grilled onions or jalapenos and some grilled chicken. so I throw these down real quick and start to go to town. In the process of this Cathy tells me that she needs my meat. I tell her to give me a couple seconds, but that wasn't quick enough for her. She decides in horrible fashion that shes just going to grab it off the grill. So in my blatant ignorance I say \"I hope you burn yourself.\" The mistake I just made quickly pours over me, but before i have time to correct myself and apologize she replies with \" I already have.\" I immediately feel the daggers of empathy go through my heart, and try to apologize, but the damage is done and I realize that everyone around me is just staring. Fuck... \n\n\ntl;dr told a girl with burns on 90% of her body \"I hope you burn yourself\"", "tldr": " told a girl with burns on 90% of her body \"i hope you burn yourself\"", "summary_text": "tl;dr told a girl with burns on 90% of her body \"i hope you burn yourself\" and everyone around me is staring at me now.", "rougescores": [{"rouge-1": {"f": 0.7499999953125, "p": 0.6, "r": 1.0}, "rouge-2": {"f": 0.7368421006094183, "p": 0.5833333333333334, "r": 1.0}, "rouge-l": {"f": 0.7692307644970415, "p": 0.625, "r": 1.0}}], "compression_ratio": 0.0779816513761468, "original_pos_tags": {"DT": 28, "VBD": 11, "JJ": 18, "NNS": 9, "RB": 21, "VBP": 18, "PRP$": 11, "NN": 38, ",": 8, "CC": 18, "VB": 15, "WP": 2, ".": 15, "IN": 31, "VBG": 9, "PRP": 34, "VBZ": 15, "NNP": 7, "VBN": 3, "CD": 2, "WDT": 1, "(": 1, ")": 1, "MD": 2, ":": 3, "TO": 7, "RP": 3, "PDT": 1, "``": 3, "''": 3}, "summary_pos_tags": {"NN": 5, ":": 1, "CC": 2, "VBD": 1, "DT": 1, "IN": 5, "NNS": 1, "CD": 1, "PRP$": 1, "``": 1, "JJ": 1, "VBP": 2, "PRP": 4, "''": 1, "VBZ": 1, "VBG": 1, "RB": 1, ".": 1}}
{"original_text": "Technically it was yesterday, but whatever.\n\nYesterday I wanted to check my balance and get a bit of cash out so on my way to uni I stopped off at the ATM. I took my card out from my wallet and put it into the machine, but i noticed that I accidentally put some paper in as well as the card. Seeing as it still managed to read my card I thought \"fuck it\" and carried on, checked my balance and went to take some money out........the card however did not want to come out and so I had to get a member of staff to help me out.\n\nHe took the back off of the machine and managed to get my card out, but said that it was out of order for a while as the paper had been chewed up inside the machine (sorry anyone planning on using that ATM). I went to a different ATM and got my money out.\n\nIt ended up only being a minor inconvenience to me, and probably many others, but your heart sinks when your card doesn't come out haha.\n\n", "tldr": null, "summary_text": "put some paper in the machine, card did not want to come out, had to get a member of staff to help me out, it was out of order for a while.", "rougescores": null, "compression_ratio": 0.15092290988056462, "original_pos_tags": {"RB": 15, "PRP": 16, "VBD": 21, "NN": 31, ",": 6, "CC": 12, ".": 7, "TO": 10, "VB": 13, "PRP$": 10, "DT": 14, "IN": 22, "RP": 8, "NNP": 3, "VBG": 3, "``": 1, "''": 1, ":": 2, "FW": 1, "JJ": 5, "VBN": 2, "(": 1, ")": 1, "NNS": 2, "WRB": 1, "VBZ": 1}, "summary_pos_tags": {"VB": 5, "DT": 4, "NN": 7, "IN": 4, ",": 3, "VBD": 3, "RB": 2, "TO": 3, "RP": 2, "PRP": 2, ".": 1}}
{"original_text": "*note: before i begin, this is more of a funnier fuck up...just sayin'\n\nThis morning i walked into my school all happy and shit and saw my ex,sitting by the wall. Like the nice person i am i walked over to say hi and ask her how her morning was going. That was my first mistake. Apparently our 4 month seperation and she still holds it against me, so she decides to kick me in the fuckin' dick. I instantly call her a bitch, and there, of couse, was a teacher right behind me....\nThe teacher gave me a warning and walked away. I then decides i wasn't done cussing her out and continued to tell her how stupid and ho like she was. Yet again the same teacher was behind me...\nLast warning and walked away. I finally finished by calling her a fuckin' dumbass excuse for a girlfriend. The same teacher was behind me. She looked me dead in the eye and said sarcasticaly \"OH MY GOD YOU'RE SUCH A FUCKIN' REBEL\" and walked away....", "tldr": null, "summary_text": "called my ex a fuckin' bitch, a dumbass excuse for a girlfriend, a teacher was behind me, she looked me dead in the eye.", "rougescores": null, "compression_ratio": 0.12987012987012986, "original_pos_tags": {"NN": 33, ":": 5, "IN": 18, "VBP": 4, ",": 6, "DT": 18, "VBZ": 4, "JJR": 2, "RP": 1, "RB": 13, "VB": 5, "VBD": 17, "PRP$": 8, "JJ": 11, "CC": 11, "VBG": 4, ".": 11, "TO": 3, "WRB": 2, "CD": 1, "PRP": 17, "POS": 2, "VBN": 2, "''": 2, "``": 1, "NNP": 6, "PDT": 1}, "summary_pos_tags": {"VBN": 1, "PRP$": 1, "NN": 8, "DT": 5, "''": 1, ",": 3, "IN": 3, "VBD": 2, "PRP": 3, "JJ": 1, ".": 1}}
{"original_text": "After much pleading with my girlfriend I was able to convince her to have special sexy times. That's right, I was going to take my love canoe to the Grand Tetons! Not only that, but I was going to, for lack of something clever, cum right on her neck, which sounds fantastic and foolproof! How naive I was to think that I could do this without doing what I did instead. \n\nSo we are going at it, I'm making sweet sweet glorious love to her sweet sweet boobs. I start to get some tingles and jingles brewing downstairs and I get ready for what I expect to be a wonderful and simple ejaculation. \n\nI get into position and angle everything towards her neck so it can easily be cleaned up afterwards. And then it happened. I ejaculated. But, it took this mysterious unexplainable angle. And it was as if time slowed down so as to allow me to watch every last moment of what was happening. Instead of going straight out and to her neck, it went up and it had this stunning arching angle that ended up landing right straight in the middle of her eye. That's right, I came right in her eye with an angle that would not allow me to do that!\n\nThat is when I started uncontrollably laughing while I was straddling her body which caused my penis to bounce up and down in front of her face and smacking bouncing on her chest. As she was in pain, I could not stop laughing at what just happened. This caused her eye to get extremely red and I still couldn't stop laughing. \n\nTLDR; tried to make babies in my girlfriend's eye.", "tldr": " tried to make babies in my girlfriend's eye.", "summary_text": "tried to make babies in my girlfriend's eye with an angle that would not allow me to do that and ended up bouncing my penis up and down in front of her face.", "rougescores": [{"rouge-1": {"f": 0.39024389929803693, "p": 0.24242424242424243, "r": 1.0}, "rouge-2": {"f": 0.35897435602892835, "p": 0.21875, "r": 1.0}, "rouge-l": {"f": 0.45714285361632656, "p": 0.2962962962962963, "r": 1.0}}], "compression_ratio": 0.10397350993377484, "original_pos_tags": {"IN": 31, "JJ": 22, "NN": 35, "PRP$": 14, "PRP": 29, "VBD": 21, "TO": 16, "VB": 17, "NNS": 6, ".": 17, "DT": 14, "VBZ": 4, ",": 10, "VBG": 16, "NNP": 2, "NNPS": 1, "RB": 19, "CC": 14, "WDT": 4, "WRB": 2, "MD": 5, "WP": 4, "VBP": 6, "VBN": 4, "RP": 4, ":": 1, "POS": 1}, "summary_pos_tags": {"VBN": 1, "TO": 2, "VB": 3, "NNS": 1, "IN": 4, "PRP$": 3, "NN": 6, "POS": 1, "DT": 2, "WDT": 1, "MD": 1, "RB": 3, "PRP": 1, "CC": 2, "VBD": 1, "RP": 1, "VBG": 1, ".": 1}}
{"original_text": "So i'm an electrician at a failing electrical company and due to lack of work my boss decided to let me have a easy/boring week of stripping the insulation of a bunch of cable. After 2-3 days of this the blade of my stanley knife was becoming rather blunt and was having to use more force than necessary. So, i replace the blade and start stripping again using the same force as the old blade. Suddenly something didn't feel quite right, There is no pain, just the sense something is 'missing'. I look down to see blood literally pumping out of my thumb.\n\nReddit, TIFU.\n\nPicture: http://imgur.com/pgP1SCx\n\nand after 3 days: http://imgur.com/gU3Tyl9\n\nedit: first post, be nice.", "tldr": null, "summary_text": "i cut my thumb on a stanley knife while trying to remove insulation from a bunch of cable and had to get it stitched up for 3 days.", "rougescores": null, "compression_ratio": 0.1937869822485207, "original_pos_tags": {"RB": 9, "JJ": 13, "VBP": 2, "DT": 12, "NN": 27, "IN": 13, "VBG": 9, "CC": 4, "TO": 4, "VB": 9, "PRP$": 3, "VBD": 4, "PRP": 2, ".": 7, "NNS": 2, "JJR": 1, ",": 5, "EX": 1, "VBZ": 2, "''": 1, "RP": 1, "NNP": 2, ":": 5, "CD": 1}, "summary_pos_tags": {"NN": 6, "VBD": 3, "PRP$": 1, "IN": 5, "DT": 2, "JJ": 1, "VBG": 1, "TO": 2, "VB": 2, "CC": 1, "PRP": 1, "RB": 1, "CD": 1, "NNS": 1, ".": 1}}
{"original_text": "[here's the pic after day 2](http://imgur.com/6jEK6Gh)\n\nI bartend and around 2:30am last Saturday night, I reached down for a whiskey bottle (f u Fireball!) and didn't realize it was broken as I grabbed it.\n\nEnded up with ten stitches in my ring finger on my right (dominant!!) hand... I couldn't do anything for all of last week. \n\nTo make matters worse, I was in the ER for 8 hours because they kept getting traumas which left me waiting and waiting.\n\nStill not sure if there's nerve damage...it's still pretty numb, which isn't a good sign. ", "tldr": null, "summary_text": "got drunk, grabbed a broken whiskey bottle, ended up with ten stitches in my finger, couldn't do anything for a week and was in the emergency room for 8 hours.", "rougescores": null, "compression_ratio": 0.2922794117647059, "original_pos_tags": {"NN": 19, "RB": 10, "VBZ": 4, "DT": 5, "IN": 12, "CD": 3, "(": 3, ":": 3, ")": 3, "PRP": 10, "VBP": 1, "CC": 3, "JJ": 9, "NNP": 3, ",": 3, "VBD": 8, ".": 7, "VB": 3, "VBN": 1, "RP": 1, "NNS": 3, "PRP$": 2, "MD": 1, "TO": 1, "JJR": 1, "VBG": 3, "WDT": 2, "EX": 1}, "summary_pos_tags": {"VBD": 4, "JJ": 3, ",": 3, "DT": 3, "NN": 7, "RP": 1, "IN": 5, "NNS": 2, "PRP$": 1, "MD": 1, "RB": 1, "VB": 1, "CC": 1, "CD": 1, ".": 1}}
{"original_text": "So, I went to practice tonight, like any other night. Tonight being the start of the season, we were picking our numbers. It went something like this\n\nCoach- Alright pog232 what number do you want\nMe- how about 44\nCoach- no, grizzly (big ass defender, hence the name grizzly) has that\nMe- OK what about 69?\n(This goes on and on for an unnecessary amount of numbers, so he finally shows me the sheet with all team members, and their numbers on it. The list was pretty full, and I was running out of time before practice so I just chose one of the few open ones) \nMe- ok, 50? \nCoach- ...\n(50 being the retired number from last season. His son had committed suicide, and it was a pretty big hit to the whole team)\n\nAfter practice began he went home, said he didn't feel good.\n\nI fucked up...", "tldr": null, "summary_text": "picked the wrong number for my coach's son's number, he didn't feel well after practice, and it was a big hit to the whole team.", "rougescores": null, "compression_ratio": 0.16243654822335024, "original_pos_tags": {"RB": 10, ",": 11, "PRP": 13, "VBD": 13, "TO": 2, "NN": 28, "IN": 17, "DT": 15, "JJ": 12, ".": 7, "NNP": 7, "VBG": 4, "PRP$": 3, "NNS": 5, "VBZ": 4, "WP": 2, "VBP": 1, "VB": 2, "WRB": 1, "CD": 5, "(": 3, ")": 3, "CC": 4, ":": 2, "VBN": 1, "RP": 1}, "summary_pos_tags": {"VBD": 3, "DT": 3, "JJ": 3, "NN": 7, "IN": 2, "PRP$": 1, "POS": 2, ",": 2, "PRP": 2, "RB": 2, "VB": 1, "CC": 1, "TO": 1, ".": 1}}
{"original_text": "I bought new glasses a year ago and new lenses into my old frame at considerable cost, subsidized by insurance. I figured I wouldn't need vision care for at least another year, so I did not renew coverage January 1.\n\nNow I have spots and other freaky things in my vision.", "tldr": null, "summary_text": "bought new glasses a year ago and new lenses into my old frame at considerable cost, subsidized by insurance. did not renew coverage. now have spots and other freaky things in my vision.", "rougescores": null, "compression_ratio": 0.6863468634686347, "original_pos_tags": {"PRP": 5, "VBD": 3, "JJ": 6, "NNS": 4, "DT": 2, "NN": 9, "RB": 4, "CC": 2, "IN": 7, "PRP$": 2, ",": 2, "VBN": 1, ".": 3, "MD": 1, "VB": 2, "JJS": 1, "NNP": 1, "CD": 1, "VBP": 1}, "summary_pos_tags": {"VBD": 2, "JJ": 6, "NNS": 4, "DT": 1, "NN": 6, "RB": 3, "CC": 2, "IN": 4, "PRP$": 2, ",": 1, "VBN": 1, ".": 3, "VB": 1, "VBP": 1}}
{"original_text": "I went on a road trip to visit my mom last week. It was my first time driving to NYC. My map app told me that it was a toll road so I pulled out $20 cash thinking it would be plenty. I'm from the midwest and I've never paid a toll that was higher than maybe $4. I've made the drive up I95 as far north as Baltimore all the way down to GA and I knew there weren't any tolls until I went under the harbor and that one was only a few bucks. I felt prepared.\n\nI pay a couple of tolls totaling $12 and now I'm on the Jersey turnpike. I glanced at my ticket and assume that the $8 I have left should cover my toll just fine. I have not actually zoomed out of my route at all and have just been trusting the map to tell me where I'm going. \n\nTurns out it doesn't even matter because I get in the wrong lane and end up being forced through the EZ pass. I don't have one. There's no way to back up or turn around. Cars are honking at me because I'm pretty much panicking at this point. My kids are in the car asking me what's going on and I have no choice but to go forward and hope that I'm not committing a felony or something. \n\nFrom there on it's rapid fire exits and the start of intense traffic going into the city. There's no place to pull over and pull more cash, nor did it even occur to me to do so because by now I'm no longer on an Interstate. However, a few miles down the road and there's another tollbooth and they want $12, which, of course, I don't have because nothing in my years of Interstate travel through middle America has prepared me for how much tolls are on the East Coast. She waves me through and I feel like crying. I have taken cross country road trips alone with 4 kids since they were babies and have never once felt as stupid and incapable as I did then. \n\nFast forward to today and I get a bright orange envelope in the mail. It's an EZ pass citation. Not only do I owe them $13 (!) for the toll, but I'm charged an extra $50 as a fine. I'm praying that the other toll I owe doesn't have the same fee added to it. \n\nIronically enough, on the way home I accidentally picked a route consisting of state roads and didn't realize it at first. I literally paid $3 in tolls and shaved 2 hours off the trip by avoiding backed up metro traffic. But guess who had $150 in my purse just waiting for a tollbooth to materialize on the horizon?\n\nTL;DR Gas to get from GA to NY round trip was around $200. Tolls and citations will probably end up being over half that. So much for my idea to take a spontaneous road trip and surprise my kids with a visit to grandma's house. ", "tldr": " gas to get from ga to ny round trip was around $200. tolls and citations will probably end up being over half that. so much for my idea to take a spontaneous road trip and surprise my kids with a visit to grandma's house. ", "summary_text": "i got in the wrong lane on the turnpike and ended up paying $13 for a toll that wasn't even a toll. now i have to pay an extra $50.", "rougescores": [{"rouge-1": {"f": 0.1866666618666668, "p": 0.23333333333333334, "r": 0.15555555555555556}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.18749999517578136, "p": 0.23076923076923078, "r": 0.15789473684210525}}], "compression_ratio": 0.050637804406648626, "original_pos_tags": {"PRP": 51, "VBD": 23, "IN": 65, "DT": 45, "NN": 74, "TO": 16, "VB": 23, "PRP$": 11, "JJ": 24, ".": 30, "VBG": 15, "NNP": 19, "RP": 9, "$": 10, "CD": 14, "MD": 3, "VBP": 31, "CC": 27, "RB": 39, "VBN": 9, "WDT": 2, "JJR": 2, "PDT": 2, "EX": 4, "NNS": 17, "WRB": 2, "VBZ": 12, "RBR": 1, "WP": 2, ",": 7, "(": 1, ")": 1, ":": 1, "POS": 1}, "summary_pos_tags": {"NN": 5, "VBD": 3, "IN": 3, "DT": 5, "JJ": 2, "CC": 1, "RP": 1, "VBG": 1, "$": 2, "CD": 2, "WDT": 1, "RB": 4, ".": 2, "VBP": 1, "TO": 1, "VB": 1}}
{"original_text": "Once upon a time I stuck a sewing needle into a syringe to use as a prop for a drawing I was doing. Kept it in case I wanted to do something else with it.\n\nMonths later I'm cleaning/reorganizing the upstairs of the house (I have free reign of the 3 rooms + bathroom) so things are haphazardly thrown in piles. My mother comes upstairs to do laundry and I guess the prop syringe was on top of a pile... Right next to the hamper. With one of those stretchy tourniquet things.\n\nNever thought I'd have to explain that I do not, in fact, inject any kind of drug. Pretty sure she believes me, but it was a conversation I would have liked to avoid. ", "tldr": null, "summary_text": "used a sewing needle as a prop for a drawing, put it on top of a pile, my mother thought it was a syringe of some kind of drug.", "rougescores": null, "compression_ratio": 0.19781931464174454, "original_pos_tags": {"RB": 5, "IN": 18, "DT": 14, "NN": 21, "PRP": 14, "VBD": 6, "VBG": 3, "TO": 6, "VB": 8, ".": 7, "NNP": 5, "VBP": 6, "(": 1, "JJ": 4, "CD": 2, "NNS": 5, ")": 1, "VBN": 2, "PRP$": 1, "VBZ": 2, "JJR": 1, "CC": 2, ":": 1, "MD": 2, ",": 3}, "summary_pos_tags": {"VBN": 1, "DT": 6, "VBG": 1, "NN": 9, "IN": 6, ",": 2, "VBD": 3, "PRP": 2, "PRP$": 1, ".": 1}}
{"original_text": "This actually happened a few years ago. I was hanging out with a friend at a school dance, and a ping-pong ball rolled our way from a nearby table. I picked it up and gave it to my friend because she wanted to hold it for some reason. She looked at me before throwing the ball and yelling, \"Fetch!\" Playing along, I ran after the ball. I wanted to look cool so flopped to the floor and slid towards the ping-pong ball on my stomach.\nAll was fine and dandy until my body slid over my hand and bent my fingers backwards. I got the ping-pong ball, but also received a fractured growth plate in my forefinger. I had to wear a splint for a couple weeks. ", "tldr": null, "summary_text": "tried to fuck a ping-pong ball, ended up with a fractured growth plate in my forefinger and a fracture in my stomach. i can't fuck ping-pong balls anymore.", "rougescores": null, "compression_ratio": 0.23882896764252695, "original_pos_tags": {"DT": 16, "RB": 4, "VBD": 13, "JJ": 12, "NNS": 5, ".": 9, "PRP": 12, "VBG": 3, "RP": 2, "IN": 14, "NN": 23, ",": 4, "CC": 7, "PRP$": 7, "TO": 5, "VB": 3, "``": 1, "''": 1, "VBP": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "VB": 2, "DT": 3, "JJ": 3, "NN": 7, ",": 1, "VBD": 1, "RP": 1, "IN": 3, "PRP$": 2, "CC": 1, ".": 2, "MD": 1, "RB": 2, "NNS": 1}}
{"original_text": "Okay, so I just got off work today and I had to tell this story somewhere. I work in a call center for a cable company for their tech support. Today I got a specific call about something along the lines of \"When I open internet explorer all that comes up is a giant white screen and I can never close out of the pages\"\n\nAt first I thought, maybe he hit f11 and it cause the browser to go full screen. In the end I figured out he was actually using the new windows 8 operating system and just didn't know how to navigate it whatsoever. I'm not an expert on windows 8 by any means, but I thought I would at least give him a brief tutorial just to help him out even though it was out of my support boundaries. This guy was bounced from line to line and no one was willing to help him, so why wouldn't I make his day just a bit better by doing him this one favor?\n\nWell, for one, this guy was a bit strange. He was an older man, and 5 minutes into the call he let me know \"how beautiful of a voice\" I have. Asked me my age and where I'm located (basically any information I was allowed to give out.) He repeated my name multiple times and just kept talking about how pretty my voice apparently is on the phone. I didn't think much of it, until we got to me showing him how to use his OS. \n\nOver the phone I talked him through typing in an address in the actual address bar at the bottom of the page on windows 8 and prompted him to type in a code which would allow me to remotely access his computer and navigate it/type stuff on it/use a highlighter/etc in order to show him how to use the computer. First things first, let's delete all those open tabs..\n\nLucky me I guess, half those tabs were porn. Straight up porn. My favorite had to have been the \"daddy daughter massage play\". Definitely had me rethinking those questions I answered earlier in the call. Anyways, when The tabs opened I heard him on the other line say \"Oh, hello there!\" and I about died laughing. \n\nThe rest of the call was super awkward, and now I'm pretty sure I have a phobia of old men calling me for technical support. But at least it's over. \n\ntl;dr tried helping someone with a problem even though it was out of my realm of support and ended up looking at multiple pages of an elderly man's porn, then had to close it out for him because he didn't know how. TIFU.", "tldr": " tried helping someone with a problem even though it was out of my realm of support and ended up looking at multiple pages of an elderly man's porn, then had to close it out for him because he didn't know how. tifu.", "summary_text": "tl;dr tried helping someone with a problem even though it was out of my realm of support and ended up looking at multiple tabs of porn.", "rougescores": [{"rouge-1": {"f": 0.6764705835121109, "p": 0.8846153846153846, "r": 0.5476190476190477}, "rouge-2": {"f": 0.636363631657484, "p": 0.84, "r": 0.5121951219512195}, "rouge-l": {"f": 0.6774193500936525, "p": 0.875, "r": 0.5526315789473685}}], "compression_ratio": 0.057692307692307696, "original_pos_tags": {"NNP": 7, ",": 14, "IN": 51, "PRP": 54, "RB": 28, "VBD": 33, "RP": 9, "NN": 73, "CC": 16, "TO": 15, "VB": 24, "DT": 44, ".": 22, "VBP": 9, "PRP$": 10, "JJ": 28, "NNS": 15, "``": 4, "WRB": 10, "PDT": 3, "WDT": 2, "VBZ": 5, "MD": 4, "''": 4, "VBG": 10, "CD": 6, "JJS": 2, "VBN": 6, "RBR": 2, "UH": 2, "JJR": 1, "(": 1, ")": 1, "POS": 2, ":": 1}, "summary_pos_tags": {"NN": 7, ":": 1, "CC": 2, "VBD": 3, "VBG": 2, "IN": 7, "DT": 1, "RB": 1, "PRP": 1, "PRP$": 1, "RP": 1, "JJ": 1, ".": 1}}
{"original_text": "I was trimming around my ears with my beard trimmer that has an adjustable length attachment, it adjusted from #4 to #1 and now I look like Just Bieber.. ", "tldr": null, "summary_text": "trimmed my beard with an adjustable beard trimmer, it adjusted from #4 to #1 and now i look like just Bieber.. i'm an idiot..", "rougescores": null, "compression_ratio": 0.8116883116883117, "original_pos_tags": {"PRP": 3, "VBD": 2, "VBG": 1, "IN": 4, "PRP$": 2, "NNS": 1, "NN": 4, "WDT": 1, "VBZ": 1, "DT": 1, "JJ": 1, ",": 1, "#": 2, "CD": 2, "TO": 1, "CC": 1, "RB": 1, "VBP": 1, "NNP": 2}, "summary_pos_tags": {"VBN": 1, "PRP$": 1, "NN": 5, "IN": 3, "DT": 2, "JJ": 2, ",": 1, "PRP": 1, "VBD": 1, "#": 2, "CD": 2, "TO": 1, "CC": 1, "RB": 2, "VBP": 2, "NNP": 1}}
{"original_text": "Technically it was not today but last friday, hope you forgive me there. Also, forgive the bad english of a spanish speaker.\n\n  So I´m a nervous guy,and this week, the money my parents gave me for college went away faster than usual, because I had to buy some groceries on my apartment that I didn´t account for. Now, I dont have a debit card so I can't get money from my savings that easily. So naturally I don't tell anything to my parents about me running out of money and I try to solve the situation myself by asking my friend to lend me some money, which I end up missmanaging, and by friday morning I had only enough money to return to my apartment and thats it. As I was pretty much bankrupt and I had to attend to some classes saturday morning, I give up and end up asking my parents to send me money. At this point all that goes through my mind is how bankrupt I am and how likely it is that money wont come on time and I´ll find myself with nothing to eat on saturday morning, so I was not paying attention while I took the bus back home.\n\nThe bus drivers where I live are pretty much insane, and policemen apparently dont care about this, so it was perfectly logical for the bus driver to skip a red light and go down my street at a 100km/h instead of 40km/h. In this moment I realize I will miss my stop, and there are no set stops for the bus on my country, outside of the capital city, so I yell at the guy to stop, of course he can´t go from a hundred to 0 in the half second that it would take him to get to my street. The guy slows down to 30km/h by the moment he gets to my stop, and I for some reason thought I could be a badass and jump/run out of the bus whithout fall damage cause well, my mind was all over the place about money, so I jumped from a moving bus, at 30km/h and the inevitable happens, I wreck my ankle like a total dumbass, and end up on the floor with gravel on my mouth, in front of the now fully stopped bus with people checking on me from the windows. Out of pure shame I stand up and signal them that I'm ok and walk all the way to my apartment (approx 200m plus straircases) I lay on my bed and try to forget the incident by browsing reddit.\n\nFast forward 3 hours and my ankle already is the size of a melon (a small melon), and I can't bear the pain. Luckily this is also the moment that my cousin (who was sent to give me the money my parents were sending me) gets to the apartment so I ask him to get me to the hospital. Long story short, I had a sprain and my tibia and fibula are half a cm more separated than they were supposed to be, which earns me a cast, a $300 bill with my cousin, and a lot of explaining to do at college to all the proffesors I end up owing exams, and to my already pissed parents.\n\nTL;DR: Jumped out of a bus, walked back home and got carried back to the hospital to find out walking normally was out of the table for the next two or three months.", "tldr": " jumped out of a bus, walked back home and got carried back to the hospital to find out walking normally was out of the table for the next two or three months.", "summary_text": "ran out of money, jumped out of a moving bus at 30km/h and ended up on the floor with gravel on my mouth and my ankle.", "rougescores": [{"rouge-1": {"f": 0.275862064019025, "p": 0.3076923076923077, "r": 0.25}, "rouge-2": {"f": 0.14285713791454097, "p": 0.16, "r": 0.12903225806451613}, "rouge-l": {"f": 0.26086956025519853, "p": 0.2857142857142857, "r": 0.24}}], "compression_ratio": 0.04039712427250942, "original_pos_tags": {"RB": 36, "PRP": 53, "VBD": 23, "NN": 103, "CC": 28, "JJ": 24, ",": 30, "VBP": 24, ".": 15, "DT": 59, "IN": 74, "VBZ": 12, "PRP$": 24, "NNS": 19, "RBR": 2, "TO": 29, "VB": 29, "MD": 5, "NNP": 6, "VBG": 11, "WDT": 3, "RP": 6, "WRB": 3, "VBN": 8, "CD": 10, "EX": 1, "PDT": 3, "(": 3, ")": 3, "WP": 1, "$": 1, ":": 2}, "summary_pos_tags": {"VBD": 3, "IN": 8, "NN": 6, ",": 1, "DT": 2, "VBG": 1, "CD": 1, "CC": 2, "RB": 1, "PRP$": 2, ".": 1}}
{"original_text": "Hey Reddit. You know the way when, whenever you cum... you get really tired after?\n\nYeah. So I made the mistake of masturbating. In bed. Late at Night. While tired. Here is what transpired.\n\nYou see, I have weird fetishes. I'm the first to admit that. Transformation? Fuck yeah. Hyperendowment? Hell yeah motherfucker! Lactation? Gimme that! Multibreast? Why the fuck not! Furry? I'd *cuddle* that if you know what I mean. Pretty much anything you can think of, bar scat, watersports and Brazillian fart porn.\n\nMy mother might just know about this now. Fuck, my, life.\n\nBecause you see Reddit, I found a wonderful thing called Flexible Survival, by Nuku Valente. It is interactive, textual porn. It has a lot of things I like in it. I came, many, many times.\n\nUnfortunately... I fell asleep after cumming. During a really intense, really detailed sex scene.\n\nAnd what do I awake to?\n\nMy mother. Perched at the side of my bed. Holding my laptop. Staring at the screen. She turns to me.\n\n\"Throwaway956...\" My life flashes before my eyes. My heart pounds. I think I'm having a heart attack. I might have just evacuated my bowels. I could die right now. I wish I was. \"Your laptop...\" FUCKSTICKS. \"Is very hot.\" I do not feel relief. I do not. Because she's logged in to my account. Which, last I knew, had said kinky detailed intense sex scene on it involving me, a woman with six lactating breasts, with the body and face of an anthropomorphic dog, and a dick that could more appropriately be called a third leg, pounding and being pounded by various very kinky creatures, and being transformed as a result of said fornication.\n\nShe hasn't said a word about it. But I have noted a large rise in 'joking' \"Sure you aren't gay?\" quips from both parents. I can not look either parent in the eyes, despite the fact I'm a legal adult who has a pretty much legal right to look at porn.\n\n**TODAY. I. FUCKED. UP.**\n\n\nAnd, link for the interested, to Flexible Survival: http://blog.flexiblesurvival.com/\n\nAnd, also, this shall be a public throwaway, for all you nice people. The password is \"throwaway\". I hope I spelt it right while I was typing it into the register screen.\n\nEdit: Yup, he spelt the password right!\n\nEdit 2: Changed the password-I'm not a nice person. Well, no one's going to start screwing up this post, I won't say the new password!", "tldr": null, "summary_text": "masturbated in bed, woke up to my mother watching kinky porn involving me, a woman with six lactating breasts, with the body and face of an anthropomorphic dog, and a dick that could more appropriately be called a third leg, pounding and being pounded by various very kinky creatures, and being transformed as a result of said fornication.", "rougescores": null, "compression_ratio": 0.14480991029474582, "original_pos_tags": {"NNP": 20, ".": 60, "PRP": 49, "VBP": 21, "DT": 38, "NN": 69, "WRB": 3, ",": 28, ":": 8, "RB": 27, "VBN": 10, "IN": 40, "UH": 1, "VBD": 15, "VBG": 14, "JJ": 33, "VBZ": 12, "WP": 4, "NNS": 13, "TO": 7, "VB": 15, "MD": 9, "CC": 9, "PRP$": 11, "``": 5, "''": 6, "CD": 2, "WDT": 1, "RBR": 1, "$": 1, "RP": 1}, "summary_pos_tags": {"VBN": 4, "IN": 7, "NN": 11, ",": 6, "VBD": 2, "RB": 3, "TO": 1, "PRP$": 1, "VBG": 6, "NNS": 3, "PRP": 1, "DT": 6, "CD": 1, "CC": 4, "JJ": 4, "WDT": 1, "MD": 1, "RBR": 1, "VB": 1, ".": 1}}
