{"original_text": "This actually happened a couple of years ago. I grew up in Germany where I went to a German secondary school that went from 5th to 13th grade (we still had 13 grades then, they have since changed that). My school was named after Anne Frank and we had a club that I was very active in from 9th grade on, which was dedicated to teaching incoming 5th graders about Anne Franks life, discrimination, anti-semitism, Hitler, the Third Reich and that whole Spiel. Basically a day where the students' classes are cancelled and instead we give them an interactive history and social studies class with lots of activities and games. \n\nThis was my last year at school and I already had a lot of experience doing these project days with the kids. I was running the thing with a friend, so it was just the two of us and 30-something 5th graders. We start off with a brief introduction and brainstorming: what do they know about Anne Frank and the Third Reich? You'd be surprised how much they know. Anyway after the brainstorming we do a few activities, and then we take a short break. After the break we split the class into two groups to make it easier to handle. One group watches a short movie about Anne Frank while the other gets a tour through our poster presentation that our student group has been perfecting over the years. Then the groups switch. \n\nI'm in the classroom to show my group the movie and I take attendance to make sure no one decided to run away during break. I'm going down the list when I come to the name Sandra (name changed). A kid with a boyish haircut and a somewhat deeper voice, wearing clothes from the boy's section at a big clothing chain in Germany, pipes up. \n\nNow keep in mind, these are all 11 year olds, they are all pre-pubescent, their bodies are not yet showing any sex specific features one would be able to see while they are fully clothed (e.g. boobs, beards,...). This being a 5th grade in the rather conservative (for German standards) Bavaria, I was confused. I looked down at the list again making sure I had read the name right. Look back up at the kid. \n\nMe: \"You're Sandra?\"\n\nKid: \"Yep.\"\n\nMe: \"Oh, sorry. *Thinking the kid must be from somewhere where Sandra is both a girl's and boy's name* Where are you from? I've only ever heard that as a girl's name before.\"\n\nThe class starts laughing. Sandra gets really quiet. \"I am a girl...\" she says. Some of the other students start saying that their parents made the same mistake when they met Sandra. I feel so sorry and stupid. I get the class to calm down and finish taking attendance. We watch the movie in silence. After the movie, when we walked down to where the poster presentation took place I apologised to Sandra. I felt so incredibly terrible, I still do to this day. Throughout the rest of the day I heard lots of whispers about Sandra. I tried to stop them whenever they came up, but there was no stopping the 5th grade gossip I had set in motion.\n\nSandra, if you're out there, I am so incredibly sorry for humiliating you in front of your class. I hope you are happy and healthy and continue to live your life the way you like. Don't let anyone tell you you have to dress or act a certain way just because of the body parts you were born with. I'm sorry if I made you feel like you were wrong for dressing and acting differently. I'm sorry I probably made that day hell for you. I'm sorry for my ignorance.\n\n**TL;DR: Confuse a 5th grade girl for a boy in front of half of her class. Kids are mean. Sorry Sandra.**", "tldr": " confuse a 5th grade girl for a boy in front of half of her class. kids are mean. sorry sandra.**", "summary_text": "tried to teach 5th graders about the holocaust by showing them a movie about the holocaust, but accidentally showed them a video of a girl having sex with a boy.", "rougescores": [{"rouge-1": {"f": 0.23529411280276827, "p": 0.2, "r": 0.2857142857142857}, "rouge-2": {"f": 0.040816321699292536, "p": 0.034482758620689655, "r": 0.05}, "rouge-l": {"f": 0.18604650669551123, "p": 0.16666666666666666, "r": 0.21052631578947367}}], "compression_ratio": 0.04580369843527738, "original_pos_tags": {"DT": 71, "RB": 43, "VBD": 32, "NN": 99, "IN": 73, "NNS": 27, ".": 45, "PRP": 64, "RP": 6, "NNP": 30, "WRB": 10, "TO": 17, "JJ": 40, "WDT": 2, "CD": 12, "(": 4, ",": 22, "VBP": 38, "VBN": 12, ")": 4, "PRP$": 11, "CC": 20, "VBG": 18, "POS": 5, ":": 8, "WP": 1, "VB": 22, "MD": 3, "JJR": 1, "VBZ": 10, "``": 4, "''": 4, "FW": 1, "UH": 1, "EX": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "VB": 1, "CD": 1, "NNS": 1, "IN": 5, "DT": 6, "NN": 7, "VBG": 2, "PRP": 2, ",": 1, "CC": 1, "RB": 1, "VBD": 1, ".": 1}}
{"original_text": "It was last October, but I'm feeling the fall-out from it the most today.  \n\nAfter my mom died from cancer last year, I started looking for my estranged father.  I had only known him for a short time when I was 6 and barely remembered more than his name.  I never knew why he left and my mom would not talk about him without obvious emotional pain, so I didn't push her for information about him.  I figured he didn't care about us.\n\nI had googled him multiple times over the years, but he was always unlisted and I didn't have an address with which to search.  After her death, I felt strongly that he should at least know that she died and that I have a beautiful little girl.  It felt wrong that he might be out there somewhere knowing nothing about us.\nI googled him again and came up with a phone number and address that seemed realistic.  I called, figuring it was going to be another person by the same name since I'd already experienced that several times while looking for him.  It wasn't.\n\nI had no idea how he would react to me, but he was ecstatic.  He told me that he had been a horrible alcoholic and that he didn't pursue custody of me because he felt himself to be selfish and unstable.  He said he knew that my mom and my family would love me and take wonderful care of me (he was right about that!  My mom was the best woman I've ever known).\n\nSo, we started talking and skyping.  We spent a lot of time learning about each other. Knowing how he had hurt my mom and bailed on me made it difficult to see him as the person he has grown to be, but I tried to believe that people can change for the better.  \n\nHe was exactly everything I needed in a father my entire life:  supportive, sweet, funny, loving.  Eventually, I told him that I loved him after months of talking with him.  He was over-the-moon.\n\nFast-forward to actually meeting him in person.  This is the part where, without knowing my dad or me, you might feel that I sound like an ass.  I say this because I don't have a precise reason or event that I can point to as to why I don't trust him.  Why he actually makes me really nervous.\n\nMy dad is really touchy and hovers all of the time.  He doesn't smell clean and his teeth are rotting and crumbled.  He doesn't give personal space and, when I spent a couple of nights staying at his trailer, he kept coming in to my room to check on me while I was sleeping.  He said that he was just so excited to have me there that he couldn't help it, but I really felt uncomfortable with it.  I couldn't sleep and was so glad that I didn't even consider bringing my daughter without spending time with him first.\n\nHe also asked me if he could kiss me on the mouth because his family does.  I said \"no\" and he accepted that, but the constant touchiness continued.  It wasn't anything strictly inappropriate, but it made my skin crawl.  \nI've spent very little actual time with him in person, maybe 2 weeks total over several trips.  I have, however, talked with him for countless hours on the phone and skype.  \n\nDuring the most acute months of grieving for my mom, he was so devoted to me, trying to talk me through whatever he could.  I was so grateful for it that I kept ignoring details about his character that really concerned me.  He actually demanded a lot of my time, like hours and hours every day and would get upset if I cited my daughter and husband as reasons that I needed to chill with the phone.  He never paid my mom child support and obviously was never there for us my entire life.  He also evaded taxes and told me he had been to court 9 times and jail once.  \n\nAgain, I know people can change, but at this point, I find myself wanting less contact with him.  The idea of him spending any time with my daughter alone is out of the question and my husband feels the same concerns.  I don't want to hurt him, but I just can't trust him.  I don't even know if I'm asking for advice or confessing to being stupid and rushing into something that will hurt someone.\n\nThank you for reading and I sincerely want to wish all the wonderful father's out there a very Happy Father's Day!\n\nETA:  TL;DR  I found my estranged Dad, thought I loved him after getting to know him, got to know him better and changed my mind.\n\n", "tldr": "  i found my estranged dad, thought i loved him after getting to know him, got to know him better and changed my mind.", "summary_text": "i met my dad for the first time in my entire life and i feel like an ass because i don't know why i don't trust him.", "rougescores": [{"rouge-1": {"f": 0.27999999503200007, "p": 0.25925925925925924, "r": 0.30434782608695654}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.1999999950500001, "p": 0.18181818181818182, "r": 0.2222222222222222}}], "compression_ratio": 0.027300541303836197, "original_pos_tags": {"PRP": 139, "VBD": 75, "JJ": 51, "NNP": 8, ",": 32, "CC": 41, "VBP": 17, "VBG": 30, "DT": 41, "NN": 89, "IN": 101, "RBS": 2, ".": 46, "PRP$": 29, "RB": 63, "VBN": 11, "WRB": 8, "CD": 3, "JJR": 3, "MD": 17, "VB": 40, "NNS": 20, "WDT": 4, "TO": 22, "JJS": 2, "RP": 1, "(": 1, ")": 1, "VBZ": 9, ":": 3, "``": 1, "''": 1, "RBR": 1, "PDT": 1, "POS": 2}, "summary_pos_tags": {"NN": 6, "VBD": 1, "PRP$": 2, "IN": 4, "DT": 2, "JJ": 3, "CC": 1, "VBP": 3, "RB": 2, "VB": 2, "WRB": 1, "NNS": 1, "PRP": 1, ".": 1}}
{"original_text": "So I had the brilliant idea to use Veet hair removal gel as the ol' danglies were in need of a trim and I had heard that Veet leaves them smoother for longer. Well I guess thats right when the skin has to grow back first. \n\nPre-Story: I tried this before and the results were great but I had decided to do it again because of how well it worked. \n\nSo I take out the gel/cream stuff and just lob it on and cover the forest. The slight peroxide kinda smell ensued and all was going well, there was a slight burning but thats to be expected, you know, melting pubes off does that. So comes the all and mighty time of scraping that stuff off, top half all good, no pain or anything. But, the danglies were what was burning, I scraped them and withstood the pain because well lets face it, men are men and a little pain for balls as smooth as jam jars is fine right? Wrong, it did great at taking the hair off it, but decided to take the first layer of skin too, my nuts now glow cherry red and walking is a painful expense that can't be justified.\nI feel sauron has just tipped them in mount doom and dragged me balls first down the side of a rock wall. \n\nTLDR: Had my balls burned by sauron and was left deveeted.", "tldr": " had my balls burned by sauron and was left deveeted.", "summary_text": "tried to get rid of hair on danglies, ended up burning them and now my balls look like they're going to fall off a rock wall.", "rougescores": [{"rouge-1": {"f": 0.16666666265432112, "p": 0.11538461538461539, "r": 0.3}, "rouge-2": {"f": 0.0588235255190314, "p": 0.04, "r": 0.1111111111111111}, "rouge-l": {"f": 0.11428571020408178, "p": 0.08, "r": 0.2}}], "compression_ratio": 0.10330578512396695, "original_pos_tags": {"RB": 19, "PRP": 19, "VBD": 17, "DT": 23, "JJ": 15, "NN": 37, "TO": 5, "VB": 8, "NNP": 4, "IN": 22, "POS": 1, "NNS": 12, "CC": 16, "VBN": 9, "VBZ": 9, "JJR": 2, ".": 10, "VBP": 6, "WRB": 2, ":": 2, "RP": 2, "JJS": 1, "VBG": 5, ",": 11, "EX": 1, "WP": 1, "UH": 1, "PRP$": 2, "WDT": 1, "MD": 1}, "summary_pos_tags": {"VBN": 1, "TO": 2, "VB": 2, "JJ": 1, "IN": 3, "NN": 3, "NNS": 2, ",": 1, "VBD": 1, "RP": 2, "VBG": 2, "PRP": 2, "CC": 1, "RB": 1, "PRP$": 1, "VBP": 2, "DT": 1, ".": 1}}
{"original_text": "Today I was going to have a bath after a long day of painting kids faces at a carnival. All would go well, except being the genius I am, I put in some epsom salts (I always do for my bath), and I grabbed my bottle of peppermint essential oil.\n\n Lately, I've been on a diy-pinterest-tumblr-let's-make-my-own-shit-and-be-fancy spree. The other day I took a 'detox bath' (fyi did nothing for me guys. Uselessss). So, my brain totally went 'hey, trajectorys, put some peppermint in! It's good for your skin!' Okay brain!\n\nSo, instead of logically putting in like... 5 drops so it's nice and minty fresh smelling and just enough to work, I literally shook the thing full force all over the top of the bath water. I'm talking like... probably 50-100 drops. So I finish running the water, turn it off, and hop in.\n\nFirst five minutes went really well.. And then the cold started. Okay, this is fine, it just is the peppermint cooling my skin. Brain is like, just wait it out. So I stayed in.\n\nTen minutes in and I'm moving back and forth trying to keep the warm water warm, if I stopped moving it was like sitting in the water at the foot of a glacier. So I sit up.\n\nYou know that feeling when you brush your teeth and drink ice water? That immense cold in your mouth? My back felt like that immediately. \n\nSo now I'm sitting here and my back, my butt, and my ladybits are burning cold. Like, sitting in the snow naked kind of cold. It's really uncomfortable... So indeed, TIFU.\n\nTL;DR: Peppermint + bath = burning cold ladybits.", "tldr": " peppermint + bath = burning cold ladybits.", "summary_text": "put peppermint essential oil in my bath, it made me sit in the water at the foot of a glacier, and now my ladybits are burning cold.", "rougescores": [{"rouge-1": {"f": 0.23529411437716266, "p": 0.14814814814814814, "r": 0.5714285714285714}, "rouge-2": {"f": 0.06249999695312515, "p": 0.038461538461538464, "r": 0.16666666666666666}, "rouge-l": {"f": 0.19354838360041626, "p": 0.125, "r": 0.42857142857142855}}], "compression_ratio": 0.08672798948751642, "original_pos_tags": {"NN": 48, "PRP": 25, "VBD": 12, "VBG": 16, "TO": 3, "VB": 6, "DT": 25, "IN": 34, "JJ": 19, "NNS": 10, "VBZ": 8, ".": 24, "MD": 1, "RB": 28, ",": 19, "VBP": 14, "(": 2, "PRP$": 10, ")": 2, "CC": 10, "VBN": 1, "POS": 1, "NNP": 9, "CD": 4, "''": 1, ":": 5, "RP": 3, "WRB": 1}, "summary_pos_tags": {"VB": 2, "NN": 7, "JJ": 1, "IN": 4, "PRP$": 2, ",": 2, "PRP": 2, "VBD": 1, "DT": 3, "CC": 1, "RB": 1, "NNS": 1, "VBP": 1, "VBG": 1, ".": 1}}
{"original_text": "I haven't had a bath in practically years so, after finally moving into a house with a bath, I decide to have one. Having recently purchased a shiny new bag of weed, I thought combining the two would be a good idea.\n\nPicture this; a very cramped bathroom, no windows, a shitty extractor fan, closed door, steaming hot bath and a spliff. As I lay there gently swishing to and fro, giggling like a little school girl, I neglected to notice how hot the room was becoming. \n\nAfter a while I looked up and realised I could barely even see the taps in front of me. Naturally, I begin to panic and started scrambling around trying to escape. I grabbed a towel, stood up and immediately fell back to the floor. All I could see was black for what felt like 5 minutes, my heart was pounding and I could feel the blood rushing past my ears.\n\nOnce the feeling passed I stumbled into my bedroom and stood in front of the mirror, facing me was an extremely red version of myself with a bleeding shoulder. \n\nCurrently, my heart rate has almost returned to normal and I'm starting to feel and look less like a lobster. 2/10 would not recommend.\n\nTL;DR Got too high and too hot in the bath, almost cooked myself like a lobster.", "tldr": " got too high and too hot in the bath, almost cooked myself like a lobster.", "summary_text": "got too high and too hot in the bath, almost cooked myself like a lobster. 2/10 would not recommend. 3/10 would not recommend. 2/10 would not recommend.", "rougescores": [{"rouge-1": {"f": 0.7142857096938776, "p": 0.5555555555555556, "r": 1.0}, "rouge-2": {"f": 0.6999999954500001, "p": 0.5384615384615384, "r": 1.0}, "rouge-l": {"f": 0.8484848435996327, "p": 0.7368421052631579, "r": 1.0}}], "compression_ratio": 0.1256198347107438, "original_pos_tags": {"PRP": 17, "VBP": 5, "RB": 22, "VBD": 18, "DT": 26, "NN": 34, "IN": 22, "NNS": 5, ",": 15, "VBG": 13, "TO": 8, "VB": 13, "CD": 4, ".": 12, "VBN": 2, "JJ": 13, "MD": 5, ":": 2, "CC": 10, "WRB": 1, "RP": 1, "WP": 1, "PRP$": 4, "VBZ": 1, "JJR": 1, "NNP": 3}, "summary_pos_tags": {"VBD": 2, "RB": 6, "JJ": 2, "CC": 1, "IN": 2, "DT": 2, "NN": 2, ",": 1, "PRP": 1, ".": 4, "CD": 3, "MD": 3, "VB": 3}}
{"original_text": "This was like 2 and a half weeks ago maybe 3. So i left my house to meet up with my girlfriend at a spot in some sorta wood type thing near some nice houses. on my way i saw landscape workers working around the houses and cleaning.  i meet my gf and go find a spot in the woods. The spot we went to seemed nice and lonely for the both of us to hang out. I cant remember if we smoked or not (fried) but i was horny and I'm sure she was too so we start making out and start touching each other all over the place. Then we start having sex in the woods. We were having sex peacefully until we heard workers. They sounded far but every second they seemed to get closer.  We realized that they were just a few feet away.  quickly me And my gf got up and get dressed and  head over to a different spot which was not a good idea. We were kinda laying there and i told her that i wanted to finish, she said okay but she wanted to do it right there.I don't know what made me look back but when i do i see the landscapers and they were looking our way. There was about 3 or 4 workers. We quickly got off each other. I don't know for how long they were watching but they were watching. One kept looking our way. I was so embarrassed. Bastards ruined it too ;) we just hung out for a bit after and went our separate ways. I wont forget that day. \nTL;DR- i had sex with my gf in the woods and got caught by landscape workers.", "tldr": " i had sex with my gf in the woods and got caught by landscape workers.", "summary_text": "had sex with my gf in the woods and got caught by landscape workers. i was so embarrassed that i didn't want to talk about it.", "rougescores": [{"rouge-1": {"f": 0.7317073124330755, "p": 0.5769230769230769, "r": 1.0}, "rouge-2": {"f": 0.6666666620644314, "p": 0.52, "r": 0.9285714285714286}, "rouge-l": {"f": 0.7499999953125, "p": 0.6, "r": 1.0}}], "compression_ratio": 0.08923512747875353, "original_pos_tags": {"DT": 24, "VBD": 33, "IN": 24, "CD": 5, "CC": 20, "JJ": 18, "NNS": 14, "RB": 24, ".": 20, "PRP$": 9, "NN": 32, "TO": 7, "VB": 18, "RP": 5, "VBG": 11, "PRP": 30, "VBP": 8, "(": 1, "VBN": 4, ")": 2, "JJR": 1, "WDT": 1, ",": 1, "WP": 1, "WRB": 2, "EX": 1, ":": 2, "NNP": 2}, "summary_pos_tags": {"VBD": 4, "NN": 5, "IN": 5, "PRP$": 1, "DT": 1, "NNS": 2, "CC": 1, "VBN": 1, ".": 2, "RB": 2, "JJ": 1, "VB": 2, "TO": 1, "PRP": 1}}
{"original_text": "So, my oven is broken...and I'm out of cooking oil, but I want some french fries. So I search the internet and find that if you cover french fries with something, either napkins or another plate and microwave them, they turn out ok. So I tried it, I took to plates, smushed em together and put the french fries in the microwave. (Don't try this at home) \n Half way through the five minute cooking cycle I pull the plate out. Steam billowing out the crack between the two plates. I lift off the top plate and let it cool down a but, I touch the french fry and it's warm but a tad bit cold, I feel around and flip them with my fingers (Genius!) And then I reach the center of the plate. \n Freeze frame, have you ever microwaved something, like chicken nuggets, and the nuggets near the edge of the plate are colder than the ones in the middle? Well this is exactly what happened, but a thousand times worse. Since the fries have been blanched, frozen, bagged, and then put into my freezer, that means there's still some oil in the fries, and the microwave brought out that oil and boiled it, \n So I was poking around the fries when my finger squishes into a really soft one, right into the hell-fire center, where broiling hot potato smushes under my finger nail, I jump back in shock and flail around my hand whispering \"Ow, stop, Ow, stop, Ow, stop\" I cover the plate, start the microwave, and walk away, suddenly, this Burning sensation just erupts over the tip of my finger, full on pain train. I step into the bathroom and run it under cold water, only to find out. We're out of burn cream!\n\nSo now I'm sitting at my desk, with first degree burns on my index finger which I stuck in a bag of frozen corn \nas I type with one hand.\n\nTL;DR Tried to microwave french fries and stuck my finger into a franken-fuck of pain causing first degree burns\n\nUPDATE: I put aloe vera on the end of my finger and it feels like little tiny snow angels grinding up against my finger, so gud", "tldr": " tried to microwave french fries and stuck my finger into a franken-fuck of pain causing first degree burns", "summary_text": "tried to microwave french fries and stuck my finger into a franken-fuck of pain causing first degree burns, now sitting at my desk with first degree burns on my index finger.", "rougescores": [{"rouge-1": {"f": 0.7346938729029573, "p": 0.5806451612903226, "r": 1.0}, "rouge-2": {"f": 0.723404250701675, "p": 0.5666666666666667, "r": 1.0}, "rouge-l": {"f": 0.8181818133471075, "p": 0.6923076923076923, "r": 1.0}}], "compression_ratio": 0.08810126582278481, "original_pos_tags": {"RB": 22, ",": 34, "PRP$": 12, "NN": 69, "VBZ": 8, "VBN": 5, ":": 3, "CC": 23, "PRP": 30, "VBP": 20, "IN": 47, "VBG": 8, "DT": 39, "JJ": 21, "NNS": 19, ".": 13, "VB": 13, "RP": 10, "VBD": 11, "TO": 3, "(": 2, ")": 2, "NNP": 9, "CD": 4, "JJR": 1, "UH": 1, "WP": 1, "RBR": 1, "EX": 1, "WRB": 2, "``": 1, "''": 1, "WDT": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "VB": 2, "JJ": 3, "NNS": 3, "CC": 1, "PRP$": 3, "NN": 8, "IN": 5, "DT": 1, "VBG": 2, ",": 1, "RB": 1, ".": 1}}
{"original_text": "This technically happened yesterday since it 1:30 am here, but I can't sleep because I'm worried. \n\nBefore I start, let me set the scene. It's getting close to 6 on a mildly wet Western North Carolina summer day. Not too much rain, but enough to get the grass wet, and I'm in the really mountainous part of WNC. \n\nSo anyway, after hanging out with a friend of mine, we decide to visit another friend at her house since we're nearby.  I pull up the driveway, see other friends' truck in the way, so I try to go around. The friend I was riding with got \"Wait there's a-\" out just as I heard a *thunk*. \"-ditch there.\" Got-dang it Bobby. So I get out, lo and behold I'm stuck. If my truck had 4 wheel drive, I wouldn't have been as concerned. So I try to go further forward. I hear a *SNAP*. \"Well you broke my pipe, but that's fine.\" Turns out I snapped a ~3 inch PVC pipe (I guess for drainage) and it was now lodged in front of my right front tire.\n\nNow here's where it gets interesting.\n\nI leave my truck in neutral, go out to look at the pipe. Think *Oh, I can get that out from under there.* When I do, the whole truck comes rolling forward (remember; mountain country, I'm stuck on a slope.) I dodge the truck, which hits the girl's barn. Neither the barn nor the truck was hurt, but I was pinned between the truck and the barbed wire fence on the passenger side. After reassuring everyone there I was A-okay, one of the girls called her cousin, who brought a Jeep and a chain. I wriggle my way out of the wire, ever-so carefully step over the wire to make sure I can still have both boys and girls, not just one or the other, and make my way over to help hook things up and such. \n\nLong story short, we get it uphill a little, get another truck involved, get it angled better, cut the fence, and I drive my truck down the adjacent field (what the fence was there to fence off), and everything is okay. I ended up with just as many scratches as the truck. I just got a text to call the girl's mom tomorrow, and I'm worried that she'll tear me a new butthole after this. \n\nTl;dr- My truck went vroom vroom into a ditch. I tried to get it out, and it tried to kill me. After shouting \"Ole!\" and getting scratched up more than a husband having sex with a kinky cougar, two rednecks helped me out of a perilous predicament. And now me, my testicles, and my truck are all safe and sound.", "tldr": " my truck went vroom vroom into a ditch. i tried to get it out, and it tried to kill me. after shouting \"ole!\" and getting scratched up more than a husband having sex with a kinky cougar, two rednecks helped me out of a perilous predicament. and now me, my testicles, and my truck are all safe and sound.", "summary_text": "broke a pipe, got pinned between my truck and a barbed wire fence, and now my friend's mom is probably going to tear down her barn.", "rougescores": [{"rouge-1": {"f": 0.21176470163598624, "p": 0.34615384615384615, "r": 0.15254237288135594}, "rouge-2": {"f": 0.0481927668747282, "p": 0.08, "r": 0.034482758620689655}, "rouge-l": {"f": 0.14925372683448443, "p": 0.21739130434782608, "r": 0.11363636363636363}}], "compression_ratio": 0.05490360435875943, "original_pos_tags": {"DT": 47, "RB": 31, "VBN": 8, "NN": 83, "IN": 46, "PRP": 49, "CD": 6, "VBP": 23, ",": 33, "CC": 23, "MD": 5, "VB": 25, "JJ": 30, ".": 31, "VBZ": 10, "VBG": 8, "TO": 12, "NNP": 16, "RP": 9, "PRP$": 10, "NNS": 8, "POS": 3, "VBD": 19, "``": 4, "EX": 3, "''": 4, "(": 3, ")": 3, "WRB": 2, ":": 2, "WDT": 1, "WP": 2, "RBR": 1, "FW": 1, "JJR": 1}, "summary_pos_tags": {"VBD": 2, "DT": 2, "NN": 7, ",": 2, "VBN": 1, "IN": 1, "PRP$": 3, "CC": 2, "JJ": 1, "RB": 2, "POS": 1, "VBZ": 1, "VBG": 1, "TO": 1, "VB": 1, "RP": 1, ".": 1}}
{"original_text": "Earlier today, I was at the local county fair in the lovely county of Adams in Wisconsin. I was there to enjoy the fair, help out and have a wonderful day. However, later in the afternoon, I found myself in the Rabbit, Chicken, Duck, Goose and Dairy Barn. I was behind a row of rabbit cages with my cousin, which bordered up to the wooden fence divider between the rabbits and dairy cows. \n\nThis beautiful Heifer decided she wanted to poke her head through to the rabbit side  for what I thought, was to get a good scratch behind the ears, and on her bump. She however, had other thoughts. She was just interested in getting the bucket of water on the floor that was meant for watering the rabbits.\n\nWhen I reached down to scratch her, she tolerated it for about 10-15 seconds. At the end of those few seconds, I was looking away speaking to my husband, son, and cousin. All of a sudden, a loud thwack and searing pain in my right hand. I looked down, and she had my hand squished in between her head/head bump and the wooden fence post in the barn. \n\nAfter I got my hand loose, about ten seconds after the initial hit, it was already turning purple with a huge blood pool underneath my middle finger nail, as well as the base of the nail was bleeding in the cuticle. My other finger nails felt like I had played that stupid bite down on them as hard as you can, then push your fingers together game. So as of right now, my hand is still in serious pain, the nail is purple and has some serious blood build up underneath it. As well, all the rest of the blood vessels in the top of my finger have burst so its about three times the size it should be. So this is how I screwed my hand up, by fucking up and mistaking a heifer's want for water, as the want for attention.\n\nTL;DR I fucked up by mistaking a heifer's want for water as a want for attention, petted it, and screwed my hand up pretty bad. Mainly the middle finger.", "tldr": " i fucked up by mistaking a heifer's want for water as a want for attention, petted it, and screwed my hand up pretty bad. mainly the middle finger.", "summary_text": "i fucked up by mistaking a heifer's want for water as a want for attention, petted it, and screwed my hand up pretty bad.", "rougescores": [{"rouge-1": {"f": 0.9230769181065088, "p": 1.0, "r": 0.8571428571428571}, "rouge-2": {"f": 0.919999995032, "p": 1.0, "r": 0.8518518518518519}, "rouge-l": {"f": 0.9090909041322315, "p": 1.0, "r": 0.8333333333333334}}], "compression_ratio": 0.0628898128898129, "original_pos_tags": {"RBR": 1, "NN": 70, ",": 28, "PRP": 26, "VBD": 26, "IN": 54, "DT": 40, "JJ": 26, "NNP": 11, ".": 18, "RB": 26, "TO": 7, "VB": 8, "CC": 11, "VBP": 3, "NNS": 13, "PRP$": 16, "WDT": 2, "RP": 6, "WP": 1, "VBG": 10, "VBN": 4, "WRB": 2, "MD": 2, "VBZ": 4, "PDT": 1, "CD": 1, "POS": 2, ":": 1}, "summary_pos_tags": {"NN": 7, "VBD": 3, "RP": 2, "IN": 4, "VBG": 1, "DT": 2, "POS": 1, ",": 2, "PRP": 1, "CC": 1, "PRP$": 1, "RB": 1, "JJ": 1, ".": 1}}
{"original_text": "So recently I have come down with a nasty upper respiratory infection and have been coughing a lot.  \n\nToday, I was sitting in the cafeteria at my college when I felt a particularly big cough coming on. It was a very effective cough, and apparently too effective, because instantly I realized I had shat my pants.  While some may have been embarrassed, I was actually quite excited.  After spending so much time reading about people who shat them selves, you start to wonder what it feels like.  Well, now I know. \n\nTL;DR: I coughed so hard I shat my self and was happy about it.", "tldr": " i coughed so hard i shat my self and was happy about it.", "summary_text": "i coughed so hard that i shat my self and was happy about it. i'm not sure if i'll ever get over it.", "rougescores": [{"rouge-1": {"f": 0.7222222176080247, "p": 0.5652173913043478, "r": 1.0}, "rouge-2": {"f": 0.6470588189619378, "p": 0.5, "r": 0.9166666666666666}, "rouge-l": {"f": 0.7272727226446282, "p": 0.5714285714285714, "r": 1.0}}], "compression_ratio": 0.17271157167530224, "original_pos_tags": {"RB": 12, "PRP": 14, "VBP": 6, "VBN": 5, "RP": 1, "IN": 10, "DT": 6, "JJ": 9, "NN": 10, "CC": 3, "VBG": 5, ".": 7, ",": 6, "VBD": 8, "PRP$": 3, "WRB": 1, "NNS": 2, "MD": 1, "VB": 2, "WP": 2, "VBZ": 2, "TO": 1, "NNP": 3, ":": 2}, "summary_pos_tags": {"NN": 3, "VBD": 2, "RB": 3, "JJ": 4, "IN": 4, "VBP": 2, "PRP$": 1, "CC": 1, "PRP": 2, ".": 2, "VB": 2, "MD": 1}}
{"original_text": "So yeah it actually didn't happen today but about 5 years ago. I was still a virgin and kind of frustrated about it. You know how it goes \"shit i'm still a virgin...\"\n\nSo I was at this party and I heard that there was a girl which I heard she was pretty easy(Let's call her easy girl from now on). So for the rest of the evening I spent drinking, I went outside to smoke. There was easy girl. I was really fucked up, but I thought hey, let's try this! I took her apart to someones driveway. We began to kiss, started to go down on her. Everything went alright I even brought a condom! (well look at that!) I started fumbling around with my dick since I was drunk and never done it before.\n\nWe fucked for a while but then I decided since I couldn't feel anything, let's take the condom off! Great idea! Now I was so fucked up I couldn't come so I asked her if she maybe would give me a blowjob. She agreed and gave me a blowjob (here is where the fuck up comes) When I thought I came I actually peed in her fucking mouth, no shit. I thought I came but my prostate thought otherwise. \n\nShe gargled a little bit and then spit it out...Never spoke to her since and sometimes when I see her mother, she gives me this weird look. I don't know if she knows...\n\nTL;DR: Lost my virginity on someones driveway with a girl I didn't give a shit about and peed in her mouth. \n", "tldr": " lost my virginity on someones driveway with a girl i didn't give a shit about and peed in her mouth. ", "summary_text": "lost my virginity on someones driveway with a girl i didn't give a shit about and peed in her mouth. never spoke to her since.", "rougescores": [{"rouge-1": {"f": 0.8695652124291116, "p": 0.8, "r": 0.9523809523809523}, "rouge-2": {"f": 0.8636363586776858, "p": 0.7916666666666666, "r": 0.95}, "rouge-l": {"f": 0.8837209252568958, "p": 0.8260869565217391, "r": 0.95}}], "compression_ratio": 0.09244314013206163, "original_pos_tags": {"RB": 32, "VB": 19, "PRP": 44, "VBD": 32, "NN": 34, "CC": 11, "IN": 28, "CD": 1, "NNS": 2, ".": 18, "DT": 19, "VBN": 4, "VBP": 6, "WRB": 4, "VBZ": 5, "``": 1, "JJ": 8, ":": 5, "''": 1, "EX": 2, "WDT": 1, "(": 3, "NNP": 4, "POS": 3, "PRP$": 9, ")": 3, ",": 7, "TO": 5, "RP": 4, "VBG": 2, "MD": 3}, "summary_pos_tags": {"VBN": 1, "PRP$": 3, "NN": 5, "IN": 5, "NNS": 1, "RB": 3, "DT": 2, "VBD": 2, "VB": 2, "CC": 1, ".": 2, "TO": 1}}
{"original_text": "My boss had a stroke. He was hospitalized today. While a coworker was explaining his status I had my ear buds in and was laughing hysterically like a hyena at adviceanimals. \nTl;Dr caught laughing during bad news ", "tldr": " caught laughing during bad news ", "summary_text": "my boss had a stroke. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today. he was hospitalized today.", "rougescores": [{"rouge-1": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.0, "p": 0.0, "r": 0.0}}], "compression_ratio": 3.140845070422535, "original_pos_tags": {"PRP$": 3, "NN": 8, "VBD": 6, "DT": 3, ".": 3, "PRP": 2, "VBN": 1, "IN": 5, "VBG": 3, "JJ": 2, "CC": 1, "RB": 1, "NNS": 1, "NNP": 2, ":": 1}, "summary_pos_tags": {"PRP$": 1, "NN": 26, "VBD": 25, "DT": 1, ".": 25, "PRP": 24, "VBN": 24}}
{"original_text": "This happened this last weekend  we all know that \"I'm glad you came\" song right? yeah i now will forever HATE that song \n\nlet me rewind i am 22 years old and in college my mom and sister came to pick me up for the weekend because my car is at the shop\nwell anyways that song comes on my sister starts singing it and of course, me the idiot would be the one to say \"THATS WHAT YOUR MOM SAID LAST NIGHT' she immediatley smacked me and the mouth and pretended nothing even happened.  \n\n\nTL;DR : I told my sister i came on my mother last night because of a song she was singing", "tldr": " i told my sister i came on my mother last night because of a song she was singing", "summary_text": "i told my sister i came on my mother last night because of a song she was singing and i pretended to be the one to say \"thats what your mom said last night' she smacked me and the mouth and nothing even happened.", "rougescores": [{"rouge-1": {"f": 0.5806451571696151, "p": 0.4090909090909091, "r": 1.0}, "rouge-2": {"f": 0.5666666626055555, "p": 0.3953488372093023, "r": 1.0}, "rouge-l": {"f": 0.6274509760861208, "p": 0.45714285714285713, "r": 1.0}}], "compression_ratio": 0.3693379790940767, "original_pos_tags": {"DT": 9, "VBD": 9, "JJ": 5, "NN": 21, "PRP": 11, "VBP": 3, "IN": 12, "``": 2, "''": 1, "RB": 4, ".": 2, "UH": 1, "MD": 2, "VB": 6, "NNP": 10, "CD": 2, "NNS": 1, "CC": 5, "PRP$": 5, "TO": 2, "RP": 1, "VBZ": 5, "VBG": 2, ",": 1, "POS": 1, ":": 2}, "summary_pos_tags": {"NN": 11, "VBD": 7, "PRP$": 3, "IN": 3, "JJ": 2, "DT": 3, "PRP": 3, "VBG": 1, "CC": 3, "TO": 2, "VB": 2, "CD": 1, "``": 1, "NNS": 1, "WP": 1, "POS": 1, "RB": 1, ".": 1}}
{"original_text": "Every day I drive to a park and ride, which is about 2 miles away from my place. Well this morning as I was leaving, I left my keys on the counter and locked the door on the way out. It was both my car keys and my condo keys and I had no way back in. My wife had left for work 5 minutes earlier; I tried calling her and she didn't answer. \n\n\nSo I decided to walk...not three steps down the stairs I felt a fart coming on...I let it out slowly because I haven't been feeling great lately, and I felt a wet juicy fart slip out of my cheeks, only it wasn't just a fart it was diarrhea. It wasn't a lot, but enough to feel terrible.  \n\n\nI had no choice though, but to walk; and of course, living the greater Seattle area, it started raining. It was a 25 minute walk, then a 30 minute bus-ride with runny crap between my cheeks. The only good news was that when I got to work, my underwear wasn't too badly stained.\n\n\n**TL;DR:** Locked myself out of my car and condo, sharted, had to walk in the rain 2 miles to the bus. ", "tldr": " locked myself out of my car and condo, sharted, had to walk in the rain 2 miles to the bus. ", "summary_text": "locked myself out of my car and condo, sharted, had to walk in the rain 2 miles to the bus. *shit my pants.*", "rougescores": [{"rouge-1": {"f": 0.8888888839111112, "p": 0.8333333333333334, "r": 0.9523809523809523}, "rouge-2": {"f": 0.8837209252568958, "p": 0.8260869565217391, "r": 0.95}, "rouge-l": {"f": 0.8999999950125, "p": 0.8571428571428571, "r": 0.9473684210526315}}], "compression_ratio": 0.1062992125984252, "original_pos_tags": {"DT": 20, "NN": 38, "PRP": 21, "VBP": 3, "TO": 7, "CC": 10, ",": 12, "WDT": 1, "VBZ": 2, "IN": 22, "CD": 6, "NNS": 7, "RB": 19, "PRP$": 9, ".": 10, "VBD": 22, "VBG": 6, "NNP": 3, "VBN": 4, "RBR": 1, ":": 6, "VB": 6, "RP": 1, "JJ": 4, "JJR": 1, "WRB": 1}, "summary_pos_tags": {"VBN": 2, "PRP": 1, "IN": 3, "PRP$": 2, "NN": 5, "CC": 1, ",": 2, "VBD": 1, "TO": 2, "VB": 2, "DT": 2, "CD": 1, "NNS": 2, ".": 2}}
{"original_text": "So, this girl in my class and I have been working on a number of projects lately and we've developed a great connection.  There seems to have been a number of signals, her calling things \"our song,\" texts for no reason, etc...  The only problem was that I was her group leader (she was working under me) and I felt it inapropriate to make my move while that was still the case.\n\nFast forward to last night, she comes over for a few drinks before we meet up with other classmates for a night at the bar.  The project finished the day before and I was starting to make more physical contact between us.  \n\nFriends come over, I get wasted....wake up the next morning with a different girl in my bed and her ignoring my calls.\n\nReddit, I fucked up!\n\ntl;dr - Like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up", "tldr": " like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up", "summary_text": "tried to make a move on a girl, slept with a different girl, fucked everything up tl;dr - like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up tl;dr - like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up tl;dr - like a girl, finally decided it was safe to make a move, slept with a different girl, fucked everything up tl;dr - like a girl, finally decided it was safe to make a move, slept with a different girl", "rougescores": [{"rouge-1": {"f": 0.33057850963731994, "p": 0.19801980198019803, "r": 1.0}, "rouge-2": {"f": 0.31932772840901075, "p": 0.19, "r": 1.0}, "rouge-l": {"f": 0.8499999951125, "p": 0.7391304347826086, "r": 1.0}}], "compression_ratio": 0.6034883720930233, "original_pos_tags": {"RB": 4, ",": 10, "DT": 18, "NN": 30, "IN": 20, "PRP$": 7, "CC": 6, "PRP": 15, "VBP": 5, "VBN": 4, "VBG": 4, "NNS": 7, "JJ": 11, ".": 6, "EX": 1, "VBZ": 2, "TO": 5, "VB": 6, "``": 1, "''": 1, ":": 4, "VBD": 11, "(": 1, ")": 1, "NNP": 2, "RP": 5, "JJR": 1}, "summary_pos_tags": {"VBN": 1, "TO": 5, "VB": 5, "DT": 15, "NN": 28, "IN": 10, ",": 13, "JJ": 9, "VBD": 12, "RP": 4, ":": 8, "CC": 4, "RB": 4, "PRP": 4}}
{"original_text": "(Technically this is more of a Three Years Ago I Fucked Up, but I digress...)\n\nBack in the good old school days, we had Friday sport. This term, myself and a group of friends decided to join the Representative Touch Footy team, and we were waiting for the bus to take us to our semi final match.\nMy friend was sitting on the side of the grassy hill where we were waiting, and yelled \"Oi, come over here!\" and patted her lap.\n\nSo, naturally I went over and jumped into her lap, in a weak attempt to crush her legs. Much laughing ensued, which attracted the attention of our other friends. So, we ended up in a pile of about 10, resembling a pile of stacked-up chairs.\n\nOne of my teachers noticed, and walked over to us, shaking his head slightly. Of course, what is the most natural response to seeing a stack of people sitting in each others laps? Push the stack.\nSo, with eight people in front of me (with some pretty serious weight adding up there), we fell over sideways.\n\nAs the laughter increased tenfold, I heard a very faint clicking sound. Feeling my leg tense up, I looked down. Bad move.\n\nAbout five centimetres to the right of my leg was my knee cap, hanging (or levitating as it appeared from my angle) in midair.\n\nSo, after a number of very unladylike expletives and a bit of yelling/screaming, people noticed that my knee cap had attempted to escape my leg and called an ambulance. \nThen the bus showed up.\n\nSo, while my friends went to sport and got their asses kicked by a fellow high school, I sat on the side of the hill with my fucked up leg.\nThe paramedics show up, and ask if they can try and put my knee cap back in place without pain killers. At this point, the extremely light spring breeze which is flowing feels like razor blades cutting into my tendons, so I wasn't exactly keen on this idea.\n\nSo, they picked up the end of my leg and pulled.\n\nI think I punctured an eardrum, screaming. \n\nThey realise that this might not be the best plan, so I'm bundled up onto a stretcher and head off to hospital. Driving in an ambulance with a dislocated knee cap was never on my bucket list, but at least I've crossed it off?\n\nWhen I arrive at the hospital, I'm finally given the good pain killers (Nitrous oxide for the win, none of that \"Green Whistle\" shit) and the ER physio walks in. It took three people to stabilise me, while he pulled my foot and twisted. Behold, my knee cap FINALLY pops back in! They waited for me to come down of the high of the nitrous before fitting me in a knee brace and crutches.\n\nNote for the wise - a knee brace which holds your leg completely straight, thus making one leg longer than the other, will fuck you over. Worst two weeks ever.\n\nAfter a month, with crutches, a knee brace and some really pleasant taping, physiotherapy and an inability to climb stairs easily, my knee was finally released from its self-induced prison.\n\nI've never sat in that friend's lap again. I also got an A in Geography from that teacher at the end of that term.\n\nEdit: tl;dr: Sat in my friend's lap, douchebag teacher dislocates my knee, kneecap decides to stay locked to the side until I got to the hospital, drugs then two weeks on crutches.", "tldr": " sat in my friend's lap, douchebag teacher dislocates my knee, kneecap decides to stay locked to the side until i got to the hospital, drugs then two weeks on crutches.", "summary_text": "tried to crush my friend's legs, fell over, dislocated my knee cap, had to drive to hospital in an ambulance with a dislocated knee cap.", "rougescores": [{"rouge-1": {"f": 0.25454544958677694, "p": 0.28, "r": 0.23333333333333334}, "rouge-2": {"f": 0.03773584410110425, "p": 0.041666666666666664, "r": 0.034482758620689655}, "rouge-l": {"f": 0.13043477769376202, "p": 0.15, "r": 0.11538461538461539}}], "compression_ratio": 0.042794210195091255, "original_pos_tags": {"(": 4, "RB": 37, "DT": 60, "VBZ": 5, "JJR": 2, "IN": 84, "CD": 9, "NNS": 32, "PRP": 37, "VBD": 36, "RP": 10, ",": 43, "CC": 21, "VBP": 12, ":": 5, ")": 4, "JJ": 28, "NN": 110, "NNP": 13, ".": 34, "TO": 16, "VB": 17, "VBG": 18, "PRP$": 28, "WRB": 2, "``": 2, "''": 2, "VBN": 11, "WDT": 3, "WP": 1, "RBS": 1, "MD": 3, "JJS": 2, "POS": 2}, "summary_pos_tags": {"VBN": 2, "TO": 3, "VB": 3, "PRP$": 2, "NN": 6, "POS": 1, "NNS": 1, ",": 3, "VBD": 2, "RB": 1, "IN": 2, "DT": 2, "JJ": 1, ".": 1}}
{"original_text": "So I got a windows 7 ultimate disc and decided i should upgrade and start fresh. I decide that I will keep all my files (about 400 gigs) so I brought my laptop to school to hook up to one of the extra hard drives while I had decided to reinstall. So get to school and whats the first thing my dumbass self does? Put the installation disc in and format the whole hard drive without backing up. so now I have lost all my videos, half finished projects, notes and school work. \n\nTL;DR: I wanted to upgrade my windows but didn't back up my files so now i have 400 gigs of videos and school work to redo/redownload. ", "tldr": " i wanted to upgrade my windows but didn't back up my files so now i have 400 gigs of videos and school work to redo/redownload. ", "summary_text": "i wanted to upgrade my windows but didn't back up my files so now i have 400 gigs of videos and school work to redo/redownload.", "rougescores": [{"rouge-1": {"f": 0.9803921518646674, "p": 1.0, "r": 0.9615384615384616}, "rouge-2": {"f": 0.9795918317367763, "p": 1.0, "r": 0.96}, "rouge-l": {"f": 0.977777772780247, "p": 1.0, "r": 0.9565217391304348}}], "compression_ratio": 0.2078559738134206, "original_pos_tags": {"RB": 8, "PRP": 7, "VBD": 6, "DT": 7, "NNS": 11, "CD": 4, "JJ": 8, "NN": 16, "CC": 7, "MD": 2, "VB": 12, ".": 6, "VBP": 4, "IN": 7, "PRP$": 6, "(": 1, ")": 1, "TO": 7, "RP": 3, "VBN": 2, "VBZ": 1, "VBG": 1, ",": 2, "NNP": 2, ":": 2}, "summary_pos_tags": {"RB": 4, "VBD": 2, "TO": 2, "VB": 3, "PRP$": 2, "NNS": 4, "CC": 2, "RP": 1, "VBP": 2, "CD": 1, "IN": 1, "NN": 2, ".": 1}}
{"original_text": "Okay so this morning I woke up extremely tired, looking for a way to wake my self up (I don't go back to sleep easily, so i decided to wake up instead). I chose food (what else!?)\n\nSo I went to the kitchen, poured some cereal into a bowl and got a cup, got out the milk and juice (I have the same god damn thing every day), and poured the milk into the cup and the juice on the cereal.\n\nThing is, as I was tired as fuck, I didn't notice until i put the first mouthful in my mouth. I noticed the odd taste, and actually LIKED it. I finished my breakfast as it is, no complaints. Won't do it again though, as it was a ridiculous amount of juice.\n\n**TL;DR: Woke up tired as fuck and poured juice on my cereal and liked it**", "tldr": " woke up tired as fuck and poured juice on my cereal and liked it**", "summary_text": "i woke up tired as fuck and poured juice on my cereal and liked it, but didn't notice until i put the first mouthful in my mouth.", "rougescores": [{"rouge-1": {"f": 0.6341463369660917, "p": 0.48148148148148145, "r": 0.9285714285714286}, "rouge-2": {"f": 0.6153846109401712, "p": 0.46153846153846156, "r": 0.9230769230769231}, "rouge-l": {"f": 0.6486486440905771, "p": 0.5, "r": 0.9230769230769231}}], "compression_ratio": 0.17916666666666667, "original_pos_tags": {"NNP": 3, "RB": 14, "DT": 17, "NN": 31, "PRP": 13, "VBD": 16, "RP": 3, "VBN": 3, ",": 10, "VBG": 1, "IN": 16, "TO": 4, "VB": 6, "PRP$": 4, "(": 3, "VBP": 3, ")": 3, ".": 8, "WP": 1, "CC": 7, "JJ": 6, "VBZ": 2, "NNS": 1, ":": 2}, "summary_pos_tags": {"NN": 6, "VBD": 4, "RB": 2, "VBN": 1, "IN": 4, "CC": 3, "JJ": 3, "PRP$": 2, "PRP": 1, ",": 1, "VB": 1, "DT": 1, ".": 1}}
{"original_text": "**WARNING!: WALL OF TEXT WHICH COULD EASILY BE VIEWED AS REALLY FUCKING BORING**\n\nThe background of the relationship is that we had met online and hadn't met yet. He lives 200 miles away from where I live, but my life's rather busy and he doesn't have a job right now (unemployment in his region is over 50%, so I don't blame him). He's a very kind, sweet human being, and I probably would have been lucky to end up with him. Now, I'm not from the country I'm currently studying in, but I would like to end up here eventually. It seemed that the stars had aligned in showing me that there was hope for love here… Boy, was I wrong.\n\nThere's a huge secessionist movement within a different region (one which neither of us live in), which has been gaining traction over the years, especially with the recent economic collapse. I am a lover of said region; it's the place where I feel the most comfortable in the entire world — the people, the cuisine, the culture… all of it just *fits*.\n\nHe, however, does not feel the same way about this region. I already knew that, but it had been bothering me since he had called people from there \"obnoxious sheeps [sic]\", amongst other things. We have always had different communication styles (I'm a fucking loudmouth and he's rather reserved), but we had been making it work. This morning, however, I couldn't hold back some of my worries, and amongst other things, I mentioned how he wants to live in an entirely different country and how I would not.\n\nThe **tl;dr** would be that **he effectively told me I should live in a region he hates and I admire because I clearly don't understand the political climate — in so many words, we should break things off.** However, it's much deeper than that. Apparently, half his family is from said region (and it's the half he dislikes, of course), and he had lived there a very brief period of time. Despite all that, apparently he had never had a bad time there and no one ever did any harm to him. So I really couldn't figure out what his beef was with this place that has always seemed so charming to me.\n\nI don't know what else to say, really. I debated with him my point as best as I could, calling out flaws in his argument about the nature of the secessionist movement and the national identity of the people from that region. For a while I thought he could at least be tolerant of my deep regard for it but… it would appear that even that was impossible. I got fed up with his ad hominem attacks on me and on the people who live out there, and I told him he can act like a child all he likes, but it doesn't make a whole group of people terrible just for their geographical location.\n\nTbph, I'm a bit numb to it all. In January I had a whirlwind romance which tore me to pieces by the end of it. And having this happen without ever even meeting to see if we're compatible in the real world… Welp, I'm just done with men for a while. I don't feel anything and my only reaction to this whole thing was to clean my room and wash my sheets in a fervor. He apparently felt awful that he'd lost my respect, but rather I deleted him from all of our sources of communication, which I did so I wouldn't have to deal with his remorse.\n\nI'm not sure if I really fucked up today but… it would have been nice to at least have *tried* to make things work instead of leaving things off on such a sour note. C'est la vie.", "tldr": " would be that **he effectively told me i should live in a region he hates and i admire because i clearly don't understand the political climate — in so many words, we should break things off.** however, it's much deeper than that. apparently, half his family is from said region (and it's the half he dislikes, of course), and he had lived there a very brief period of time. despite all that, apparently he had never had a bad time there and no one ever did any harm to him. so i really couldn't figure out what his beef was with this place that has always seemed so charming to me.", "summary_text": "told my boyfriend that he should live in a region he hates and i admire because i don't understand the political climate. he doesn't feel the same way.", "rougescores": [{"rouge-1": {"f": 0.3142857110857143, "p": 0.7857142857142857, "r": 0.19642857142857142}, "rouge-2": {"f": 0.2173913012003781, "p": 0.5555555555555556, "r": 0.13513513513513514}, "rouge-l": {"f": 0.3333333298765432, "p": 0.75, "r": 0.21428571428571427}}], "compression_ratio": 0.04447717231222386, "original_pos_tags": {"NN": 84, ".": 28, ":": 3, "NNP": 17, "DT": 58, "IN": 75, "VBZ": 23, "PRP": 80, "VBD": 31, "VBN": 16, "CC": 22, "RB": 63, "CD": 3, "NNS": 23, "WRB": 4, "VBP": 20, ",": 34, "PRP$": 16, "POS": 1, "JJ": 40, "VB": 30, "(": 4, ")": 4, "VBG": 11, "MD": 15, "TO": 14, "RP": 8, "EX": 4, "WDT": 5, "RBS": 2, "``": 1, "''": 1, "JJR": 1, "PDT": 3, "WP": 3, "JJS": 2}, "summary_pos_tags": {"VB": 5, "PRP$": 1, "NN": 6, "IN": 3, "PRP": 3, "MD": 1, "DT": 3, "VBZ": 2, "CC": 1, "VBP": 1, "RB": 2, "JJ": 2, ".": 2}}
{"original_text": "I had my electronics class today and my professor gave us an assignment where we have to make something from nothing. Nothing being the broken computers and other electronics that we could find in our workroom. \n\nMy group decided to build a boat, because honestly, hot gluing a block of styrofoam to a CPU fan is the easiest idea that any of us could think of, but we wanted to get a bit more creative. We found a couple of speakers in an old bin, and one with the audio output still intact with an auxiliary headphone cable, so we decided to play around with them a bit and see if we could mount them on our boat. \n\nBefore we began work on them, we had to see that they worked, so I took the speaker with the intact audio output, plugged it into my phone, hooked up the speaker to the oscillator, kicked it up to five volts, and started playing a song on my phone.\n\nLittle did I know that the current would travel through the speaker, up the auxiliary cable, into my phone's audio input where the battery beyond had a maximum load capacity of only three point eight volts. \n\nI literally held my phone in my hands as the voltage fried my motherboard and the screen turned black, never to turn on again. \n\n**TL;DR: I bricked my phone by giving it shock therapy with an oscillator.** ", "tldr": " i bricked my phone by giving it shock therapy with an oscillator.** ", "summary_text": "gave my phone shock therapy with an oscillator, bricked my phone by giving it shock therapy with an oscillator, and now my phone won't work.", "rougescores": [{"rouge-1": {"f": 0.5263157849722992, "p": 0.4, "r": 0.7692307692307693}, "rouge-2": {"f": 0.49999999555555563, "p": 0.375, "r": 0.75}, "rouge-l": {"f": 0.6896551674673009, "p": 0.625, "r": 0.7692307692307693}}], "compression_ratio": 0.10920436817472699, "original_pos_tags": {"PRP": 22, "VBD": 20, "PRP$": 11, "NNS": 7, "NN": 48, "CC": 7, "DT": 26, "WRB": 2, "VBP": 2, "TO": 9, "VB": 12, "IN": 33, ".": 8, "VBG": 4, "JJ": 15, "MD": 4, "NNP": 3, ",": 14, "RB": 7, "VBZ": 1, "JJS": 1, "RBR": 1, "CD": 4, "RP": 3, "POS": 1, ":": 2}, "summary_pos_tags": {"VBD": 2, "PRP$": 3, "NN": 8, "IN": 3, "DT": 2, ",": 2, "VBG": 1, "PRP": 1, "JJ": 1, "CC": 1, "RB": 2, "MD": 1, "VB": 1, ".": 1}}
{"original_text": "I seldom go to Starbucks but today i decided i should go, well inner me decides, \"hey! Lets get a frappucino!\"  I'm lactose intolerant and coffee usually upsets my stomach, but hey I really wanted to go to try the new Hazelnut Frappe and this totally escaped my mind. Just because hey I'm thirsty! So I order it and drink it, shockingly for the first time in a while it didnt upset my stomach. Wow! So I go on about my day and go to the library for a couple of hours, leave campus and go to my local grocery store to buy lunch. \n\nI finally feel a rumble and start feeling cramps. Fuck this isn't good so I hurry about my business. I walk through the store and thought i had to fart. I was too trusting because next thing I feel is a warm splooge leaving my ass. Fuck this is not good! So I hurry and check out and get to my car. I squeeze my ass cheeks together and semi waddle to my car. Right when I get to my car it builds up and my body decides,\" fuck you bro!\" I shit myself. I felt warm hot liquid leave my ass, I cry a little. Thankfully I did have a change of clothes and found a public restroom. \n\nTl;dr go to starbucks, shit myself. ", "tldr": " go to starbucks, shit myself. ", "summary_text": "went to starbucks, got a frappucino, shit my ass, cried a little, went to starbucks, shit my ass, cried a little, went to starbucks, shit my ass, cried a little.", "rougescores": [{"rouge-1": {"f": 0.16666666388888893, "p": 0.1, "r": 0.5}, "rouge-2": {"f": 0.11764705631487893, "p": 0.06896551724137931, "r": 0.4}, "rouge-l": {"f": 0.33333332888888895, "p": 0.25, "r": 0.5}}], "compression_ratio": 0.14085739282589677, "original_pos_tags": {"PRP": 26, "RB": 18, "VBP": 17, "TO": 11, "NNP": 7, "CC": 14, "NN": 39, "VBD": 10, "MD": 1, "VB": 14, ",": 8, "IN": 12, "VBZ": 7, "``": 1, ".": 19, "DT": 15, "''": 3, "JJ": 19, "PRP$": 13, "UH": 1, "NNS": 6, "VBG": 1, "RP": 1, "WRB": 1, ":": 1}, "summary_pos_tags": {"VBD": 7, "TO": 3, "NNS": 3, ",": 9, "DT": 4, "NN": 4, "VB": 3, "PRP$": 3, "JJ": 3, ".": 1}}
{"original_text": "This was actually a few weeks ago, but over the course of my relationship with my girlfriend we have shared quite a lot of intimate texts between each other. Among those however are the rest of our texts, usually filled with sweet messages, thoughtful things, important life events, etc. I have my phone set to back up all of my texts and upload them to my Dropbox account, which is synced with my computer.\n\nOne day, I had to help share a file between my computer and my brother's. I set up my Dropbox account on his computer so that the file transfer could be easier. Little did I know, his computer would not only have access to my files, but be notified when a new file was uploaded.\n\nA few days later, my phone uploads the recent backup of my texts, and my brother sees it. Since it had a weird file name, he opened it to make sure it wasn't some virus. Sure enough, the first text he sees is the beginning of a sext from my girlfriend, going into much detail about how we want to fuck each other and how horny we are. He didn't read the whole thing, but now my younger knows about my sex life in excruciating detail.\n\nEdit**TL;DR: Accidentally backed up sexts to brother's computer, he discovered them, he now knows the things my girlfriend and I do in bed.", "tldr": " accidentally backed up sexts to brother's computer, he discovered them, he now knows the things my girlfriend and i do in bed.", "summary_text": "accidentally backed up sexts to brother's computer, he discovered them, he now knows the things my girlfriend and I do in bed. oops.", "rougescores": [{"rouge-1": {"f": 0.9333333283358024, "p": 0.9130434782608695, "r": 0.9545454545454546}, "rouge-2": {"f": 0.8837209252352624, "p": 0.8636363636363636, "r": 0.9047619047619048}, "rouge-l": {"f": 0.9302325531422391, "p": 0.9090909090909091, "r": 0.9523809523809523}}], "compression_ratio": 0.10451306413301663, "original_pos_tags": {"DT": 21, "VBD": 10, "RB": 15, "JJ": 17, "NNS": 9, ",": 17, "CC": 8, "IN": 22, "NN": 45, "PRP$": 20, "PRP": 19, "VBP": 8, "VBN": 6, ".": 11, "FW": 1, "TO": 7, "VB": 9, "RP": 3, "NNP": 4, "WDT": 1, "VBZ": 7, "CD": 1, "POS": 2, "MD": 2, "JJR": 1, "WRB": 3, "VBG": 2, ":": 2}, "summary_pos_tags": {"RB": 2, "VBD": 2, "RP": 1, "NN": 5, "TO": 1, "POS": 1, ",": 2, "PRP": 4, "VBZ": 1, "DT": 1, "NNS": 2, "PRP$": 1, "CC": 1, "VBP": 1, "IN": 1, ".": 2}}
{"original_text": "Well it wasn't today but rather last night.... After a few drinks and a blunt (we are both ents), my boyfriend and I decided to \"do the dirty\" since its been a few days. We were getting really into it when he decides he wants to do anal again. I'm not a big fan but we have done it before and he knows to be gentle so I said why not. I'm pretty sure he was on e too because he lasted way longer than normal and he was going pretty fast when we switched it up. After telling him a few times to slow down because it hurt, he switched back to good old vaginal intercourse from behind. Well, here is where the Fuck up happened. Any of you ladies who have done anal are probably aware of that \"poopy feeling\" after, so of course that was happening. He was still going in from behind, so I decided to stick my butt up and arch my back down because it drives him insane, when all of a sudden I felt a fart rumbling through.....then it happened. Though, It was more than a fart. We both stopped and I asked sheepishly if there was a mess, he said no then promptly ran to the bathroom. I heard the shower go on and that's when I knew he was just trying to not make a big deal of it. \n\nWhen he came out of the shower I ran in the bathroom almost in tears and showered as well. I came back out and didn't even want to say anything, I was horrified. He assured me it was ok and that we would pretend it never happened, and all night and all day he was being a lot nicer than usual knowing that although I'm not embarrassed by much at all, when I am embarrassed, i don't take it lightly. \n\nTL;DR: I sharted on my boyfriend during sex.", "tldr": " i sharted on my boyfriend during sex.", "summary_text": "sharted on my boyfriend during sex, he didn't make a big deal of it, and we were both nice about it all day and all night.", "rougescores": [{"rouge-1": {"f": 0.303030299687787, "p": 0.19230769230769232, "r": 0.7142857142857143}, "rouge-2": {"f": 0.2580645130072841, "p": 0.16, "r": 0.6666666666666666}, "rouge-l": {"f": 0.3225806416649324, "p": 0.20833333333333334, "r": 0.7142857142857143}}], "compression_ratio": 0.07526218383713756, "original_pos_tags": {"IN": 40, "PRP": 50, "VBD": 36, "RB": 34, "NN": 33, "CC": 14, "JJ": 20, ":": 4, ".": 16, "DT": 27, "NNS": 6, "(": 1, "VBP": 10, ")": 1, ",": 12, "PRP$": 5, "TO": 9, "``": 2, "VB": 12, "''": 2, "VBN": 5, "VBG": 8, "WRB": 8, "VBZ": 6, "RP": 3, "UH": 1, "NNP": 3, "WP": 1, "WDT": 1, "RBR": 1, "EX": 1, "MD": 1}, "summary_pos_tags": {"VBN": 1, "IN": 4, "PRP$": 1, "NN": 5, ",": 2, "PRP": 4, "VBD": 2, "RB": 1, "VB": 1, "DT": 4, "JJ": 2, "CC": 2, ".": 1}}
{"original_text": "Ok so first off i would like to say its not funny till the end so prepare to be like \"o shit\" and then \"is this ever going to end\" but enjoy.\n So i was going downstairs about 2 hours ago to get something to eat and possibly to drink. While downstairs i notice my mother eating a salad, and naturally i was like fuck yea salad i love me some salad. upon investigation of the refrigerator I notice that there isn't any salad left. (btw fuck you grammer nazi's because i dont care about my punctuation) I decide that im going to be crafty...so i grab it and sneak behind my mother and yell loudly that i was the salad ninja and stole a bite. Now as this happens she turns and looks at me with dissapointment  in her eyes as she yells \"stay off my fu-.......\" and at that moment she looks up at me and gasps that she cant breathe and needs help. so i do what i think the fucking Heimlich maneuver is, which wasnt pretty at all, and fail horribly and start yelling for her to breathe because it was all i could think to do and this woke my step-dad. at this moment i realized she was coughing which means she was breathing to some extent. my stepdad rolls in the kitchen and tries to pull off his version of the Heimlich maneuver as well which also wasnt pretty at all. and after some trial and error he looks at me realizing she is breathing as well sort of saying \"what the hell are we in here doing as far as i know shes fine.\" then he looks back down at her only to look up again and stare into my eyes as if he is looking at my soul or something for at least 15 seconds which felt like a year or something. then my wife comes down the stairs and she starts freaking out and calls the ambulance and i realize why she was shocked as i saw the puddle of blood coming from my mothers mouth. The squad showed up and they asked questions like her name and other various things a squad would ask before packing her up in the gurney and rolling out to the hospital. my step-dad left shortly after and i havnt seen or heard from them yet. Although i had a terrible realization just a few minutes ago...\n\nI would like to start off by saying that my step-fathers half mexican daughter is coming to ohio tomorrow to see her father for the first time in her life. (she is 29 years old) So tomorrow is a very special day, but just like the dumbass idea of salad ninja i decided to be an ass again and do something even more stupid. I decided that since she is part mexican she must be catholic right? riiiiiiiiiiiiiight. So i also think who is the biggest catholic ever....Muffuckin hitler. So since i was going to be the first person she sees at 10 AM tomorrow morning i thought i would shave my head and all of my facial hair except for a hitler mustache and completely act like it was normal and this is how i look all the time. \n\nOf course i forget about this completely as it was several hours before and no one else had known about it. This also made me realize that the 15 seconds my step-dad stared into my soul was actually the 15 seconds my step-dad was wondering why in the fuck does this dumbass have a fucking hitler mustache. As i have said i hadnt talked to anyone about it and no one knew anything about it, nor have i talked to anyone since it happened and im sure im going to hear about his when they all get home. Im not really sure how to explain a hitler mustache to anyone, if anyone has ideas im open for them. However i definitely would say that i fucked up hardcore and this isnt going to be a good convo at all...fml.\n\nTL:DR: I damn near killed my mom while being the \"salad ninja\" and had to explain what had happened to the paramedics while having a hitler mustache.", "tldr": " i damn near killed my mom while being the \"salad ninja\" and had to explain what had happened to the paramedics while having a hitler mustache.", "summary_text": "tried to be a salad ninja and save my mother's life and now my step-fathers half mexican daughter is coming to see her father for the first time in her life.", "rougescores": [{"rouge-1": {"f": 0.21052631082794718, "p": 0.1935483870967742, "r": 0.23076923076923078}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.16666666170138905, "p": 0.15384615384615385, "r": 0.18181818181818182}}], "compression_ratio": 0.042663043478260866, "original_pos_tags": {"NNP": 6, "RB": 52, "IN": 91, "NN": 118, "MD": 7, "VB": 38, "TO": 26, "PRP$": 28, "JJ": 47, "DT": 59, "``": 5, "''": 5, "CC": 39, "VBZ": 26, "VBG": 24, "VBP": 26, ".": 27, "VBD": 31, "NNS": 22, "CD": 7, ",": 6, "PRP": 40, "EX": 1, "(": 2, "POS": 1, ")": 2, ":": 8, "RP": 8, "WP": 4, "WDT": 4, "JJS": 2, "WRB": 5, "VBN": 10, "RBR": 1, "PDT": 1}, "summary_pos_tags": {"VBN": 1, "TO": 2, "VB": 3, "DT": 2, "JJ": 4, "NN": 7, "CC": 2, "PRP$": 4, "POS": 1, "RB": 1, "NNS": 1, "VBZ": 1, "VBG": 1, "IN": 2, ".": 1}}
{"original_text": "This happened a few years back so i know its not today, but its my cake day and i do what i want. \n\nSo i was working at a fast food restaurant working the grill. It was a particularly busy day, and I didn't have a lot of experience on the grill. I was working with a few good friends and this girl lets call her Cathy. Now Cathy has burns on about 90% of her body which is very unfortunate, but Cathy is also a huge bitch. Cathy was working transfer(basically taking hamburger patties and putting them on the buns). So you can imagine what happens next... Cathy is waiting for me to finish up a couple of patties but I know they have another half a minute or so until she should take them. Then all of a sudden a wild order appears, I think it was grilled onions or jalapenos and some grilled chicken. so I throw these down real quick and start to go to town. In the process of this Cathy tells me that she needs my meat. I tell her to give me a couple seconds, but that wasn't quick enough for her. She decides in horrible fashion that shes just going to grab it off the grill. So in my blatant ignorance I say \"I hope you burn yourself.\" The mistake I just made quickly pours over me, but before i have time to correct myself and apologize she replies with \" I already have.\" I immediately feel the daggers of empathy go through my heart, and try to apologize, but the damage is done and I realize that everyone around me is just staring. Fuck... \n\n\ntl;dr told a girl with burns on 90% of her body \"I hope you burn yourself\"", "tldr": " told a girl with burns on 90% of her body \"i hope you burn yourself\"", "summary_text": "tl;dr told a girl with burns on 90% of her body \"i hope you burn yourself\" and everyone around me is staring at me now.", "rougescores": [{"rouge-1": {"f": 0.7499999953125, "p": 0.6, "r": 1.0}, "rouge-2": {"f": 0.7368421006094183, "p": 0.5833333333333334, "r": 1.0}, "rouge-l": {"f": 0.7692307644970415, "p": 0.625, "r": 1.0}}], "compression_ratio": 0.0779816513761468, "original_pos_tags": {"DT": 28, "VBD": 11, "JJ": 18, "NNS": 9, "RB": 21, "VBP": 18, "PRP$": 11, "NN": 38, ",": 8, "CC": 18, "VB": 15, "WP": 2, ".": 15, "IN": 31, "VBG": 9, "PRP": 34, "VBZ": 15, "NNP": 7, "VBN": 3, "CD": 2, "WDT": 1, "(": 1, ")": 1, "MD": 2, ":": 3, "TO": 7, "RP": 3, "PDT": 1, "``": 3, "''": 3}, "summary_pos_tags": {"NN": 5, ":": 1, "CC": 2, "VBD": 1, "DT": 1, "IN": 5, "NNS": 1, "CD": 1, "PRP$": 1, "``": 1, "JJ": 1, "VBP": 2, "PRP": 4, "''": 1, "VBZ": 1, "VBG": 1, "RB": 1, ".": 1}}
{"original_text": "After much pleading with my girlfriend I was able to convince her to have special sexy times. That's right, I was going to take my love canoe to the Grand Tetons! Not only that, but I was going to, for lack of something clever, cum right on her neck, which sounds fantastic and foolproof! How naive I was to think that I could do this without doing what I did instead. \n\nSo we are going at it, I'm making sweet sweet glorious love to her sweet sweet boobs. I start to get some tingles and jingles brewing downstairs and I get ready for what I expect to be a wonderful and simple ejaculation. \n\nI get into position and angle everything towards her neck so it can easily be cleaned up afterwards. And then it happened. I ejaculated. But, it took this mysterious unexplainable angle. And it was as if time slowed down so as to allow me to watch every last moment of what was happening. Instead of going straight out and to her neck, it went up and it had this stunning arching angle that ended up landing right straight in the middle of her eye. That's right, I came right in her eye with an angle that would not allow me to do that!\n\nThat is when I started uncontrollably laughing while I was straddling her body which caused my penis to bounce up and down in front of her face and smacking bouncing on her chest. As she was in pain, I could not stop laughing at what just happened. This caused her eye to get extremely red and I still couldn't stop laughing. \n\nTLDR; tried to make babies in my girlfriend's eye.", "tldr": " tried to make babies in my girlfriend's eye.", "summary_text": "tried to make babies in my girlfriend's eye with an angle that would not allow me to do that and ended up bouncing my penis up and down in front of her face.", "rougescores": [{"rouge-1": {"f": 0.39024389929803693, "p": 0.24242424242424243, "r": 1.0}, "rouge-2": {"f": 0.35897435602892835, "p": 0.21875, "r": 1.0}, "rouge-l": {"f": 0.45714285361632656, "p": 0.2962962962962963, "r": 1.0}}], "compression_ratio": 0.10397350993377484, "original_pos_tags": {"IN": 31, "JJ": 22, "NN": 35, "PRP$": 14, "PRP": 29, "VBD": 21, "TO": 16, "VB": 17, "NNS": 6, ".": 17, "DT": 14, "VBZ": 4, ",": 10, "VBG": 16, "NNP": 2, "NNPS": 1, "RB": 19, "CC": 14, "WDT": 4, "WRB": 2, "MD": 5, "WP": 4, "VBP": 6, "VBN": 4, "RP": 4, ":": 1, "POS": 1}, "summary_pos_tags": {"VBN": 1, "TO": 2, "VB": 3, "NNS": 1, "IN": 4, "PRP$": 3, "NN": 6, "POS": 1, "DT": 2, "WDT": 1, "MD": 1, "RB": 3, "PRP": 1, "CC": 2, "VBD": 1, "RP": 1, "VBG": 1, ".": 1}}
{"original_text": "I went on a road trip to visit my mom last week. It was my first time driving to NYC. My map app told me that it was a toll road so I pulled out $20 cash thinking it would be plenty. I'm from the midwest and I've never paid a toll that was higher than maybe $4. I've made the drive up I95 as far north as Baltimore all the way down to GA and I knew there weren't any tolls until I went under the harbor and that one was only a few bucks. I felt prepared.\n\nI pay a couple of tolls totaling $12 and now I'm on the Jersey turnpike. I glanced at my ticket and assume that the $8 I have left should cover my toll just fine. I have not actually zoomed out of my route at all and have just been trusting the map to tell me where I'm going. \n\nTurns out it doesn't even matter because I get in the wrong lane and end up being forced through the EZ pass. I don't have one. There's no way to back up or turn around. Cars are honking at me because I'm pretty much panicking at this point. My kids are in the car asking me what's going on and I have no choice but to go forward and hope that I'm not committing a felony or something. \n\nFrom there on it's rapid fire exits and the start of intense traffic going into the city. There's no place to pull over and pull more cash, nor did it even occur to me to do so because by now I'm no longer on an Interstate. However, a few miles down the road and there's another tollbooth and they want $12, which, of course, I don't have because nothing in my years of Interstate travel through middle America has prepared me for how much tolls are on the East Coast. She waves me through and I feel like crying. I have taken cross country road trips alone with 4 kids since they were babies and have never once felt as stupid and incapable as I did then. \n\nFast forward to today and I get a bright orange envelope in the mail. It's an EZ pass citation. Not only do I owe them $13 (!) for the toll, but I'm charged an extra $50 as a fine. I'm praying that the other toll I owe doesn't have the same fee added to it. \n\nIronically enough, on the way home I accidentally picked a route consisting of state roads and didn't realize it at first. I literally paid $3 in tolls and shaved 2 hours off the trip by avoiding backed up metro traffic. But guess who had $150 in my purse just waiting for a tollbooth to materialize on the horizon?\n\nTL;DR Gas to get from GA to NY round trip was around $200. Tolls and citations will probably end up being over half that. So much for my idea to take a spontaneous road trip and surprise my kids with a visit to grandma's house. ", "tldr": " gas to get from ga to ny round trip was around $200. tolls and citations will probably end up being over half that. so much for my idea to take a spontaneous road trip and surprise my kids with a visit to grandma's house. ", "summary_text": "i got in the wrong lane on the turnpike and ended up paying $13 for a toll that wasn't even a toll. now i have to pay an extra $50.", "rougescores": [{"rouge-1": {"f": 0.1866666618666668, "p": 0.23333333333333334, "r": 0.15555555555555556}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.18749999517578136, "p": 0.23076923076923078, "r": 0.15789473684210525}}], "compression_ratio": 0.050637804406648626, "original_pos_tags": {"PRP": 51, "VBD": 23, "IN": 65, "DT": 45, "NN": 74, "TO": 16, "VB": 23, "PRP$": 11, "JJ": 24, ".": 30, "VBG": 15, "NNP": 19, "RP": 9, "$": 10, "CD": 14, "MD": 3, "VBP": 31, "CC": 27, "RB": 39, "VBN": 9, "WDT": 2, "JJR": 2, "PDT": 2, "EX": 4, "NNS": 17, "WRB": 2, "VBZ": 12, "RBR": 1, "WP": 2, ",": 7, "(": 1, ")": 1, ":": 1, "POS": 1}, "summary_pos_tags": {"NN": 5, "VBD": 3, "IN": 3, "DT": 5, "JJ": 2, "CC": 1, "RP": 1, "VBG": 1, "$": 2, "CD": 2, "WDT": 1, "RB": 4, ".": 2, "VBP": 1, "TO": 1, "VB": 1}}
{"original_text": "Okay, so I just got off work today and I had to tell this story somewhere. I work in a call center for a cable company for their tech support. Today I got a specific call about something along the lines of \"When I open internet explorer all that comes up is a giant white screen and I can never close out of the pages\"\n\nAt first I thought, maybe he hit f11 and it cause the browser to go full screen. In the end I figured out he was actually using the new windows 8 operating system and just didn't know how to navigate it whatsoever. I'm not an expert on windows 8 by any means, but I thought I would at least give him a brief tutorial just to help him out even though it was out of my support boundaries. This guy was bounced from line to line and no one was willing to help him, so why wouldn't I make his day just a bit better by doing him this one favor?\n\nWell, for one, this guy was a bit strange. He was an older man, and 5 minutes into the call he let me know \"how beautiful of a voice\" I have. Asked me my age and where I'm located (basically any information I was allowed to give out.) He repeated my name multiple times and just kept talking about how pretty my voice apparently is on the phone. I didn't think much of it, until we got to me showing him how to use his OS. \n\nOver the phone I talked him through typing in an address in the actual address bar at the bottom of the page on windows 8 and prompted him to type in a code which would allow me to remotely access his computer and navigate it/type stuff on it/use a highlighter/etc in order to show him how to use the computer. First things first, let's delete all those open tabs..\n\nLucky me I guess, half those tabs were porn. Straight up porn. My favorite had to have been the \"daddy daughter massage play\". Definitely had me rethinking those questions I answered earlier in the call. Anyways, when The tabs opened I heard him on the other line say \"Oh, hello there!\" and I about died laughing. \n\nThe rest of the call was super awkward, and now I'm pretty sure I have a phobia of old men calling me for technical support. But at least it's over. \n\ntl;dr tried helping someone with a problem even though it was out of my realm of support and ended up looking at multiple pages of an elderly man's porn, then had to close it out for him because he didn't know how. TIFU.", "tldr": " tried helping someone with a problem even though it was out of my realm of support and ended up looking at multiple pages of an elderly man's porn, then had to close it out for him because he didn't know how. tifu.", "summary_text": "tl;dr tried helping someone with a problem even though it was out of my realm of support and ended up looking at multiple tabs of porn.", "rougescores": [{"rouge-1": {"f": 0.6764705835121109, "p": 0.8846153846153846, "r": 0.5476190476190477}, "rouge-2": {"f": 0.636363631657484, "p": 0.84, "r": 0.5121951219512195}, "rouge-l": {"f": 0.6774193500936525, "p": 0.875, "r": 0.5526315789473685}}], "compression_ratio": 0.057692307692307696, "original_pos_tags": {"NNP": 7, ",": 14, "IN": 51, "PRP": 54, "RB": 28, "VBD": 33, "RP": 9, "NN": 73, "CC": 16, "TO": 15, "VB": 24, "DT": 44, ".": 22, "VBP": 9, "PRP$": 10, "JJ": 28, "NNS": 15, "``": 4, "WRB": 10, "PDT": 3, "WDT": 2, "VBZ": 5, "MD": 4, "''": 4, "VBG": 10, "CD": 6, "JJS": 2, "VBN": 6, "RBR": 2, "UH": 2, "JJR": 1, "(": 1, ")": 1, "POS": 2, ":": 1}, "summary_pos_tags": {"NN": 7, ":": 1, "CC": 2, "VBD": 3, "VBG": 2, "IN": 7, "DT": 1, "RB": 1, "PRP": 1, "PRP$": 1, "RP": 1, "JJ": 1, ".": 1}}
{"original_text": "Technically it was not today but last friday, hope you forgive me there. Also, forgive the bad english of a spanish speaker.\n\n  So I´m a nervous guy,and this week, the money my parents gave me for college went away faster than usual, because I had to buy some groceries on my apartment that I didn´t account for. Now, I dont have a debit card so I can't get money from my savings that easily. So naturally I don't tell anything to my parents about me running out of money and I try to solve the situation myself by asking my friend to lend me some money, which I end up missmanaging, and by friday morning I had only enough money to return to my apartment and thats it. As I was pretty much bankrupt and I had to attend to some classes saturday morning, I give up and end up asking my parents to send me money. At this point all that goes through my mind is how bankrupt I am and how likely it is that money wont come on time and I´ll find myself with nothing to eat on saturday morning, so I was not paying attention while I took the bus back home.\n\nThe bus drivers where I live are pretty much insane, and policemen apparently dont care about this, so it was perfectly logical for the bus driver to skip a red light and go down my street at a 100km/h instead of 40km/h. In this moment I realize I will miss my stop, and there are no set stops for the bus on my country, outside of the capital city, so I yell at the guy to stop, of course he can´t go from a hundred to 0 in the half second that it would take him to get to my street. The guy slows down to 30km/h by the moment he gets to my stop, and I for some reason thought I could be a badass and jump/run out of the bus whithout fall damage cause well, my mind was all over the place about money, so I jumped from a moving bus, at 30km/h and the inevitable happens, I wreck my ankle like a total dumbass, and end up on the floor with gravel on my mouth, in front of the now fully stopped bus with people checking on me from the windows. Out of pure shame I stand up and signal them that I'm ok and walk all the way to my apartment (approx 200m plus straircases) I lay on my bed and try to forget the incident by browsing reddit.\n\nFast forward 3 hours and my ankle already is the size of a melon (a small melon), and I can't bear the pain. Luckily this is also the moment that my cousin (who was sent to give me the money my parents were sending me) gets to the apartment so I ask him to get me to the hospital. Long story short, I had a sprain and my tibia and fibula are half a cm more separated than they were supposed to be, which earns me a cast, a $300 bill with my cousin, and a lot of explaining to do at college to all the proffesors I end up owing exams, and to my already pissed parents.\n\nTL;DR: Jumped out of a bus, walked back home and got carried back to the hospital to find out walking normally was out of the table for the next two or three months.", "tldr": " jumped out of a bus, walked back home and got carried back to the hospital to find out walking normally was out of the table for the next two or three months.", "summary_text": "ran out of money, jumped out of a moving bus at 30km/h and ended up on the floor with gravel on my mouth and my ankle.", "rougescores": [{"rouge-1": {"f": 0.275862064019025, "p": 0.3076923076923077, "r": 0.25}, "rouge-2": {"f": 0.14285713791454097, "p": 0.16, "r": 0.12903225806451613}, "rouge-l": {"f": 0.26086956025519853, "p": 0.2857142857142857, "r": 0.24}}], "compression_ratio": 0.04039712427250942, "original_pos_tags": {"RB": 36, "PRP": 53, "VBD": 23, "NN": 103, "CC": 28, "JJ": 24, ",": 30, "VBP": 24, ".": 15, "DT": 59, "IN": 74, "VBZ": 12, "PRP$": 24, "NNS": 19, "RBR": 2, "TO": 29, "VB": 29, "MD": 5, "NNP": 6, "VBG": 11, "WDT": 3, "RP": 6, "WRB": 3, "VBN": 8, "CD": 10, "EX": 1, "PDT": 3, "(": 3, ")": 3, "WP": 1, "$": 1, ":": 2}, "summary_pos_tags": {"VBD": 3, "IN": 8, "NN": 6, ",": 1, "DT": 2, "VBG": 1, "CD": 1, "CC": 2, "RB": 1, "PRP$": 2, ".": 1}}
{"original_text": "So, I was playing Halo 4 at my friends house. We played like 5 matches, and I had been doing horribly.\n\nWe start up a game of free for all and we get at it. Intense game. Last 20 seconds and im tied with my friend who is sitting there split screening with me. I win by a kill.\n\nHerrs where I fuck up. I get so excited and all of us are cheering that I kick the Xbox over. It makes a weird humming noise and we wait like 10 seconds before unplugging it.\n\nHe pops out the disc, and shit, its scratched. Its now unreadable. I had to give him my copy. Fuck.\n\nTL;DR: Im a loser at Halo, win once, freak out, kick xbox, scratch disc, have to give him mine.", "tldr": " im a loser at halo, win once, freak out, kick xbox, scratch disc, have to give him mine.", "summary_text": "i kicked the xbox, scratched the disc, and had to give my copy to my friend, who now has to buy a new copy of the game.", "rougescores": [{"rouge-1": {"f": 0.22222221742222234, "p": 0.18518518518518517, "r": 0.2777777777777778}, "rouge-2": {"f": 0.04651162312601456, "p": 0.038461538461538464, "r": 0.058823529411764705}, "rouge-l": {"f": 0.20512820015779104, "p": 0.19047619047619047, "r": 0.2222222222222222}}], "compression_ratio": 0.18307692307692308, "original_pos_tags": {"RB": 6, ",": 9, "PRP": 19, "VBD": 5, "VBG": 6, "NNP": 6, "CD": 4, "IN": 14, "PRP$": 5, "NNS": 5, "NN": 16, ".": 14, "CC": 6, "VBN": 4, "VBP": 8, "RP": 4, "DT": 8, "JJ": 7, "WP": 1, "VBZ": 4, "WRB": 1, "TO": 2, "VB": 4, ":": 2}, "summary_pos_tags": {"NN": 7, "VBD": 3, "DT": 4, ",": 3, "CC": 1, "TO": 3, "VB": 2, "PRP$": 2, "WP": 1, "RB": 1, "VBZ": 1, "JJ": 1, "IN": 1, ".": 1}}
{"original_text": "ok, sigh. this happened last night.\n\nmy friend, brother and i went to go watch a movie at a local theatre. im getting over a stomach flu so ive been passing gas lately, sorry for the TMI. so we find a parking spot and i thought it would be funny to rip a huge one before we leave to see if the smell would still stay in the truck until after the movie, i really didnt need to so i tried to force one out! and boom... a BIG ASS SHART!!! i had the most embarrassing face on, my friend and brother asked me what was wrong and i told them what happened, and they were literally ROFL. we were late for the movie because i had to take a pitstop at starbucks bathroom.\n\ni took me a good 25 minutes to wipe up, throw away my boxers, and do anything else to clean myself up. i couldnt do anything about the smell tho. and when i was done, i opened the door and there was a line of people waiting for the bathroom. :/ FML\n\nTL;DR i forced a shart, cleaned up and stunk up a starbucks bathroom, and watched a movie COMMANDO.", "tldr": " i forced a shart, cleaned up and stunk up a starbucks bathroom, and watched a movie commando.", "summary_text": "i forced a shart, cleaned up and stunk up a starbucks bathroom, and watched a movie COMMANDO. i'm an idiot.", "rougescores": [{"rouge-1": {"f": 0.8648648598977356, "p": 0.8, "r": 0.9411764705882353}, "rouge-2": {"f": 0.857142852179592, "p": 0.7894736842105263, "r": 0.9375}, "rouge-l": {"f": 0.8275862019500595, "p": 0.75, "r": 0.9230769230769231}}], "compression_ratio": 0.10573122529644269, "original_pos_tags": {"NN": 43, ",": 11, "RB": 9, ".": 14, "DT": 22, "VBD": 18, "JJ": 12, "PRP$": 3, "CC": 11, "VB": 14, "TO": 8, "IN": 16, "VBG": 3, "VBN": 3, "NNP": 9, "PRP": 9, "VBP": 5, "MD": 2, "CD": 3, ":": 3, "RBS": 1, "WP": 2, "NNS": 5, "RP": 5, "WRB": 1, "EX": 1}, "summary_pos_tags": {"RB": 1, "VBD": 3, "DT": 4, "NN": 5, ",": 2, "RP": 2, "CC": 2, "VB": 1, "NNS": 1, "NNP": 1, ".": 2, "VBP": 1}}
{"original_text": "Because my nails are super thick and I have scissors instead of clippers, I tend to forget clipping them every now and then, causing them to get super long and, and some cases, super fragile.\n\nWhile I was pacing around, killing time by listening to music, I stumbled down the mini-steps into the hallway, sending my right big toe smashing into the back of my left foot. Sure, it hurt like a bitch for a second, but I'd done it before and didn't think it was that serious. \n\nUntil I got into my room and saw the blood on my foot.\n\nTurns out my nail was so long, the leverage from the impact cracked it in half horizontally, and sent the sharp interior edge down into the nail bed, causing insane amounts of bleeding.\n\nHave I mentioned yet that I'm hemophobic? Probably should've mentioned that.\n\nNow, because I also fucked up by not getting new sneakers recently and my only pair squeezes the hell out of my toes, I'm going to have to wear flip flops. In fourty degree weather.\n\nTL;DR - Suffered the agony of the feet, nearly passed out at the sight of my fuckup.", "tldr": " suffered the agony of the feet, nearly passed out at the sight of my fuckup.", "summary_text": "didn't clipping my nails, cracked my nail in half, and will have to wear flip flops in fourty degree weather for the rest of the week.", "rougescores": [{"rouge-1": {"f": 0.19512194657941712, "p": 0.15384615384615385, "r": 0.26666666666666666}, "rouge-2": {"f": 0.051282046679816326, "p": 0.04, "r": 0.07142857142857142}, "rouge-l": {"f": 0.114285709779592, "p": 0.08695652173913043, "r": 0.16666666666666666}}], "compression_ratio": 0.12617702448210924, "original_pos_tags": {"IN": 28, "PRP$": 9, "NNS": 9, "VBP": 8, "JJ": 15, "NN": 29, "CC": 9, "PRP": 16, "RB": 17, ",": 15, "TO": 5, "VB": 5, "VBG": 10, "DT": 16, ".": 10, "VBD": 11, "RP": 4, "VBZ": 3, "MD": 2, "VBN": 4, "NNP": 2, ":": 2}, "summary_pos_tags": {"VBD": 1, "RB": 1, "VBG": 1, "PRP$": 2, "NNS": 2, ",": 2, "VBN": 1, "NN": 6, "IN": 4, "CC": 1, "MD": 1, "VB": 2, "TO": 1, "JJ": 2, "DT": 2, ".": 1}}
{"original_text": "It's the start of a glorious weekend. Getting home from a long day, hanging out with close friends, getting the occasional call or text message to jump from one activity to the next. Early evening I receive a text from what I believed, at the time, was a beautiful, yet intelligent woman I had been texting earlier that day. She's flirting with me, I'm flirting back and all is going smoothly. This sort of stuff carries on for the next few hours, until she she says she has to walk home from a local fast food restaurant. I ask her which establishment that she had dined (*Actually wouldn't call this dining, but rather eating out*) that particular evening. She says that it was one that was particularly close by. I begin to ask whether she had moved from one home to another one close by, she says no. At the time, this didn't raise a red flag.\n\nNext day, we text back and forth. The usual winky face and the cliche flirtatious remark is made towards one another and I'm thinking to myself \" Wow, could this be going any better?\" But then, reality struck. I received a call from the attractive woman that I had been texting the previous day and I looked at the number thinking \"Oh God, WHAT HAVE I DONE?!\" Soon, I scrolled through my text messages realizing that I was texting an obese, not so attractive male associate of mine. In shock, I instantly told the attractive female what the situation was, she laughed, of course, at what had happened. I still have yet to reply to the male associate of mine in fear of the awkwardness that has ensued.\n\nTL;DR: Make sure you know who you are testing, or else you may find things out about your associates that you wouldn't want to know.", "tldr": " make sure you know who you are testing, or else you may find things out about your associates that you wouldn't want to know.", "summary_text": "texted an obese, not so attractive male associate of mine, thinking it was a female associate of mine who was flirting with me, turns out it was an obese, not so attractive male associate of mine.", "rougescores": [{"rouge-1": {"f": 0.066666661866667, "p": 0.05555555555555555, "r": 0.08333333333333333}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.09523809024943337, "p": 0.09090909090909091, "r": 0.1}}], "compression_ratio": 0.1163895486935867, "original_pos_tags": {"PRP": 33, "VBZ": 10, "DT": 33, "NN": 51, "IN": 34, "JJ": 25, ".": 18, "VBG": 14, ",": 21, "RP": 2, "NNS": 6, "CC": 10, "TO": 9, "VB": 11, "CD": 5, "VBP": 9, "WP": 5, "VBD": 17, "VBN": 7, "RBR": 1, "RB": 16, "WDT": 3, "(": 1, "MD": 4, ")": 1, "``": 2, "NNP": 9, "JJR": 1, "''": 2, "PRP$": 2, ":": 2}, "summary_pos_tags": {"VBN": 1, "DT": 3, "JJ": 7, ",": 4, "RB": 4, "NN": 6, "IN": 4, "VBG": 2, "PRP": 3, "VBD": 3, "WP": 1, "VBZ": 1, "RP": 1, ".": 1}}
{"original_text": "So today started like any other Saturday. I picked up my buddy from his house and came back to mine to play some GameCube games. We got a bit hungry around 1-ish today and decided to get something we haven't eaten in a while. I offered my dad to buy him lunch and he said Taco Bell. I was hesitant because I never really eat there (I'm not big on Taco Bell, sue me). My dad reassured me that the Loaded Grillers they now serve we're great so I took is word, got my friend, my dad and myself a bunch of shit and had a nice lunch. The spicy chicken grillers are actually great and I had 3.\n\nAny way lets fast forward to about 7 o'clock. I have my girlfriend, my buddy and 2 other friends with us. We're all starving so my girlfriend suggests Arby's. I say why the fuck not cuz it's been a while as well and I get a chicken, bacon and swiss sandwich and a chocolate shake. Fucking delicious by the way. So we get back to my house and all is well. My girlfriend and I both smoke so throughout the day and night we are smoking as well. \n\nNow fast forward again to about 11, I start getting cramps in my lower abdomen, like knife stabbing. I manage to ignore it, but around 11:40 rolled around and my one buddy and I are left at the house. I'm doing everything I can to hold it in. I bro-hug my buddy goodbye quick and I **SPRINT** to the bathroom whilst grabbing my laptop, charger, phone and smokes. \n\nWhich brings us to here. I'm past the hour mark and still going. I'm typing this as I take a Sir Harrington (look it up). Also, no TP so I'm using paper towels. Sorry for the wall of text.\n\n\n**TL;DR: I ate Taco Bell and Arby's in the same day and I haven't left my toilet for a fucking HOUR with no TP! Pretty sure my anus is bleeding**", "tldr": " i ate taco bell and arby's in the same day and i haven't left my toilet for a fucking hour with no tp! pretty sure my anus is bleeding**", "summary_text": "ate Taco Bell and Arby's in the same day and haven't left my toilet for a fucking hour with no toilet paper and no TP.", "rougescores": [{"rouge-1": {"f": 0.6296296246570645, "p": 0.68, "r": 0.5862068965517241}, "rouge-2": {"f": 0.49999999502958586, "p": 0.5416666666666666, "r": 0.4642857142857143}, "rouge-l": {"f": 0.680851058886374, "p": 0.7619047619047619, "r": 0.6153846153846154}}], "compression_ratio": 0.06805074971164937, "original_pos_tags": {"RB": 28, "NN": 55, "VBD": 14, "IN": 28, "DT": 28, "JJ": 18, "NNP": 20, ".": 24, "PRP": 42, "RP": 2, "PRP$": 17, "CC": 21, "TO": 11, "VB": 10, "NNS": 7, "VBP": 22, "VBN": 5, "EX": 1, "(": 2, ",": 11, ")": 2, "VBZ": 7, "CD": 6, "VBG": 10, "POS": 2, "WRB": 1, "JJR": 1, "MD": 1, ":": 2}, "summary_pos_tags": {"NN": 6, "NNP": 4, "CC": 3, "POS": 1, "IN": 3, "DT": 4, "JJ": 2, "VBP": 1, "RB": 1, "VBN": 1, "PRP$": 1, ".": 1}}
{"original_text": "So I've been dating a girl for about 6 months. I'm bi, and she doesn't know that. I'm more sexually attracted to men, but I have more of an emotional attraction to her. Anyway, today, we were sitting around bullshitting like we usually do. I decided I want to show her a new song that I found that I figure she would like. On iPhone, if you double tab the home button, the multitask pane pops up. Usually, when I double tap it, it goes to the music player. It didn't this time. Not paying attention, I pressed where the Play button usually is. Instead of hitting play, I bring up my Tumblr (where I have my porn). Suddenly, my screen is filled with bear (big hairy men, not the animal) cock. I panicked and closed the app and tried explaining that my friend was messing with me sending various pictures. She played it off, but I'm not sure she bought it.\n\nTL;DR: Showed my girlfriend my gay porn collection, played it off as a prank.", "tldr": " showed my girlfriend my gay porn collection, played it off as a prank.", "summary_text": "showed my girlfriend my gay porn collection, played it off as a prank. i'm not sure i'll be seeing her any time soon.", "rougescores": [{"rouge-1": {"f": 0.7222222176080247, "p": 0.5652173913043478, "r": 1.0}, "rouge-2": {"f": 0.7058823483737025, "p": 0.5454545454545454, "r": 1.0}, "rouge-l": {"f": 0.7058823483737025, "p": 0.5454545454545454, "r": 1.0}}], "compression_ratio": 0.12540192926045016, "original_pos_tags": {"RB": 13, "PRP": 29, "VBP": 12, "VBN": 3, "VBG": 8, "DT": 12, "NN": 27, "IN": 13, "CD": 1, "NNS": 4, ".": 14, "JJ": 7, ",": 14, "CC": 5, "VBZ": 5, "VB": 5, "RBR": 1, "TO": 4, "JJR": 1, "PRP$": 7, "NNP": 5, "VBD": 13, "MD": 1, "RP": 4, "WRB": 3, "(": 2, ")": 2, ":": 2}, "summary_pos_tags": {"VBN": 1, "PRP$": 3, "NN": 5, "JJ": 3, ",": 1, "VBD": 1, "PRP": 1, "RP": 1, "IN": 1, "DT": 2, ".": 2, "VB": 2, "VBP": 1, "RB": 2, "MD": 1, "VBG": 1}}
{"original_text": "so there's this girl who works at a burrito place i like.\ncool chick, we're friends, have been for a while.\nso i'm thinking i'll go here for lunch. \nshe's working, and i starting talking to her, hitting on her, cuz she's hot and i'm a guy so fuck it, why not. \nturns out, when i dated her friend a while back, and dumped her after a week (bitches be cray), she didn't like it.\nalso turns out, we aren't friends.  and she hates me.\nso she takes my burrito and throws it (sour cream, guac and all) at me from over the counter.\nbest part: she's manager, so she doesnt get in trouble.\n\nTL;DR- I hit on a lez, and had to settle for measly taco bell.", "tldr": " i hit on a lez, and had to settle for measly taco bell.", "summary_text": "hit on a girl, she threw my burrito at me because we aren't friends and she hates me, and had to settle for measly taco bell.", "rougescores": [{"rouge-1": {"f": 0.5641025596581197, "p": 0.4230769230769231, "r": 0.8461538461538461}, "rouge-2": {"f": 0.4864864821037255, "p": 0.36, "r": 0.75}, "rouge-l": {"f": 0.594594590036523, "p": 0.4583333333333333, "r": 0.8461538461538461}}], "compression_ratio": 0.19409937888198758, "original_pos_tags": {"RB": 9, "EX": 1, "VBZ": 12, "DT": 9, "NN": 22, "WP": 1, "IN": 16, "JJ": 8, ".": 10, ",": 13, "PRP": 16, "VBP": 6, "NNS": 3, "VBN": 2, "VBG": 5, "MD": 1, "VB": 4, "CC": 7, "TO": 2, "PRP$": 4, "WRB": 2, "RP": 2, "VBD": 4, "(": 2, ")": 2, "JJS": 1, ":": 2, "NNP": 2}, "summary_pos_tags": {"VBN": 1, "IN": 4, "DT": 1, "NN": 3, ",": 2, "PRP": 5, "VBD": 2, "PRP$": 1, "VBP": 1, "RB": 2, "NNS": 1, "CC": 2, "VBZ": 1, "TO": 1, "VB": 1, "JJ": 1, ".": 1}}
{"original_text": "So some fucker is dancing between a two lane road whenever a lane gets fucking clogged (and by clogged I mean he can't fucking brake and wait like a normal person), thinking he'll get to his destination 4 minutes quicker. My previous two attempts to block him from getting to my lane and stop pulling that fuckery failed, so I got a bit ballsier when he was in front of me.\n\nI decide to go into a little side lane (where cars load and unload) and decide to pass the fucker that's currently in front of me with that space. Fortunately I pass him, but unfortunately I knock a fucking mirror off the other car he was tailgating.\n\nFML.\n\nMy car got a nasty scratch and the fucker that cut me off and pissed me off got off scot free. **FUCK I WISH I COULD HAVE HIT THAT MOTHERFUCKER IF I WAS GOING TO HIT SOMEONE.**\n\nFortunately, the guy driving it was cool and only wanted $50 for the broken mirror on his car. People say that you should call insurance and police in accidents, but this wasn't a huge one, so I just paid the guy. Might not be a smart idea on my part since he could claim damages that weren't present during the accident or other fuckery, but he didn't seem like a dick (and also might not be a resident/citizen; he wasn't a high roller from the looks of his car and clothes). I got his information and got him to sign a non-formal contract saying that I paid for the mirror. \n\nAnyways, if you're reading this Juan, thanks a lot. And to the fucker in LA that pulled that shit, fuck you and your whole fucking family that raised you. I honestly wish you continue to drive like a fucking retard, so that you'll fucking die in an accident.\n\nYou fucking piece of shit.\n\nTL;DR- Had a bad day turn worse due to fucking trolling ass driver or crap. Good Guy Juan understands and we're done with it.", "tldr": " had a bad day turn worse due to fucking trolling ass driver or crap. good guy juan understands and we're done with it.", "summary_text": "knocked a mirror off a guy's car because he cut me off and got off scot free. paid him $50 for the broken mirror, but he didn't seem like a dick (and also might not be a resident/citizen; he wasn't a high roller from the looks of his car and clothes).", "rougescores": [{"rouge-1": {"f": 0.05405404976990538, "p": 0.0392156862745098, "r": 0.08695652173913043}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.06349205885613539, "p": 0.05, "r": 0.08695652173913043}}], "compression_ratio": 0.1392896781354051, "original_pos_tags": {"RB": 18, "DT": 32, "NN": 56, "VBZ": 4, "VBG": 14, "IN": 33, "CD": 5, "WRB": 3, "VBN": 3, "(": 3, "CC": 20, "PRP": 36, "VBP": 10, "MD": 6, "VB": 16, "JJ": 22, ")": 3, ",": 11, "TO": 9, "PRP$": 9, "NNS": 10, ".": 17, "WDT": 6, "VBD": 22, "NNP": 17, "RP": 3, "$": 1, ":": 2, "JJR": 1}, "summary_pos_tags": {"VBD": 6, "DT": 7, "NN": 8, "IN": 6, "POS": 1, "PRP": 5, "RP": 2, "CC": 4, "JJ": 4, ".": 2, "$": 1, "CD": 1, ",": 1, "RB": 4, "VB": 2, "(": 1, "MD": 1, ":": 1, "NNS": 2, "PRP$": 1, ")": 1}}
{"original_text": "I work as sales in a manufacturing/distributing company that sells paper and plastic products. Long story short, a distributor contacts me and is interested in spoons, requests prices, i give, and then orders. He gives me a card over email, which i should've suspected, but i didn't since it was a large amount of $$ and I'm based on commission. I try the card, and it works! We do two other transactions throughout the month, each card is under a different name and address... it all clears. Another stupid move on my part. \n\nToday I am told the company that i've been working with is a fraud company, all the credit cards i've been using were stolen, and all the products are gone. Thankfully the last shipment we sent out was a local storage warehouse and we claimed about 8k back.. but still. PRETTY SHITTY. Atleast now i know I probably won't lose my job.\n\nTLDR: Accidently charged stolen credit cards up to $28k and shipped out products that are now gone. ", "tldr": " accidently charged stolen credit cards up to $28k and shipped out products that are now gone. ", "summary_text": "accidentally charged stolen credit cards up to $28k and shipped out products that are now gone. probably not going to lose my job.. at least now i know i probably won't.", "rougescores": [{"rouge-1": {"f": 0.6249999954253472, "p": 0.4838709677419355, "r": 0.8823529411764706}, "rouge-2": {"f": 0.6086956476370511, "p": 0.4666666666666667, "r": 0.875}, "rouge-l": {"f": 0.6818181770764464, "p": 0.5555555555555556, "r": 0.8823529411764706}}], "compression_ratio": 0.17567567567567569, "original_pos_tags": {"PRP": 14, "VBP": 16, "IN": 13, "NNS": 14, "DT": 16, "NN": 28, "WDT": 4, "VBZ": 6, "CC": 11, ".": 11, "NNP": 4, "RB": 11, ",": 10, "JJ": 8, "MD": 2, "VBN": 9, "VBD": 8, "$": 3, "CD": 3, ":": 2, "PRP$": 2, "VBG": 2, "PDT": 2, "RP": 2, "VB": 1, "TO": 1}, "summary_pos_tags": {"RB": 7, "VBN": 3, "NN": 3, "NNS": 2, "IN": 2, "TO": 2, "$": 1, "CD": 1, "CC": 1, "VBD": 1, "RP": 1, "WDT": 1, "VBP": 3, ".": 2, "VBG": 1, "VB": 1, "PRP$": 1, "JJS": 1, "MD": 1}}
{"original_text": "Nothing too exciting with this TIFU. I already submitted my university applications earlier and theres pressure on my parents to attend university because it's more prestigious and the odds of me getting a career post grad is higher than college, I also think it's part of their own benefit. But I wanted to apply to both because theres a prestigious animation program at a college 1 city away from here where many of pixar, disney and other industry giants employees are recruited from. It's a dream of mine to be an animator and definitely a pixar animator, but I knew my drawing skills were not up to par, but I thought it would be worth the application anyways. The only thing holding me back was the 95$ fee to apply. I tried to pay for it myself because I knew i'd have no support from my parents - but my card was declined each time I tried and my mom said I should \"think about it more before I apply\" all while speaking in a saddened/angered tone. I hadn't even asked my dad because I knew what his reaction would be. This was yesterday, lone behold today I log in to the college site and one of my program choices is gone, animation, the application queue for the program is full and they're not accepting anymore. Should have just manned up and stood up for myself. Instead now I have to wait another year to apply - while i'm a freshman in uni.\n\nTL;DR - I delayed applying to college because I knew i'd have no parental support and I couldn't apply because my card kept being bounced back and declined. Now the application deadline has passed.", "tldr": " i delayed applying to college because i knew i'd have no parental support and i couldn't apply because my card kept being bounced back and declined. now the application deadline has passed.", "summary_text": "i delayed applying to college because i knew i'd have no parental support and i couldn't apply because my card kept being bounced back and declined.", "rougescores": [{"rouge-1": {"f": 0.8965517191914388, "p": 1.0, "r": 0.8125}, "rouge-2": {"f": 0.8928571379145408, "p": 1.0, "r": 0.8064516129032258}, "rouge-l": {"f": 0.8799999950720001, "p": 1.0, "r": 0.7857142857142857}}], "compression_ratio": 0.09517684887459807, "original_pos_tags": {"VBG": 9, "RB": 19, "IN": 29, "DT": 24, "NNP": 3, ".": 12, "PRP": 28, "VBD": 20, "PRP$": 11, "NN": 49, "NNS": 8, "RBR": 3, "CC": 14, "VBZ": 10, "TO": 11, "VB": 15, "JJ": 13, "JJR": 1, ",": 7, "VBP": 7, "CD": 3, "WRB": 1, "VBN": 6, "MD": 7, "$": 1, ":": 4, "``": 1, "''": 1, "WP": 1, "RP": 2}, "summary_pos_tags": {"JJ": 4, "VBD": 4, "VBG": 2, "TO": 1, "NN": 4, "IN": 2, "MD": 2, "VB": 2, "DT": 1, "CC": 2, "RB": 2, "PRP$": 1, "VBN": 1, ".": 1}}
{"original_text": "This bar I have been going to has my little sisters friends sister bar tending there and this past sunday I said one the dumbest things. I had asked if her sister was single and whatnot, I pretty much just asked that in general because I thought my sister and hers where not friends anymore, I tried to say my bad and apologize but it was busy. Though as I left she said in a joking way from what I could tell that she was going to tell her. I know it's not that bad sounding to most but I don't let stupid thoughts like that get out, I normally dismiss them and now I feel like the creepy guy. \n\nTLDR; Asked about younger sisters friend to her older sister out of stupidity and I now feel like the creepy guy even though I believe she was giving me grief about telling her after I apologized.", "tldr": " asked about younger sisters friend to her older sister out of stupidity and i now feel like the creepy guy even though i believe she was giving me grief about telling her after i apologized.", "summary_text": "asked about younger sisters friend to her older sister out of stupidity and now i feel like the creepy guy and feel like she was giving me grief about telling her.", "rougescores": [{"rouge-1": {"f": 0.8484848435032142, "p": 0.9032258064516129, "r": 0.8}, "rouge-2": {"f": 0.7187499950195313, "p": 0.7666666666666667, "r": 0.6764705882352942}, "rouge-l": {"f": 0.8771929774946138, "p": 0.9615384615384616, "r": 0.8064516129032258}}], "compression_ratio": 0.2055485498108449, "original_pos_tags": {"DT": 7, "NN": 13, "PRP": 23, "VBP": 9, "VBN": 4, "VBG": 5, "TO": 5, "VBZ": 3, "PRP$": 6, "JJ": 13, "NNS": 5, "RB": 11, "CC": 8, "VBD": 11, "CD": 1, "JJS": 2, ".": 5, "IN": 19, ",": 3, "WRB": 1, "VB": 6, "WP": 1, "MD": 1, "RP": 1, "NNP": 1, ":": 1, "JJR": 2}, "summary_pos_tags": {"VBN": 1, "IN": 6, "JJR": 2, "NNS": 1, "VBP": 3, "TO": 1, "PRP$": 2, "NN": 5, "CC": 2, "RB": 1, "DT": 1, "PRP": 2, "VBD": 1, "VBG": 2, "JJ": 1, ".": 1}}
{"original_text": "This actually happened yesterday.\n\nI have a tendency to get really, really bored at work - because we have long periods of downtime. To keep myself awake I try to make myself physically uncomfortable. On my way in yesterday morning, I knew I had to drop a deuce, so I figured I'd hold it til after work to get me through the day.\n\nIt didn't help. About 10am, I'm staring at the clock waiting for my next task to be ready. A minute later my boss nudges my arm and tells me to go home and get some sleep - I had fallen asleep watching the clock.\n\nSo on the drive home, I'm annoyed at myself. I decide to stop by my parents house to pick up some CAT6 I had left over there. As I pull off the highway I start coughing. The cough takes me hard (I'm recovering from a chest cold still) and I feel my asshole pinch for a minute, and an uncomfortable lump under me...I had coughed loose a small bit of dookie.\n\nGet to my parents and immediately bolt to the washroom. Sure enough, little globules of crap clung to my underwear. \n\nSo Reddit, yesterday I fucked up.\n\n**TL;DR:** Yesterday, I held in my crap to stay awake, it didn't work, and after getting sent home from work I crapped myself in the car.", "tldr": " yesterday, i held in my crap to stay awake, it didn't work, and after getting sent home from work i crapped myself in the car.", "summary_text": "held in my deuce to stay awake, it didn't work, and after getting sent home from work, i crapped myself in the car.", "rougescores": [{"rouge-1": {"f": 0.8749999950086805, "p": 0.9130434782608695, "r": 0.84}, "rouge-2": {"f": 0.7826086906616257, "p": 0.8181818181818182, "r": 0.75}, "rouge-l": {"f": 0.9090909041012396, "p": 0.9523809523809523, "r": 0.8695652173913043}}], "compression_ratio": 0.09639564124056998, "original_pos_tags": {"DT": 18, "RB": 16, "VBN": 6, "NN": 40, ".": 15, "PRP": 31, "VBP": 10, "TO": 13, "VB": 17, ",": 11, "IN": 25, ":": 5, "JJ": 12, "NNS": 6, "PRP$": 9, "VBD": 12, "MD": 1, "RP": 4, "CD": 1, "VBG": 6, "CC": 6, "NNP": 3, "VBZ": 1, "(": 1, ")": 1}, "summary_pos_tags": {"VBN": 1, "IN": 4, "PRP$": 1, "NN": 4, "TO": 1, "VB": 3, "RB": 2, ",": 3, "PRP": 2, "VBD": 3, "CC": 1, "VBG": 1, "DT": 1, ".": 1}}
{"original_text": "First all, for those of you that don't know what headsooth is, it is a chapstick like device which you apply to your forehead when you have a headache, it gives a deep cold/burning sensation which isn't pleasant and the best of times.\n \nSo there we were, pre-drinking before a night out, having a right old laugh ect. When my mate pipes up to my other mate \"Hey man, I dare you to put headsooth on your dick\" which he understandably refused. Then an intoxicated me chirps in, \"I'll do it if you do\". The alcohol takes over and he agrees, putting the headsooth down his jeans. He then throws it to me, and as not one to back down from an agreement, I lathered that shit on. Really pasted it. I finish and give it to the original 'darer', who is curious and gives it a go. \n\nNext thing I know, the first guy screams 'FUCK THAT' and runs upstairs.. No longer than 20 seconds later the slight tingling in my balls turned to a furious burning sensation, to which I ran upstairs in agony. I run to the nearest sink and pull out my manhood, and what do I see? My balls, shining like a beacon, red as a London bus. I hear a scream from downstairs, and the last guy runs upstairs screaming. So there we are, three guys, luckily with three sinks in separate rooms, washing our balls. The pain was unbearable, I thought I was going to pass out. It was a hybrid of burning/aching/stinging in the most sensitive of areas. I felt like I needed to piss, shit and just die all at once. So I walk out into the hall, the water on my balls doing nothing, and keel over half screaming and half laughing at the other two's screams. They're vigorously washing their balls and having as much luck as I am.\n\nNext thing I know my girlfriend and another mate come up stairs, he briskly takes a snapshot of my firey balls and decides to send them via whatsapp to everyone we know. I couldn't close my legs for a good hour after that.\n\nTL;DR Put headsooth on balls, searing pain followed\n\nEdit: Here's my balls http://i.imgur.com/IsvYBcM. NSFW, obviously. It's my fucking balls.", "tldr": " put headsooth on balls, searing pain followed", "summary_text": "put headsooth on my balls, burning sensation followed, had to wash my balls with water, sent them to everyone we know, couldn't close my legs for a good hour.", "rougescores": [{"rouge-1": {"f": 0.2222222190895062, "p": 0.13793103448275862, "r": 0.5714285714285714}, "rouge-2": {"f": 0.11764705591695508, "p": 0.07142857142857142, "r": 0.3333333333333333}, "rouge-l": {"f": 0.24242423908172642, "p": 0.15384615384615385, "r": 0.5714285714285714}}], "compression_ratio": 0.07707317073170732, "original_pos_tags": {"RB": 23, "DT": 35, ",": 27, "IN": 38, "PRP": 42, "WDT": 5, "VBP": 17, "VB": 14, "WP": 3, "VBZ": 14, "NN": 53, "TO": 13, "PRP$": 15, "WRB": 2, "JJ": 26, "CC": 15, "JJS": 2, "NNS": 22, ".": 23, "VBD": 13, "RP": 6, "VBG": 10, "``": 2, "NNP": 10, "''": 2, "VBN": 2, "MD": 2, "CD": 5, "POS": 4, "JJR": 1, "EX": 1, "RBS": 1, ":": 3}, "summary_pos_tags": {"VB": 3, "NN": 6, "IN": 3, "PRP$": 3, "NNS": 2, ",": 4, "VBG": 1, "VBD": 3, "TO": 2, "PRP": 2, "VBP": 1, "MD": 1, "RB": 1, "DT": 1, "JJ": 1, ".": 1}}
{"original_text": "Granted, this f-up is not too bad compared to many of the others here, but it is bad in my life. It actually occurred last Thursday. My first class had been canceled, and I was running late for my other class. We were having a test in that class, so I wanted to get there on time. Best way? to drive fast. Keep in mind, I drive a 97 ford with a little 4 cylinder engine. POS, alright. I manage to get that thing to almost 50 MPH in about a block and a half. didn't see the cop just off the road. Then, to top it off, I didn't have current insurance cards. Did I mention that it was a 25 mph zone? Good news is, only got 195 for 20 over. took my word on the insurance problem..\n\nTL;DR- my car accelerated the best it ever has, next to a cop, while late...\n\nalso, don't hate too hard, first post on Reddit...", "tldr": " my car accelerated the best it ever has, next to a cop, while late...", "summary_text": "my car accelerated the best it ever has, next to a cop, while late for a test, and didn't have current insurance. also, don't hate too hard, first post on reddit...", "rougescores": [{"rouge-1": {"f": 0.6222222179358025, "p": 0.45161290322580644, "r": 1.0}, "rouge-2": {"f": 0.6046511585722013, "p": 0.43333333333333335, "r": 1.0}, "rouge-l": {"f": 0.6363636320247934, "p": 0.4666666666666667, "r": 1.0}}], "compression_ratio": 0.20347394540942929, "original_pos_tags": {"VBN": 4, ",": 13, "DT": 14, "NN": 29, "VBZ": 4, "RB": 17, "JJ": 13, "TO": 7, "IN": 18, "NNS": 2, "CC": 3, "PRP": 12, "PRP$": 5, ".": 13, "VBD": 11, "NNP": 6, "VBG": 2, "VB": 8, "JJS": 2, "VBP": 4, "CD": 6, "RP": 1, ":": 3}, "summary_pos_tags": {"PRP$": 1, "NN": 6, "VBD": 2, "DT": 3, "JJS": 1, "PRP": 1, "RB": 5, "VBZ": 1, ",": 5, "JJ": 5, "TO": 1, "IN": 3, "CC": 1, "VB": 2, ".": 1, "VBP": 1, ":": 1}}
{"original_text": "It's been a couple weeks since I'd been to the gym. I got sick, I started a new job, life was generally being shitty and in the way. After some gentle encouragement from my girlfriend, I agreed that I really did need to get back on it and go back to working out.\n\nCue yesterday, first day back to the gym. I had lost my old lock but I had the one from my locker at my last job so I just brought that with me. I show up, get changed, and work out.\n\nWhen I get done with my workout, I go back in the locker room, grab my soap, a towel, and underwear, lock my locker and go shower.\n\nI finished my shower, walked out and up to my locker, and my heart sank. You can probably imagine why.\n\nMy old lock was a combination lock. The one from my locker at work was a key lock. My keys were inside my locker.\n\nThere I stood, wet, cold, and in my boxers, staring at my locker and the empty locker room and contemplating my next move.\n\nAfter a few minutes alone in the locker room, I realized nobody else was going to be able to help me (because nobody else was in there), so I braved the journey from the locker room to the front desk.\n\nHere's where it gets worse -- the entire gym is one big room, with mirrors around the perimeter. If you're in the gym, people can see you. It was late, but not late enough that the gym was empty.\n\nAs an added bonus, the men's locker room is the room second furthest away from the front desk.\n\nOh, and I should also mention that I am quite an, **ahem** *portly*, individual.\n\nSo I walked up to the front desk, damp and in my underwear, and faced the (unfortunately) female front desk attendant. As if my luck wasn't bad enough, now somebody from the other gender was the one I had to ask for help, in front of god and everybody, in my underwear.\n\nMuch to my relief, the gym has a set of bolt cutters which she lent to me so I could go get my locker open. I trekked across the gym, now looking more ridiculous than before, in my underwear, holding a bolt cutter.\n\nI made it back to my locker, cut the lock, got dressed and walked back up. I returned the bolt cutter and made it a priority to get the fuck outta there as fast as I could. Hopefully nobody that's in there tonight was there last night, but chances are I won't get so lucky.\n\n\ntl;dr: **I locked my keys in my locker, including the key for my lock. I then had to walk my fat ass up to the front desk, in my underwear, and ask the female front desk attendant for the bolt cutters so I could get my clothes, keys and everything else out.**", "tldr": " **i locked my keys in my locker, including the key for my lock. i then had to walk my fat ass up to the front desk, in my underwear, and ask the female front desk attendant for the bolt cutters so i could get my clothes, keys and everything else out.**", "summary_text": "went to the gym for the first time in a couple weeks, locked myself out of my locker and had to walk across the gym in my underwear to get it open.", "rougescores": [{"rouge-1": {"f": 0.3809523762358277, "p": 0.5, "r": 0.3076923076923077}, "rouge-2": {"f": 0.12195121480963729, "p": 0.16129032258064516, "r": 0.09803921568627451}, "rouge-l": {"f": 0.1612903177679502, "p": 0.2, "r": 0.13513513513513514}}], "compression_ratio": 0.05828707375099128, "original_pos_tags": {"PRP": 40, "VBZ": 7, "VBN": 7, "DT": 43, "NN": 107, "NNS": 13, "IN": 51, "MD": 8, "TO": 16, ".": 28, "VBD": 35, "JJ": 34, ",": 42, "RB": 41, "VBG": 8, "CC": 21, "PRP$": 30, "VB": 21, "RP": 4, "NNP": 2, "CD": 3, "VBP": 6, "WRB": 3, "EX": 3, "(": 2, ")": 2, "JJR": 1, ":": 3, "POS": 1, "JJS": 1, "UH": 1, "WDT": 2, "RBR": 1}, "summary_pos_tags": {"VBD": 3, "TO": 3, "DT": 4, "NN": 5, "IN": 6, "JJ": 3, "NNS": 1, ",": 1, "PRP": 2, "PRP$": 2, "CC": 1, "VB": 2, ".": 1}}
{"original_text": "I did some nude photography/modeling a few years back, and while I love the pieces I did and do not regret them in the slightest, I don't particularly want seeing my friends, especially male friends, seeing me nude, mostly because I have *body issues* like every other woman it seems.\n\nI was browsing reddit, and noticed a familiar photo. It was an old photo of me that someone had posted to GoneWildPlus, with another photo in the comments. I was surprised to see it and was having some feels about it. I was in chat with several people at once, bouncing between several different conversations, one of them being a good friend who I sent the link to the guys profile (but not the post itself), because she had something similar happen to her. However, when I was sending the link, I popped not into her box, but a box right next to her. A box with my male friend.\n\nI immediately noticed my mistake, and though it wasn't a link to the direct post, I know that photo was only one click away, and it was the newest post. I profusely apologized and told him to please not open it. He conceded, and told me he even cleared the chat log so he wouldn't be tempted to open it. He also told me to thank my lucky stars that I must be special because he wouldn't ordinarily do that. And before you naysayers come in and say he did look at him, trust me, if he had he would have made some sort of \"nice tits\" joke.\n\nTL;DR almost sent a link containing a link of old nude photos to my friend, but he was a good buddy and didn't look. ", "tldr": " almost sent a link containing a link of old nude photos to my friend, but he was a good buddy and didn't look. ", "summary_text": "sent a link containing a link of old nude photos to my friend, but he was a good buddy and didn't look, and it was the newest post.", "rougescores": [{"rouge-1": {"f": 0.8076923027218935, "p": 0.75, "r": 0.875}, "rouge-2": {"f": 0.799999995032, "p": 0.7407407407407407, "r": 0.8695652173913043}, "rouge-l": {"f": 0.8181818131921489, "p": 0.782608695652174, "r": 0.8571428571428571}}], "compression_ratio": 0.08601444517399869, "original_pos_tags": {"PRP": 44, "VBD": 28, "DT": 26, "NN": 34, "VBG": 9, "JJ": 19, "NNS": 12, "RB": 24, ",": 20, "CC": 14, "IN": 27, "VBP": 5, "VB": 17, "JJS": 2, "PRP$": 8, "VBN": 6, "VBZ": 2, ".": 13, "TO": 10, "NNP": 3, "CD": 2, "WP": 1, "(": 1, ")": 1, "WRB": 1, "MD": 4, "``": 1, "''": 1, ":": 1}, "summary_pos_tags": {"VBD": 4, "DT": 4, "NN": 6, "VBG": 1, "IN": 1, "JJ": 3, "TO": 1, "PRP$": 1, ",": 2, "CC": 3, "PRP": 2, "RB": 1, "VB": 1, "JJS": 1, ".": 1}}
{"original_text": "Throwaway for obvious reasons, but I thought you guys might find more humor in what happened to me than I do.\n\n\n\nToday I've been feeling particularly horny. I think it's a combination of PMS (which makes me want to have a dick inside me in the worst way), and just thinking about the incredible sex I had this past weekend. \n\n\n\nWell, my boss was in a meeting all day today so I let the horny-ness get the best of me. I pulled up pictures of my boyfriend's dong and I knew I just had to slip my pants down to mid-thigh level and get to it.\n\n\n\nI was really close to coming when I heard someone start walking up the stairs but I figured, fuck it, it *can't* be my boss..he's down in the meeting room all day! It has to be someone else going to their office. At that moment, I heard the door to my office open. Fuuuuuck.\n\n\n\nI quickly pulled my pants up, but he walked around the corner in time to see me doing some buttoning up. Having been so close to orgasm, just the seam of the pants touching there made me come. As he's trying to talk to me acting like he didn't know what I had been doing.\n\n\n\nAs I tried my darndest to *not* show any signs of orgasm-occurence, I couldn't help my voice trembling. I could feel the flush color of my cheeks as well. But worst of all, I could see my boss getting a boner. My 68-year old boss turned on by my masturbation/orgasm. He then went into the bathroom for a few minutes, and we haven't exchanged words since the incident.\n\n\n\nHello Monday. This will be an awesomely awkward week at work.\n\n\n\ntl;dr: Boss walked in, I orgasmed, he got hard. Pretty sure he fapped too.", "tldr": " boss walked in, i orgasmed, he got hard. pretty sure he fapped too.", "summary_text": "masturbated at work, boss walked in, i orgasm, he got a boner, we haven't spoken in a few days.", "rougescores": [{"rouge-1": {"f": 0.37499999517578125, "p": 0.3157894736842105, "r": 0.46153846153846156}, "rouge-2": {"f": 0.2666666618666667, "p": 0.2222222222222222, "r": 0.3333333333333333}, "rouge-l": {"f": 0.39999999520000007, "p": 0.3333333333333333, "r": 0.5}}], "compression_ratio": 0.059190031152647975, "original_pos_tags": {"NNP": 7, "IN": 29, "JJ": 14, "NNS": 10, ",": 13, "CC": 8, "PRP": 40, "VBD": 23, "MD": 5, "VB": 19, "JJR": 1, "NN": 44, "WP": 2, "TO": 14, "VBP": 5, ".": 21, "VBN": 5, "VBG": 14, "RB": 20, "VBZ": 4, "DT": 27, "(": 1, "WDT": 1, "JJS": 3, ")": 1, "UH": 1, "PRP$": 13, "RP": 5, "POS": 2, "WRB": 1, ":": 2}, "summary_pos_tags": {"VBN": 2, "IN": 3, "NN": 4, ",": 4, "VBD": 2, "JJ": 2, "PRP": 2, "DT": 2, "VBP": 1, "RB": 1, "NNS": 1, ".": 1}}
{"original_text": "this will ^hopefully be the most disgusting, embarrassing thing that I will ever post. \n\nMy mother in-law just got new , expensive chairs before the family visits for the holidays^You ^already  ^know ^where ^this ^is ^going\nSo my entire family is sitting around the house, and I am feeling 100% ok. I just put on some new sheer stockings and a long sweater that looks really cute. and I am sitting in one of the new chairs when I feel a little sture of nature encroaching upon my stink wrinkles. I think, \"ok cool, done this a million times, just push it up and let it out easy and no harm done\" \n\nbut oh no, **ohhhh no**\n\nInstead of the dainty lady like poot I was expecting. I got a eruption that came forth from the debts of hell that was released into the world. The entire room fell completely and utterly quite as the loudest noise came from my anus, followed by a river of soupy shit. \nthere was no hiding this .\n\nThe chair was white. \n\nMy sweter was white. \n\nIt was running down to the floor. \n\nand the smell could knock out a god damn moose.\n\nThey all are just looking at me, wide eyed and unmoving. they were like petrified stone . I was in complete shock as I tried to process what just happened. then it happened again. \n\nBut this time, it came along with vomit. \n\nNow despite all this, my family are very kind and understanding. My mother in law and my husband ran to me to help me , breaking from their state of horror and the rest of my family kind of left or did something to make it a little less embarrassing , but the damage is done.  I am just in my room, in my pajamas, scared to ever fart again...\n\nand a 900$ chair is to NEVER be seen again. \n\nTLDR; A river of the most ~~vial~~ **vile** shit you will ever witness erupted from me in front of my entire family. \n ", "tldr": " a river of the most ~~vial~~ **vile** shit you will ever witness erupted from me in front of my entire family. ", "summary_text": "i farted in front of my entire family and it was the most vial **vile** shit you will ever witness. and a 900$ chair is to never be seen again.", "rougescores": [{"rouge-1": {"f": 0.5769230720414202, "p": 0.5, "r": 0.6818181818181818}, "rouge-2": {"f": 0.43999999512800003, "p": 0.3793103448275862, "r": 0.5238095238095238}, "rouge-l": {"f": 0.399999995128, "p": 0.3448275862068966, "r": 0.47619047619047616}}], "compression_ratio": 0.08006718924972005, "original_pos_tags": {"DT": 34, "MD": 4, "RB": 26, "VB": 10, "RBS": 2, "JJ": 24, ",": 15, "VBG": 11, "NN": 62, "IN": 36, "PRP": 24, ".": 21, "PRP$": 13, "VBD": 21, "NNS": 7, "NNP": 7, "VBZ": 5, "CC": 16, "VBP": 8, "CD": 4, "WDT": 3, "WRB": 1, "``": 1, "VBN": 7, "RP": 2, "''": 1, "JJS": 1, "EX": 1, "TO": 7, "WP": 1, "PDT": 1, "RBR": 1, ":": 2, "$": 1}, "summary_pos_tags": {"NN": 6, "VBN": 2, "IN": 2, "PRP$": 1, "JJ": 2, "CC": 2, "PRP": 2, "VBD": 1, "DT": 2, "RBS": 1, "MD": 1, "RB": 3, "VB": 2, ".": 2, "CD": 1, "$": 1, "VBZ": 1, "TO": 1}}
{"original_text": "This is going to start like most of these with a \"this wasn't today but whatever\". Just shut up, y'all want to here a good story. So, me and my two best mates are out in Zante. First ever lads holiday. If you've seen the Inbetweeners film, that was roughly our expectations. And it delivered. \n\nSo I had never been sick from alcohol until the first night. Zante changed that. Apologies to Megan, our rep, who received the blessing of my first ever tactical chunder. That's what you get when we arrive at 8:00 and we have dropped the bags and in a huge group on the way to the strip at 8:02. So yeah, shit had gone down, one mate nailed the grimmest effort of a girl in our whole resort and we carried on. \n\nFast forward to the third night, this is where I really fucked up. We waited fairly late to go out, plenty of predrinks, best digs on and ready for whatever the fuck that night would bring us. So we went slightly mad, laughing gas, headfuckers and erect nipples went down and down for a while. We followed the reps group and ended up in a bar/ club thing. At this point I was on the verge between loving it and cresting the peak. My confidence was huge, my banter and charm (I thought) was top notch and was chatting up some skirt. Then my boys came over and told me that they entered my fucked ass in one of the drinking games. And, in case you have never been on this type of holiday before, that's code for torture involving alcohol. \n\nSo it's me versus this girl, and I'm genuinely struggling to comprehend the instructions from the rep over the huge PA system in the club, but there is a load of drinks on a tray to the side and a barstool in front of me. That's what a state I was already.  I knew this was bad. So the idea was (from my memory), shot of vodka 10 spins around the bar stool, 10 push ups, 10 star jumps and there was 4 shots. Then the same thing but with a pint (!) of sex on the beach. Shit son. Did this in a completely retarded fashion, then we had to find 10 members of the opposite sex to kiss and run back. Done. Some of the girls even volunteered, but most, I sort of just grabbed their face. Then another shot of vod and one last excersize round. Whoah nelly. \n\nAs we got to the final big club where a DJ was playing, I was totally hating it. Felt just awful, could not control myself and I wanted out of this drunken stupor. My buddies paid for me to go to the VIP lounge so I could sit down. Sat down for maybe one or two minutes. Could not handle it. The music, the room spin, Jesus this is awful. Ran outside. Projectile paint job on a car parked outside the club. Sat on the curb and vomited some more all over myself and the car. Passed out. Loads of people tyres to wake me up, apparently. Would not move. I went to a place then that I never want to go to again. If I had a gun, I would have shot myself immediately. And I'm very much not suicidal. I wanted out. I wanted to die if it stopped my being this goddamn drunk. Wanted to cry. Saw an ambulance pulling up. Got in. \n\nWoke up in the middle of the night on a drip, doctors and nurses standing around me. Was on a drip. Went back to sleep just to get out of this nightmare. I could not face reality. \n\nWoke up the next morning, no headache and far more sober, still with the drip attached. Found my way to the hospital toilet, trailing the drip behind. Found something else down there too (reset the counter everyone). Yup. Had done that overnight at some point. At this point I was just greatfull to be alive and not drunk. \n\nTo shorten this part up, I chatted to the nurses and they basically said I owed about €500. As luck would have it I paid for travel insurance and the nurses said that we would agree to say I just had a stomach bug from the water, otherwise if there is alcohol involved they won't pay.  \n\nThis ended with me banging on the door of my bros hotel room. Tears of joy in their eyes, all I could say was, \"I need travel insurance, hotel documents and out flight ticket home\". Those words are now legend amongst us. \n\nThat's my tale. Sorry if I wrote it like shit of if it was boring. It was one of the worst moments of my life, no actually THE worst (I have had a lucky life so far in terms of relatives passing etc). And if someone can get a laugh out of it and/or learn from it, then it wasn't such a waste of time. \n\nTLDR: I don't blame you, that was one hell of a wall of text. Got so fucked up on first ever lads holiday, ended up in the hospital on a drip. And in Zante, there's not NHS like here in Blighty. £££", "tldr": " i don't blame you, that was one hell of a wall of text. got so fucked up on first ever lads holiday, ended up in the hospital on a drip. and in zante, there's not nhs like here in blighty. £££", "summary_text": "went to a lads holiday for the first time, got sick from alcohol for the first time, played a drinking game with my mates and had to have sex with 10 girls on the beach.", "rougescores": [{"rouge-1": {"f": 0.21052631082063722, "p": 0.22857142857142856, "r": 0.1951219512195122}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.12903225314776293, "p": 0.14814814814814814, "r": 0.11428571428571428}}], "compression_ratio": 0.0372410753635963, "original_pos_tags": {"DT": 101, "VBZ": 14, "VBG": 16, "TO": 26, "VB": 32, "IN": 114, "JJS": 7, "``": 2, "VBD": 61, "RB": 73, "NN": 146, "CC": 36, "WDT": 4, "''": 2, ".": 73, "NNP": 31, "RP": 15, ",": 43, "VBP": 16, "JJ": 34, "PRP": 71, "PRP$": 18, "CD": 15, "NNS": 36, "VBN": 14, "WP": 4, "WRB": 3, "MD": 12, "(": 5, ")": 5, "EX": 4, "$": 1, "RBR": 1, "JJR": 1, ":": 1}, "summary_pos_tags": {"VBD": 4, "TO": 2, "DT": 5, "NNS": 3, "NN": 8, "IN": 6, "JJ": 3, ",": 2, "PRP$": 1, "CC": 1, "VB": 1, "CD": 1, ".": 1}}
{"original_text": "So today I had two exam finals and, I believed, a paper final due tomorrow. Then I would be done or, so I thought. I had recently passed a macroeconomics course I had failed the last semester so I thought everything was golden. \n\nToday I drag myself out of bed after studying all night for my 7:30am final, go home, study some more for my 1:30pm final and head off to class. I get to my 1:30pm final and begin talking to the guy who sits next to me...who just happens to be in my class with the paper final I thought was due tomorrow. \n\nSome friends of mine come in and as we're talking I let it slip I have a paper I need to write for tomorrow. The guy I was talking to before interjects and with a look of pity informs me that our paper final was due today. I immidately panic and type out an email to my professor in hopes he takes pity on me. \n\nTh problem is, I've had him for two other classes and the one time he will not take a late paper is the final exam. So, I effectively have failed a class with my favorite professor. Also, I am part of a new sorority forming on campus but my gpa for the semester has to be over a 2.0. \n\nTL;DR\nI passed a course I failed last semester, thought I was going to do well for the rest of finals. I missed the deadline for a final paper. Now I'm going to fail this class and not get initiated into the first year of sisters for a new sorority on campus. \n\nEdit: I also almost got hit by a car twice today. \n\nUpdate:\nMy professor answered the very apologetic email with a \"These things happen. Have a good break!\" Which pretty much means that I'm in trouble with my grade now. I have got all my other class grades reported except him. I'm just waiting for the damage but I've already accepted the worst. ", "tldr": "i passed a course i failed last semester, thought i was going to do well for the rest of finals. i missed the deadline for a final paper. now i'm going to fail this class and not get initiated into the first year of sisters for a new sorority on campus. ", "summary_text": "thought a paper final was due tomorrow, missed the deadline and failed a class with my favorite professor. now i'm going to fail this class and not get initiated into the first year of sisters for a new sorority on campus.", "rougescores": [{"rouge-1": {"f": 0.709677414424789, "p": 0.8048780487804879, "r": 0.6346153846153846}, "rouge-2": {"f": 0.5274725225455864, "p": 0.6, "r": 0.47058823529411764}, "rouge-l": {"f": 0.7105263108033243, "p": 0.75, "r": 0.675}}], "compression_ratio": 0.12729357798165136, "original_pos_tags": {"RB": 21, "NN": 58, "PRP": 38, "VBD": 21, "CD": 6, "JJ": 27, "NNS": 11, "CC": 11, ",": 9, "DT": 34, ".": 20, "MD": 2, "VB": 12, "VBN": 9, "IN": 40, "VBP": 16, "VBG": 8, "PRP$": 11, "RBR": 1, "TO": 11, "WP": 2, "VBZ": 7, ":": 4, "RP": 1, "NNP": 4, "``": 1, "''": 1, "JJS": 1}, "summary_pos_tags": {"VBN": 2, "DT": 6, "NN": 9, "JJ": 6, "VBD": 3, ",": 1, "CC": 2, "IN": 5, "PRP$": 1, ".": 2, "RB": 2, "VBP": 1, "VBG": 1, "TO": 1, "VB": 2, "NNS": 1}}
{"original_text": "This actually happened a while ago, but so did everything else on this sub. This fuck up happened whilst I was still in highschool. I lived very far away from my highschool, so during my senior year I lived with my grandmother to save money on petrol. As you can imagine, my grandmother is not an avid user of the Internet, but I am. I implored her to change to a shaped plan. A shaped plan is where instead of charging you extra when you go over your data allowance, they slow your throughput with no further charges.\n\nShe refused, because technology is scary. If she had just taken my advice, I wouldn't be writing this post. Highschool was a very frustrating time for me; I grew hair where there was no hair before, and I felt the urges that all teenage boys feel. My room had a computer in it, and I consistently went over our data allowance with pornography every single month that I lived with my grandmother. Since the allowance was so restrictive, I chose to download and store all of the porn videos locally for later use, in a single folder called something along the lines of \"Biology Homework,\" because teenagers like to think that they're clever when they're really not. I even cleared the browser history, because obviously I did.\n\nFrustrated, (but in a different, angrier way) my grandmother called her ISP to dispute a huge bill that my penis had accrued (*.. Ladies*). The ISP emailed her my download history, which included a lot of visits to various tube-porn sites. My grandmother, not fully understanding that her 'download limit' encompasses page views as well as downloaded files, decided to search through all of my folders, and yes, she found lots and lots of my dirty, **dirty** porn.\n\nNow, my grandmother isn't stupid. Obviously a teenage boy is going to look at Internet porn. She opened one of the aforementioned locally stored videos. She was not prepared for what she saw. My grandmother was married at 19, so she hasn't exactly been around the block. What she saw was in an entirely different suburb. When I got home from school she confronted me. I owned up to everything, because I didn't think that it was that big of a deal, but I moved back home anyway because my grandmother couldn't deal with the monetary cost of my habits.\n\n**TL;DR I watched so much porn whilst living with my grandmother that she kicked me out. Also she found my porn-stash and was disgusted.**", "tldr": " i watched so much porn whilst living with my grandmother that she kicked me out. also she found my porn-stash and was disgusted.**", "summary_text": "i watched so much porn whilst living with my grandmother that she kicked me out, because she couldn't deal with the monetary cost of my habits.", "rougescores": [{"rouge-1": {"f": 0.6399999950080001, "p": 0.6153846153846154, "r": 0.6666666666666666}, "rouge-2": {"f": 0.5416666616753474, "p": 0.52, "r": 0.5652173913043478}, "rouge-l": {"f": 0.6222222172246915, "p": 0.6086956521739131, "r": 0.6363636363636364}}], "compression_ratio": 0.059508947149396585, "original_pos_tags": {"DT": 33, "RB": 39, "VBD": 43, "NN": 68, ",": 25, "CC": 10, "IN": 55, ".": 25, "RP": 3, "JJ": 26, "PRP": 42, "PRP$": 24, "TO": 10, "VB": 13, "MD": 3, "VBZ": 7, "NNP": 11, "VBP": 7, "WRB": 5, "VBG": 4, "NNS": 16, "VBN": 9, ":": 2, "EX": 1, "JJR": 1, "``": 1, "''": 1, "(": 2, ")": 2, "WDT": 1, "POS": 1, "UH": 1, "CD": 2, "WP": 2}, "summary_pos_tags": {"NN": 6, "VBD": 2, "RB": 2, "JJ": 2, "IN": 5, "PRP$": 2, "PRP": 3, "RP": 1, ",": 1, "MD": 1, "VB": 1, "DT": 1, "NNS": 1, ".": 1}}
{"original_text": "This didn't happen today, but I need to tell the world.  Here's the backstory:\n\nA little while back, I was having a conversation with a friend of mine about what would be the worst thing to get beaten up with.  We quickly settled on a dildo.  Just imagine getting into a fight and, instead of a knife, the guy pulls an enormous dildo and beats the ever loving piss out of you with it.  Emasculating AND painful.  So needless to say, I quickly went off to Romantic Depot with a few friends to purchase a dildo so I could then go around getting into drunken fights all night.\n\nI was able to procure a quite wonderful 16 inch black double ended dildo.  It was perfect: fit nicely in the hand, heavy enough to leave a welt, and just wiggly enough to provide a good smacking.  We went and got drunk and immediately started wandering around my college campus antagonizing everyone we could find at which point I would pull the dildo out from my inside jacket pocket and start whacking people with it.  Pretty much everyone found it hilarious and a few people posed for pictures.\n\nAs time went on, I began to use the dildo less and less and eventually threw it into the trunk of my car where I would bring it out only on special occasions.  A special occasion being, let's say, sitting awkwardly next to someone at a red light in the middle of the night and needing a prop to play with until they look over and I can make horrible eye contact with them (quick aside: I drive a hatchback, so the dildo could be accessed quickly by a passenger when the moment called for said dildo).\n\nEventually, the dildo fell out of use and I became accustomed to the sound of it rolling around in the trunk.  Every time I accelerated I could hear it roll to the back and thud against the door, every time I braked I could hear it roll forward and thud against the seats.  People would ask,\"what's that sound?\" to which I would reply, \"oh, that's just my dildo.\"  Eventually, I got tired of explaining the story of the dildo to people and threw it in a messenger bag that remained in my trunk.\n\nSOME TIME PASSES\n\nI woke up one morning and as I was eating breakfast, my dad came into the kitchen and told me he had taken my car to the car wash.  He had wanted them to vacuum inside so he cleaned everything out.  All of the things that had been in my car were on the side of the garage.  I went out to the garage and found all of the crap that had piled up in the car stacked neatly against the wall.  I started loading everything back in the car when I remembered the dildo in the messenger bag.  I opened the bag.  There was no dildo.\n\nI searched and searched and could not find the dildo.  There can only be one explanation.  And my dad hasn't said anything.  And it's been a little while now and he still hasn't brought it up.  And I'll never say anything either.\n\nBut until the day he dies, my father will know that his son, at one point in time, owned a sixteen inch double ended floppy black dildo.  And he will never know why.\n\ntldr I bought a dildo and my dad found it and we aren't talking about it", "tldr": " i bought a dildo and my dad found it and we aren't talking about it", "summary_text": "bought a dildo, used it to beat people, threw it in the trunk of my car, and my dad took it to the car wash.", "rougescores": [{"rouge-1": {"f": 0.34999999531250003, "p": 0.28, "r": 0.4666666666666667}, "rouge-2": {"f": 0.15789473218836578, "p": 0.125, "r": 0.21428571428571427}, "rouge-l": {"f": 0.36363635886134077, "p": 0.3, "r": 0.46153846153846156}}], "compression_ratio": 0.03501945525291829, "original_pos_tags": {"DT": 66, "VBD": 46, "RB": 42, "VB": 33, "NN": 102, ",": 21, "CC": 30, "PRP": 55, "VBP": 4, "TO": 18, ".": 31, "VBZ": 9, ":": 3, "JJ": 27, "VBG": 16, "IN": 63, "WP": 2, "MD": 16, "JJS": 1, "VBN": 13, "RP": 7, "NNP": 6, "NNS": 11, "CD": 4, "PRP$": 12, "WDT": 5, "JJR": 1, "RBR": 1, "WRB": 4, "POS": 1, "(": 1, ")": 1, "''": 3, "``": 1, "UH": 1, "EX": 2}, "summary_pos_tags": {"VBD": 4, "DT": 3, "NN": 6, ",": 3, "PRP": 3, "TO": 2, "VB": 1, "NNS": 1, "IN": 2, "PRP$": 2, "CC": 1, ".": 1}}
{"original_text": "So this isn't a 1 day fuck up but instead several weeks worth.\n\nI am going to be brief with certain events here because I made a promise to Z not to tell anyone what happened and as you will soon understand, it is safer if it just stays hidden. For the same reasons, I have used a thowaway.\n\nA few weeks ago I got a call from a particularly drunken and high Z who wanted to do themselves in so I spent that night making sure they were okay. Despite some very weird goings on where they were angrily responding to comments that no one had said. Due to their unhealthy state.\n\nAfter that night, everything was perfectly fine until 3 weeks later when this sentence was said \"I will always appreciate you. You are one of the best people I know... I FUCKING HATE YOU! YOU ARE A PRICK. I HOPE YOU DIE!\" and they ran off. Now nothing happened between the two things and I hadn't even had a chance to respond to the first comment.\n\nOver the next few days people started learning why she suddenly hated me. When I eventually found out what the story is, I can assure you that it is a very alternative take on what I did that evening. But it does tie in with the \"weird goings on\" I mentioned. Now because of the way they have been acting it would appear that they believe this completely so I just tried to ignore everything as much as possible and leave it alone. But after a few too many comments, I said \"I am not going to go into what happened but you can guarantee it didn't happen that way. I don't know why they are saying it, maybe it is because of the alcohol.\" I decided not go into the details because I know that that would be better for Z. And I am beginning to realise that I can handle this better than they would.\n\nWell this got back to Z didn't it. Now Z, along with family and friends is wanting to finish me off for chatting shit.\n\nTLDR: So from what I can understand, if people chat shit about me, I have to pretend it is fact because any form of defending myself just results in death threats.", "tldr": " so from what i can understand, if people chat shit about me, i have to pretend it is fact because any form of defending myself just results in death threats.", "summary_text": "i made a promise to my friend to not tell anyone what happened and now they want to finish me off for talking shit about me. thowaway.", "rougescores": [{"rouge-1": {"f": 0.17543859150507862, "p": 0.18518518518518517, "r": 0.16666666666666666}, "rouge-2": {"f": 0.03636363137851309, "p": 0.038461538461538464, "r": 0.034482758620689655}, "rouge-l": {"f": 0.11320754221431137, "p": 0.125, "r": 0.10344827586206896}}], "compression_ratio": 0.06683291770573566, "original_pos_tags": {"RB": 39, "DT": 31, "VBZ": 9, "CD": 4, "NN": 28, "VBD": 28, "RP": 4, "CC": 11, "JJ": 19, "NNS": 18, ".": 23, "PRP": 57, "VBP": 18, "VBG": 11, "TO": 14, "VB": 25, "IN": 46, "NNP": 7, "WP": 6, "MD": 9, ",": 9, "JJR": 3, "VBN": 2, "WRB": 5, "PRP$": 1, "``": 3, "JJS": 1, ":": 2, "''": 3}, "summary_pos_tags": {"NN": 6, "VBD": 2, "DT": 1, "TO": 3, "PRP$": 1, "RB": 2, "VB": 2, "WP": 1, "CC": 1, "PRP": 3, "VBP": 1, "RP": 1, "IN": 2, "VBG": 1, ".": 2}}
{"original_text": "The NoFap community recommended I post this to r/TIFU\n\n###How r/NoFap ruined my only chance at a potential relationship \n    \n\nA couple months ago, I went on a 2nd date with a girl from OKcupid. Originally we planned to go snowtubing but the snow had melt. Instead she invites me over for dinner. I get there, it's just us and it’s going really good. But then, her roommate and his mom shows up. We all hang out and play board games. Now her roommate’s mom is really hot, (and since I was 21 days nofap) I decide to playfully flirt with the mom. The mom is totally into it. It gets late though, and she eventually leaves. It's only me, my date and her roommate left. I suppose her roommate didn't enjoyed me flirting with his mom because I was cock-blocked the rest of the night. \n    \n\nAt about 12:30am, we're all very tired and the roommate asks if i'm going to spend the night, (*awkward*). So, they set me up in the \"Guest Loft\" which is an alcove/cubby about 6 feet off the ground right next to this girls room. I'm so exhausted that I just crash instead of waiting up for her to finish brushing her teeth (I should have waited). I’m asleep in this guest loft, right next to this girl's room and I start having crazy sexual dreams. One of the dreams is so intensely sexual that I wake up right away realizing something bad. I look down and see that I justed blasted about 21 days worth of jizz into my underwear (wet dream).\n    \n\nI think “holy fuck this is bad - You can't get invited to a girls house and then jizz all over her guest room bed.” I'm freaking out, perhaps I should just run out to my car, leave and never return. I don't know what else to do. So I decide that is my plan. It’s really cold outside and I remember that my sweatshirt is on the floor next to the bed. So i lean over the bed head-first to grab my sweatshirt... except, i totally forgot that I’m in a loft. I end up diving head first down a 6 foot drop.\n    \n\nAt the last moment, I catch myself on a panel of wood and cabinet. Unfortunately I break both of them, cracking the wall and causing a giant banging sound. Now i'm fucked, I just jizzed all over the place broke her cabinet and the wall, everyone must have heard it! So i run to the bathroom in my sticky underwear while carrying my jeans. Finally some good luck. It’s looks as if all the jizz stayed in my underwear. But now I have to figure out what to do with a destroyed pair of underwear. Do I try to hide it somewhere? Where? They must have heard the crash. They are probably right outside looking to see what happened. I quickly ball up the underwear and shove it down my pants. I go back to the bed and no one is there?!. I look around for jizz evidence. I can't find any, but its dark (i'm like 90% sure that it all stayed in my underwear!) Now my only concern is the smell. I mean, c'mon it's 21 days’ worth of cum. And, she's sleeping, at most,  15 ft away in her room.\n    \n\nAnyways, I start to get tired, think *screw it* (she lived 45 min away, it's not like it was a coworker and I would be permanent known as the creep who masturbates all over your guest room while you sleep). So I laydown and fall back asleep. I wake up to sounds of the girl moving around the house. She goes downstairs, so I have quickly make the bed while looking for any cum stains (I didn't see any!). I put all my clothes on while she comes back up the stairs. She jokes about how I'm trying to break her house into pieces. All of a sudden, in slowmotion, i see her nostrils flair. She is starting to smell the jizz! I quickly make some excuse about having to grab some mouthwash from my car. I run out to the and secretly pull the underwear out of my pants and stash it. Now, I made it thus far. I decide to push my luck,  I come back into the house and we hang out for like 2 hours, nothing awkward at all. \n\nI spent all the next day waiting for a text message: \"Did you cum all over the guest loft?\"\n\n\n    \n    \n\n\n**tl;dr** 21 days nofap, I go on my first date in over a year. I spend the night and paint the guest room.  ", "tldr": " 21 days nofap, i go on my first date in over a year. i spend the night and paint the guest room.  ", "summary_text": "went on a 2nd date with a girl, she invited me over for dinner, i flirt with her roommate’s mom, she leaves, i sleep in her guest loft, jizz all over her guest room bed, fall head first down a 6 foot drop and break both of them.", "rougescores": [{"rouge-1": {"f": 0.3098591505494942, "p": 0.22916666666666666, "r": 0.4782608695652174}, "rouge-2": {"f": 0.028985502902752175, "p": 0.02127659574468085, "r": 0.045454545454545456}, "rouge-l": {"f": 0.26666666211666673, "p": 0.20512820512820512, "r": 0.38095238095238093}}], "compression_ratio": 0.056185312962050274, "original_pos_tags": {"DT": 75, "NNP": 10, "NN": 112, "VBD": 22, "PRP": 91, "VBP": 48, "TO": 25, "VB": 40, "#": 3, "PRP$": 33, "JJ": 57, "IN": 91, "NNS": 22, ",": 32, "CD": 13, ".": 59, "RB": 67, "VBG": 20, "CC": 30, "VBN": 9, "VBZ": 26, "RP": 11, "(": 7, ")": 7, "``": 2, "''": 2, "WDT": 1, "MD": 7, "POS": 1, ":": 4, "JJS": 4, "WP": 4, "PDT": 2, "WRB": 2}, "summary_pos_tags": {"VBD": 2, "IN": 8, "DT": 5, "CD": 2, "NN": 17, ",": 6, "PRP": 4, "JJ": 2, "PRP$": 3, "VBZ": 1, "VBP": 1, "JJS": 1, "RB": 2, "CC": 1, "VB": 1, ".": 1}}
{"original_text": "Well, it's more of a 6 month slow-mo fuck up. The girl I love & who loved me was in the midst of the toughest 2 years anyone has gone through. I got so scared of my own shadow, constantly afraid of saying the wrong thing that might add more stress to her life, that I barely said anything. That didn't help at all. So despite doing everything I could think of to keep our relationship strong, she lost many of those feelings for me. She needed to rip off some band aids to take back control of her own life, and I was one of those band aids. Think it's painful when you rip off a band aid? Well, imagine what it feels like to be the band aid. \n\ntl;dr: Wasn't honest with my GF and she dumped me. ", "tldr": " wasn't honest with my gf and she dumped me. ", "summary_text": "tl;dr: wasn't honest with my gf and she dumped me. tl;dr: wasn't honest with my gf and she dumped me. tl;dr: wasn't honest with my gf and she dumped me. tl;dr: wasn't honest with my gf and she dumped me. tl;dr: wasn't honest with my gf and she dumped me. tl;dr: wasn't honest with my gf and she dumped me. tl;dr: wasn't honest with my gf and she dumped me.", "rougescores": [{"rouge-1": {"f": 0.22499999781250002, "p": 0.12857142857142856, "r": 0.9}, "rouge-2": {"f": 0.20512820308678503, "p": 0.11594202898550725, "r": 0.8888888888888888}, "rouge-l": {"f": 0.899999995, "p": 0.9, "r": 0.9}}], "compression_ratio": 0.5114942528735632, "original_pos_tags": {"RB": 8, ",": 6, "PRP": 15, "VBZ": 4, "JJR": 2, "IN": 17, "DT": 12, "CD": 3, "NN": 22, "JJ": 8, ".": 9, "VBP": 4, "CC": 3, "WP": 2, "VBD": 9, "JJS": 1, "NNS": 4, "VBN": 2, "PRP$": 5, "VBG": 2, "WDT": 1, "MD": 2, "VB": 8, "TO": 5, "NNP": 1, "RP": 3, "WRB": 1, "UH": 1, ":": 2}, "summary_pos_tags": {"NN": 21, ":": 14, "VBD": 14, "RB": 7, "JJ": 7, "IN": 7, "PRP$": 7, "CC": 7, "PRP": 14, ".": 7}}
{"original_text": "I woke up this morning, somewhat hungover after a(nother) night of heavy drinking. It was about 1PM and time for lunch, so i went to the kitchen. I live at home and my stepmom was making lunch. She said \"Spillomanen, if i make us some wraps, then you make us something to drink\" and who could possibly say no to such an offer? I grab a water bottle for our Sodastream machine, and poured the Elderflower and Apple syrup into the water, no biggie. \n\nI attached the water bottle (with syrup in it) to the Sodastream, and pushed to button to fill it with Carbon Dioxide. And then it all went to hell. The pressure in the water bottle became way too high in a matter of seconds. Gas and soda was being forced out of the Sodastream, spraying everything in a radius of 40cm. A mix of being kind of stunned by this unforseen event and my brain still not working properly , i thought \"i gotta release the bottle from the machine, that will end it all!\" as that seemed like the only reasonable thing to do. I grabbed the bottle and loosened it from the Sodastream. An explosion of elderflower soda sprayed everything in an even greater radius than before, and then everything became quiet. I stood still for a couple of seconds, trying to come to terms with what the hell just happend. And i realized i reversed the process of making this damn soda. Carbon Dioxide, THEN syrup. I spend the next 15 minutes wiping down the kitchen, while my stepmom was laughing at me.\n\nTL;DR: Making soda is hard with a hangover ", "tldr": " making soda is hard with a hangover ", "summary_text": "tried to make soda for my stepmom, ended up spraying everything in the kitchen in a radius of 40cm, then reversed the process and made soda again.", "rougescores": [{"rouge-1": {"f": 0.1176470555536333, "p": 0.07407407407407407, "r": 0.2857142857142857}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.12903225456815828, "p": 0.08333333333333333, "r": 0.2857142857142857}}], "compression_ratio": 0.09713905522288756, "original_pos_tags": {"PRP": 18, "VBD": 21, "RP": 2, "DT": 35, "NN": 53, ",": 14, "RB": 14, "IN": 36, "(": 2, ")": 2, "JJ": 13, ".": 17, "CD": 3, "CC": 12, "TO": 10, "VBP": 6, "PRP$": 4, "VBG": 10, "``": 2, "NNP": 15, "NNS": 5, "VB": 11, "''": 2, "WP": 2, "MD": 2, "UH": 1, "VBN": 3, "WDT": 1, "JJR": 2, ":": 2, "VBZ": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "VB": 1, "NN": 7, "IN": 4, "PRP$": 1, ",": 2, "VBD": 3, "RP": 1, "VBG": 1, "DT": 3, "CD": 1, "RB": 2, "CC": 1, ".": 1}}
{"original_text": "Happened a few quarters ago, sorry I only discovered this place recently. I was in a Helping Relationship Psychology class where we were given a task to practice one on one relationships with people who had small and manageable problems. We were assigned to record our sessions so our professor could check on our responses and tell us how to better work on our methods. The file was a little large so I put the recording on a USB stick I got freshman year. I wiped it clear on my PC and checked to make sure that nothing was on it. I turned it in and thought little of it. \n\nI got called into her office the next week. I walked in pretty casually awaiting my feedback. She tells me to take a seat and goes: \"Well, first of all, your file didn't work (she tried to open it with itunes I think and the audio file wasn't compatible), but more importantly, I have to ask you something. Were you aware that your USB is named 'horse porn'? I'm not sure I want to open that file anyways, care to explain yourself?\" \n\n**SHIT**\n\nFlashback to freshman year. I used the same USB stick to pass music and shows between my roommate and I. As it turns out, he changed the name of my USB stick on his Mac, which for whatever reason wasn't visible on PC. Although I took all the files off, the name remained until my professor stumble upon it expecting my assignment. \n\nAnyways I had the opportunity of explaining this to my professor as she laughed her ass of at how flustered I was and how many times I apologized. She also made me tell the story the next class, and that's what I am currently known for within my major as far as I know. \n\nTl;dr, forgot to wipe USB stick name, handed my prof. what she thought was my horse porn collection", "tldr": " forgot to wipe usb stick name, handed my prof. what she thought was my horse porn collection", "summary_text": "my roommate changed the name of my usb stick to \"horse porn\" and my professor thought it was my horse porn collection when she saw it.", "rougescores": [{"rouge-1": {"f": 0.5116279021957817, "p": 0.4230769230769231, "r": 0.6470588235294118}, "rouge-2": {"f": 0.24390243426531835, "p": 0.2, "r": 0.3125}, "rouge-l": {"f": 0.42105262670360116, "p": 0.36363636363636365, "r": 0.5}}], "compression_ratio": 0.07768115942028986, "original_pos_tags": {"VBD": 31, "DT": 22, "JJ": 20, "NNS": 10, "RB": 16, ",": 12, "NN": 48, "PRP": 43, ".": 17, "IN": 34, "NNP": 14, "WRB": 4, "VBN": 6, "TO": 13, "CD": 2, "WP": 3, "CC": 11, "VB": 13, "PRP$": 17, "MD": 1, "JJR": 1, "VBP": 8, "VBG": 3, "VBZ": 8, ":": 2, "``": 1, "(": 1, ")": 1, "RBR": 1, "POS": 1, "''": 1, "RP": 1, "WDT": 2, "PDT": 1}, "summary_pos_tags": {"PRP$": 4, "NN": 7, "VBD": 4, "DT": 1, "IN": 1, "JJ": 1, "TO": 1, "``": 1, "VB": 1, "''": 1, "CC": 1, "PRP": 3, "VBN": 1, "WRB": 1, ".": 1}}
{"original_text": "A few months ago I was at my girlfriends house and we went into the garage to get something to drink while we watched Netflix. Well while we were in there she was being frisky then started giving me a blowjob when we heard her mom out in the kitchen. We quickly grabbed some sodas and walked out. I still had my boner so I stayed a bit behind to adjust it and make it less noticeable. I was in the hallway looking at a mirror and flipped it up in my shorts and unbeknownst to me, her mom was in the part of the kitchen next to her and could see me. Apparently she saw my penis and muttered, \"oh my..\" And kinda walked away into her room without saying anything else. I didn't know anything until my girlfriend told me after that her mom saw half of my penis. \n\nTldr; got a boner and tried to hide it when we heard her mom, her mom ended up seeing it and just walked into her room.", "tldr": " got a boner and tried to hide it when we heard her mom, her mom ended up seeing it and just walked into her room.", "summary_text": "got a boner and tried to hide it when we heard her mom, her mom ended up seeing it and just walked into her room. fml.", "rougescores": [{"rouge-1": {"f": 0.9803921518646674, "p": 0.9615384615384616, "r": 1.0}, "rouge-2": {"f": 0.9795918317367763, "p": 0.96, "r": 1.0}, "rouge-l": {"f": 0.9767441810492159, "p": 0.9545454545454546, "r": 1.0}}], "compression_ratio": 0.1340909090909091, "original_pos_tags": {"DT": 12, "JJ": 4, "NNS": 4, "IN": 20, "PRP": 24, "VBD": 24, "PRP$": 12, "NN": 27, "CC": 10, "TO": 6, "VB": 8, "NNP": 3, ".": 8, "EX": 1, "VBG": 5, "RB": 8, "WRB": 2, "RP": 4, "RBR": 1, ",": 3, "MD": 1, "``": 1, "UH": 1, "''": 1, "VBN": 1, ":": 1}, "summary_pos_tags": {"VBD": 5, "DT": 1, "NN": 5, "CC": 2, "TO": 1, "VB": 1, "PRP": 4, "WRB": 1, ",": 1, "PRP$": 2, "RP": 1, "VBG": 1, "RB": 1, "IN": 1, ".": 2}}
{"original_text": "I'm a children's librarian in a small town where everyone seems to know each other. Part of my job is working with our volunteers. A very nice girl (about 14) started volunteering a couple of weeks ago. One of my co-workers knows her family and we were talking about her before her shift one day. Turns out this girl is from a wealthy family, is extremely popular, all the normal things that makes me regress into my old angsty \"I hate pretty girls\" mentality. This girl is actually really nice and very interested in library work so I put away my stupid baggage and continue to be encouraging to her. \n\nOne day during a lull we start talking about our families (just basic 'Do you have any brothers or sisters?' kind of stuff) She starts talking about her brothers and how they don't get along. I share my experience with my family and tell her 'You know, things may seem bad now but when you get older and move out of your parents house you're going to miss your brothers and parents. All of the little fights you have turn into funny stories. So just try to enjoy the time you get to spend under the same roof with your brothers.\" And then I say \"As long as nothing really bad happens to you or your family I'm sure you'll look back favorably on your time together.\" She responds with \"3 years ago my Dad gave up on life.\" \n\ntl;dr I relied on small town gossip for news and made a young girl tell me about her Dad's suicide\n\nedited for spelling", "tldr": " i relied on small town gossip for news and made a young girl tell me about her dad's suicide", "summary_text": "talked to a nice girl about her family, she told me her dad killed himself 3 years ago, and now she thinks i'm a horrible person.", "rougescores": [{"rouge-1": {"f": 0.2666666617876544, "p": 0.23076923076923078, "r": 0.3157894736842105}, "rouge-2": {"f": 0.04651162303948131, "p": 0.04, "r": 0.05555555555555555}, "rouge-l": {"f": 0.19047618552154208, "p": 0.17391304347826086, "r": 0.21052631578947367}}], "compression_ratio": 0.08914996544574982, "original_pos_tags": {"PRP": 21, "VBP": 13, "DT": 16, "NNS": 19, "POS": 2, "NN": 37, "IN": 31, "JJ": 21, "WRB": 3, "VBZ": 10, "TO": 7, "VB": 15, ".": 13, "PRP$": 21, "VBG": 8, "RB": 21, "(": 2, "CD": 6, ")": 2, "VBD": 6, "CC": 13, "RP": 2, ",": 3, "PDT": 1, "WDT": 1, "``": 3, "''": 5, "MD": 2, "JJR": 1, "VBN": 1, "NNP": 2, ":": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "DT": 2, "JJ": 3, "NN": 4, "IN": 1, "PRP$": 2, ",": 2, "PRP": 4, "VBD": 2, "CD": 1, "NNS": 1, "RB": 2, "CC": 1, "VBZ": 1, "VBP": 1, ".": 1}}
{"original_text": "My friends and I were in a car at a local park tonight. Suddenly, 7 cars sped out of the parking lot in formation. My friend got instantly excited and followed.  We thought we were going to see some fucked up shit. The anticipation was unreal. We  even followed them into the next town. They eventually parked in a sketchy area. When we parked, we saw them all get out and they were only a large Latino family. Biggest disappointment ever. \n\nTL;DR - Followed a convoy thinking we were bad ass only to realize it was just a large latino family", "tldr": " followed a convoy thinking we were bad ass only to realize it was just a large latino family", "summary_text": "followed a convoy of cars thinking we were bad ass only to realize it was just a large latino family. i'm a dumbass.", "rougescores": [{"rouge-1": {"f": 0.8780487755621655, "p": 0.782608695652174, "r": 1.0}, "rouge-2": {"f": 0.8205128155950033, "p": 0.7272727272727273, "r": 0.9411764705882353}, "rouge-l": {"f": 0.8947368371606649, "p": 0.8095238095238095, "r": 1.0}}], "compression_ratio": 0.2140221402214022, "original_pos_tags": {"PRP$": 2, "NNS": 2, "CC": 3, "PRP": 12, "VBD": 14, "IN": 7, "DT": 11, "NN": 18, "JJ": 7, ".": 9, "RB": 8, ",": 2, "CD": 1, "VBN": 3, "VBG": 1, "TO": 2, "VB": 2, "RP": 2, "WRB": 1, "VBP": 1, "NNP": 4, ":": 2}, "summary_pos_tags": {"VBD": 3, "DT": 3, "NN": 6, "IN": 1, "NNS": 1, "VBG": 1, "PRP": 2, "JJ": 2, "RB": 2, "TO": 1, "VB": 1, ".": 2, "VBP": 1}}
{"original_text": "Since I was about 10, I've had really bad acne and ultra sensitive skin, but it wasn't until a today (headed into my sophomore year in high school) that my parents decided I should get Epiduo prescription medication for my face. I've tried all kinds of medication in the past and they didn't work, but my parents saw a commercial on the TV and got themselves all excited. I went to the dermatologist and she prescribed Epiduo, which turns out to be an insanely overpriced version of Neutrogena. I left the doctor's and went to Walgreen's to get my new fancy $200 goop. I headed home, took a shower, put on the new medication, and headed out to my golf lesson. It's a sunny, hot day, probably around 90, with no real shade because I'm on a golf course. After about 20 minutes of being in the sun, I started to notice my skin feeling a little tight and dry, but I brushed it off because that sometimes happens with new medication. As more time passed, it started to really burn. By the time my lesson was finally over, it felt like Satan was taking a shit on my face. I rushed home and stuck my head in the sink, hoping it would quench the fire erupting on my face. Boy was I wrong. The water just made it worse, if that was possible. Warm water was a little better, but at that time I was just trying to get the rest of the Epiduo off, if there was any left. While running warm water over my face, I decided to read the bottle of that evil goop. It says not to mix with other medications, and to be careful of using it while in sunlight. Not only was I outside for an hour an a half in blazing sun, I use at least 3 other types of prescription medication. Guess my dermatologist just... forgot... to warn me. Its been two hours since my golf lesson and my skin is just staring to cool off. I just looked in the mirror and it looks like I've been severely sunburned and my skin is \"shedding\".I probably wont be using Epiduo, or ever going outside again.\n\nTL;DR- Used prescription medication and  spent two hours in the sun when it directly told me not to.", "tldr": " used prescription medication and  spent two hours in the sun when it directly told me not to.", "summary_text": "used prescription medication and spent two hours in the sun when it directly told me not to, and now my skin looks like it's going to die.", "rougescores": [{"rouge-1": {"f": 0.7727272679855373, "p": 0.6296296296296297, "r": 1.0}, "rouge-2": {"f": 0.714285709569161, "p": 0.5769230769230769, "r": 0.9375}, "rouge-l": {"f": 0.7906976696376421, "p": 0.6538461538461539, "r": 1.0}}], "compression_ratio": 0.06721870433511934, "original_pos_tags": {"IN": 47, "PRP": 34, "VBD": 34, "RB": 24, "CD": 7, ",": 22, "VBP": 5, "VBN": 8, "JJ": 26, "NN": 63, "CC": 18, "DT": 35, "(": 1, "PRP$": 17, ")": 1, "NNS": 8, "MD": 2, "VB": 15, "NNP": 11, ".": 20, "TO": 14, "WDT": 1, "VBZ": 8, "RP": 5, "POS": 2, "$": 1, "VBG": 13, "JJR": 3, "EX": 1, "JJS": 1, ":": 3, "``": 1, "''": 1, "WRB": 1}, "summary_pos_tags": {"VBN": 1, "NN": 4, "CC": 2, "VBD": 2, "CD": 1, "NNS": 1, "IN": 2, "DT": 1, "WRB": 1, "PRP": 3, "RB": 3, "TO": 2, ",": 1, "PRP$": 1, "VBZ": 2, "VBG": 1, "VB": 1, ".": 1}}
{"original_text": "Bit of back story: My boyfriend, \"J\", lives in an a one bedroom apartment with a currently unemployed roommate who made a makeshift bedroom where the dining room should be. His roommate,\"W\", gets money from his parents to pay rent/bills so he hardly ever leaves.\n\nImportant to note: He has a dresser with a huge mirror that is angled to see directly into J' room.\n\nWell, earlier today, J and I were laying around watching Netflix. W tells J that he'll be at his parents for a few hours to hang out and get his rent money. He leaves, so J and I decide \"Fuck it! We're alone, time for some hot shower sex!\". About 15 minutes into our romp, I thought I heard a noise but just figured it was either the upstairs neighbor or someone doing something outside. I forget about it and keep going. J loves to hear me yell \"Fuck me!\". It is his go to to let go and get off. So I enthusiastically shout it a couple of times. I came, he came it was awesome.\n\nWe get out of the shower and I only had my pants in the bathroom because I got half undressed in his room. So, since we were home alone and all, I just walked out with nothing on on top. While I was in his room looking for my shirt and bra, with the door wide open, J's phone goes off. It's W saying hes got mail on the stove. Which I thought was strange since he would've told him before he left. J walks into the room, sees the text and messages him back.\n\nThat's when we heard W's phone go off. \n\nJ went to see if W was there or if he had just left his phone behind. Turns out he only went over there for maybe 5 minutes before coming back and laying in bed, facing the mirror. He swears up and down he didn't know we were in there and he didn't see/hear anything but he won't look me in the eye. That pretty much confirms to me that hes seen my tits. \n\nI do not look forward to the awkwardness between us for the next couple of weeks.\n\nTL;DR Boyfriend and I had sex in shower without realizing roommate came back home. He probably saw my tits in the process.", "tldr": " boyfriend and i had sex in shower without realizing roommate came back home. he probably saw my tits in the process.", "summary_text": "boyfriend and i had sex in shower without realizing roommate came back home. he probably saw my tits in the process. he won't look me in the eye.", "rougescores": [{"rouge-1": {"f": 0.8571428522448981, "p": 0.75, "r": 1.0}, "rouge-2": {"f": 0.851063824898144, "p": 0.7407407407407407, "r": 1.0}, "rouge-l": {"f": 0.9090909041322315, "p": 0.8333333333333334, "r": 1.0}}], "compression_ratio": 0.07224713502740408, "original_pos_tags": {"NNP": 22, "IN": 50, "JJ": 13, "NN": 55, ":": 3, "PRP$": 14, ",": 16, "``": 3, "''": 5, "VBZ": 18, "DT": 26, "CD": 3, "RB": 29, "WP": 1, "VBD": 29, "WRB": 2, "MD": 4, "VB": 19, ".": 29, "NNS": 13, "TO": 10, "PRP": 47, "WDT": 1, "VBN": 6, "POS": 3, "UH": 1, "JJR": 2, "CC": 18, "VBG": 10, "RP": 5, "VBP": 7, "EX": 2}, "summary_pos_tags": {"NN": 8, "CC": 1, "VBD": 3, "IN": 4, "VBG": 1, "RB": 3, ".": 3, "PRP": 3, "PRP$": 1, "NNS": 1, "DT": 2, "MD": 1, "VB": 1}}
{"original_text": "So a little background. I work in a manufacturing plant and today my job was to run parts out of our automatic press. Well I loaded a coil of stock onto the  feeder.\n\nFirst FU: I didn't pay attention to which way the burr was facing on the coil.\n\nnow this doesn't seem important but when you run it through the straightner it affects the way the stock is flattened. So this is where the second FU comes in.\n\nSecond FU: I only used to banding straps instead of three.\n\nWell again doesn't seem like much but that third band keeps the material from twisting while coiled up. Well as soon as i tried to move it it shifted and turned into [this]( http://i.imgur.com/r1z6sSf.jpg). Now i can't just scrap it cause it's a 2000ft coil that costs about $1200. So i have to rewind the coil... by hand.\n\n[This]( http://i.imgur.com/ihCkMv5.jpg) is the rig i came up with to rewind the coil.\n\nAfter two and half hours http://i.imgur.com/gpHlzpV.jpg\n\nBut there's more http://i.imgur.com/cdauLOI.jpg\n\nBut now my lunch break is over back to work.\n\nTL;DR strap ons and burrs", "tldr": " strap ons and burrs", "summary_text": "i didn't pay attention to which way the burr was facing on a coil and now i have to rewind it by hand and it's costing me $1200.", "rougescores": [{"rouge-1": {"f": 0.062499997812500076, "p": 0.03571428571428571, "r": 0.25}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.06896551486325811, "p": 0.04, "r": 0.25}}], "compression_ratio": 0.12121212121212122, "original_pos_tags": {"RB": 19, "DT": 19, "JJ": 8, "NN": 44, ".": 13, "PRP": 11, "VBP": 3, "IN": 20, "CC": 9, "PRP$": 3, "VBD": 10, "TO": 7, "VB": 10, "NNS": 4, "NNP": 6, ":": 8, "WDT": 2, "VBG": 3, "VBZ": 13, "WRB": 2, "VBN": 1, "CD": 4, "(": 2, ")": 2, "MD": 1, "$": 1, "EX": 1, "JJR": 1}, "summary_pos_tags": {"NN": 6, "VBD": 2, "RB": 3, "VB": 2, "TO": 2, "WDT": 1, "DT": 2, "VBG": 2, "IN": 2, "CC": 2, "VBP": 1, "PRP": 3, "VBZ": 1, "$": 1, "CD": 1, ".": 1}}
{"original_text": "Sister's going out of town and taking her kids. \"Hey little brother, do you mind staying at my place a couple days and taking care of the pets?\"\n\n\nIt's not a problem. The first part of the afternoon yesterday I got bored and rearranged the alphabet letters on her refrigerator into various immature phrases and vulgarities. \"Love Gay Anal, Suck the Quick Stick, Etc\" - But the potential for the perverse is limited with having only a few dozen letters. \n\n\nAh! I'll call the GF over to stay the night. Now all this has been OK'd through my sister, who assured me all the beds had clean sheets and we could take our pick where we slept. Well, sister has the biggest bed - Let's sleep in her room!\n\nAfter a night of passionate nosex, the GF make a joke about the 'bullet' on my sister's dresser. I glance over and sure enough it looks like one of those sex toys. \"Haha, it does favor that, doesn't it? However, naive and silly GF, that's lipstick. I've deducted that because its sitting right next to the rest of her makeup. Here, I'll show you.\" With that, I reach over and pop the cap of the lipstick container. Maybe it wasn't Maybelline, because batteries fell out. \n\n\"Oh no...  No NoNo. I made a terrible mistake.\" *This actually is my sister's pocket rocket.* I yelp, drop it, and jump back. Then the heavy realization to make it worse, I have to pick it up and put it back together... Lest I look like I tried to use it.\n\nTL;DR: Thanks to my quick reasoning and faster reactions, I grabbed my sister's tiny dildo.", "tldr": " thanks to my quick reasoning and faster reactions, i grabbed my sister's tiny dildo.", "summary_text": "i grabbed my sister's pocket rocket thinking it was lipstick, but it was actually a dildo and now i look like an asshole.", "rougescores": [{"rouge-1": {"f": 0.32432431962016073, "p": 0.2608695652173913, "r": 0.42857142857142855}, "rouge-2": {"f": 0.17142856675918378, "p": 0.13636363636363635, "r": 0.23076923076923078}, "rouge-l": {"f": 0.30303029825528016, "p": 0.25, "r": 0.38461538461538464}}], "compression_ratio": 0.07976268951878708, "original_pos_tags": {"NNP": 21, "POS": 6, "VBG": 6, "IN": 29, "NN": 48, "CC": 12, "PRP$": 12, "NNS": 12, ".": 23, "``": 4, "JJ": 18, ",": 17, "VBP": 7, "PRP": 27, "VB": 10, "DT": 28, "''": 4, "VBZ": 10, "RB": 12, "VBD": 10, "VBN": 4, ":": 6, "MD": 4, "TO": 6, "PDT": 2, "WP": 1, "WRB": 1, "JJS": 1, "CD": 1, "WDT": 1, "RP": 3, "UH": 1, "JJR": 1}, "summary_pos_tags": {"NN": 6, "VBD": 3, "PRP$": 1, "POS": 1, "VBG": 1, "PRP": 2, "JJ": 2, ",": 1, "CC": 2, "RB": 2, "DT": 2, "VBP": 1, "IN": 1, ".": 1}}
{"original_text": "So here's my story, happened just 15 minutes ago.\nI just got back from the gym and had a shower. I decided to snap a pic of myself to send to the gf and also just as a general progress pic. So anyway, here's where the fuck up happens. As I opened the picture, I pressed this one button which I assumed was the \"share\" button. Once clicked, nothing happened. I admit at this point I had no clue what just happened so I shrugged it off. I was able to press the correct button and send it to the gf.\n\nHOWEVER! as I'm getting changed and heading down to grab some food, I start hearing my mum yelling at me VERY loudly. I have nfi what this could be about, cos she usually nags me like this, but not this loudly. At this point I just want to add that I have traditional Indian conservative parents. As I'm walking down, she starts asking me what I was doing in the bathroom, and WHY THERE'S A NAKED SELFIE OF ME CURRENTLY ON THEIR 48\" TV.\n\nAt this point I start trying to explain (half fucking shocked) that I was trying to take progress pics and it was an accident. Eventually after me repeating that same line over and over, she lets it go. She then goes on to tell me how both her and my dad were watching tv when my picture suddenly appeared. I burst into laughter and could not stop laughing as I walked back up the stairs to my room. Hopefully everything won't be so awkward, though I'm wishing now that I had one of those neuralizers from Men In Black to end my humiliation and embarrassment.\n\nEmbarrassing but also pure hilarity.\n\nTL;DR - Took a naked selfie for the gf and for \"progress pics\", end up accidentally sharing it onto the big screen TV downstairs which my parents were viewing. TIFU.", "tldr": " took a naked selfie for the gf and for \"progress pics\", end up accidentally sharing it onto the big screen tv downstairs which my parents were viewing. tifu.", "summary_text": "took a naked selfie for the gf and for \"progress pics\", ended up accidentally sharing it onto the big screen tv downstairs which my parents were viewing.", "rougescores": [{"rouge-1": {"f": 0.9454545404561984, "p": 0.9629629629629629, "r": 0.9285714285714286}, "rouge-2": {"f": 0.9056603723602706, "p": 0.9230769230769231, "r": 0.8888888888888888}, "rouge-l": {"f": 0.9411764655901577, "p": 0.96, "r": 0.9230769230769231}}], "compression_ratio": 0.09, "original_pos_tags": {"RB": 30, "POS": 1, "PRP$": 8, "NN": 44, ",": 12, "VBD": 21, "CD": 4, "NNS": 8, ".": 21, "PRP": 37, "IN": 31, "DT": 28, "CC": 13, "TO": 12, "VB": 15, "JJ": 13, "NNP": 16, "VBZ": 5, "WRB": 3, "RP": 5, "WDT": 2, "``": 2, "''": 3, "VBP": 11, "WP": 3, "VBG": 16, "VBN": 3, "MD": 3, "(": 1, ")": 1, ":": 2}, "summary_pos_tags": {"VBD": 3, "DT": 3, "JJ": 2, "NN": 6, "IN": 3, "CC": 1, "``": 1, "NNS": 2, "''": 1, ",": 1, "RP": 1, "RB": 1, "VBG": 2, "PRP": 1, "WDT": 1, "PRP$": 1, ".": 1}}
{"original_text": "This actually happened last weekend, and I feel that I need to preface that I am a 28 year old female and I have camped many times, but I always make sure to have a potty nearby because my biggest fear is what happened. \n\nI live in Idaho and it's been 100 degrees every day for like a month and a half. Some friends and I decide to go down to the river and hang out, play with the dogs, whatever. Before we left I kinda had to poo but I couldn't do it, it was more of a \"I'm gonna have to go eventually\" kind of thing. \n\nSo we go to a part of the river that I've never been to, you have to walk some trails to get down there. So we get there and I jump in right away cause I've had to pee forever and it's the river, that's what you do. About 7 minutes after that I realize that I have to go. I think to myself that I can hold it, I just have to get out of the water for a bit. So I go sit down and realize this is not one of those moments, this is a monster that has to get out of me. \n\nSo I get out of the water and start walking back towards the trails. One of my friends asks where I'm going an I have to go so bad I just say \"Illberightback!\" as fast as possible, cause losing focus on this means I will for sure have feces in my swimsuit.\n\nI get back to the main trail and start walking along, trying to find a place where there is a log or something that I can squat over that is also not in the view of people, but it gets so bad that I just said \"fuck it\" and found the closest log available. I am so lucky that there happens to be a whole dug already, so all I have to do is squat down and sit on the log.\n \nThis is where the problem occurs. I have a soaking wet swimsuit on, that is a pain in the ass to get off, and when I get down ready to go, I panic. My butt is like \"nope nope nope\" when it touches the log and I panic. So while my body was ready to free this beast, my brain was like \"ABORT!\"\n\nSo it starts to go and I am stuck in this almost kneeling position on the ground and I don't know what to do cause I can't stop myself from pooping. So I just let it go, and I lost my balance and ended up shatting on my foot. It was warm and as disgusting as you could imagine. I was annoyed and grossed out and panicky at that moment, but nothing prepared me for what came next: I had nothing to wipe with. I look around for leaves or a stick or SOMETHING, ANYTHING to end this, and then I start to think \"what if those leaves are poisonous? What if the stick gives me splinters? I don't want splinters in my butthole.\" \n\nLuckily I happen to have a shirt on over my swimsuit, so I begrudgingly take it off and wipe myself with it. I then threw it in the whole, and buried the entire remnants of the horrific situation at hand. \nThen I had the matter of getting the poo off me. Instead of going back and facing my friends, I walked further down the trail to find a place more secluded than where we were. I hope in the river and start washing myself off as best as I can and I glance up and there is a fly fisherman about 25 feet away from me. I see him and he turns around like \"wtf are you doing?\" so I nod and proceed to rinse myself off as quickly as possible. \n\nI then went back to where my friends were and proceeded to tell them my story. They all laughed and told me I was riding on top of the car on the way back. \n\nTL:DR I am a grown professional female who doesn't know how to shit in the woods.", "tldr": " i am a grown professional female who doesn't know how to shit in the woods.", "summary_text": "went down to the river, had to poop, had to squat over a log, my butt touched the log, and my brain was like \"abORT!\"", "rougescores": [{"rouge-1": {"f": 0.14999999531250016, "p": 0.12, "r": 0.2}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.11764705389273376, "p": 0.10526315789473684, "r": 0.13333333333333333}}], "compression_ratio": 0.03424056189640035, "original_pos_tags": {"DT": 64, "RB": 54, "VBN": 8, "JJ": 29, "NN": 76, ",": 24, "CC": 42, "PRP": 92, "VBP": 49, "IN": 85, "TO": 35, "VB": 46, "CD": 6, "NNS": 21, "PRP$": 13, "JJS": 2, "VBZ": 24, "WP": 7, "VBD": 27, ".": 35, "NNP": 3, "RP": 8, "WDT": 2, "MD": 7, "JJR": 1, "``": 7, "VBG": 14, "''": 7, "WRB": 8, "EX": 3, "PDT": 1, ":": 2, "RBR": 2}, "summary_pos_tags": {"VBD": 5, "RB": 1, "TO": 3, "DT": 3, "NN": 6, ",": 4, "VB": 2, "RP": 1, "PRP$": 2, "CC": 1, "IN": 1, "``": 1, ".": 1, "''": 1}}
{"original_text": "To make days go by faster at work, I brought in a portable music speaker that I can set up wherever I'm working. So today, I was moved into a hall to clean floors while a cleaning crew worked on the walls. I plug in my ipod so we can all listen to music while working. This was in the morning, and everything went fine, until after lunch.\n\nThe hall I was working in doesn't have a restroom, and the nearest one is right around the hall corner. I leave my music plugged in to the speaker and go off to relieve myself. All is fine in the restroom, but stepping into the hall I quickly realized my mistake; [Killing in the Name Of](http://www.youtube.com/watch?v=bWXazVhlyxQ) was playing and blaring loud \"fuck you\"s throughout the halls. I fumbled around with the speakers, grabbed my ipod, and went off to hide in shame from everyone else.\n\ntl;dr: Told some more senior workers to \"fuck you, I won't do what you tell me.\"", "tldr": " told some more senior workers to \"fuck you, i won't do what you tell me.\"", "summary_text": "i left my music plugged in to a portable speaker at work, and the song \"fuck you\" was playing and blaring throughout the hall. told some more senior workers to \"fuck you, i won't do what you tell me.\"", "rougescores": [{"rouge-1": {"f": 0.5714285673469389, "p": 0.4, "r": 1.0}, "rouge-2": {"f": 0.55555555154321, "p": 0.38461538461538464, "r": 1.0}, "rouge-l": {"f": 0.6274509760861208, "p": 0.45714285714285713, "r": 1.0}}], "compression_ratio": 0.21739130434782608, "original_pos_tags": {"TO": 7, "VB": 12, "NNS": 6, "IN": 25, "NN": 34, ",": 9, "PRP": 16, "VBD": 11, "DT": 19, "JJ": 6, "MD": 3, "RP": 2, "VBP": 4, "VBG": 7, ".": 10, "RB": 6, "VBN": 3, "PRP$": 4, "CC": 7, "VBZ": 3, "JJS": 1, ":": 4, "NNP": 1, "(": 1, ")": 1, "``": 2, "''": 2, "RBR": 1, "WP": 1}, "summary_pos_tags": {"NN": 7, "VBD": 3, "PRP$": 1, "VBN": 1, "IN": 3, "TO": 2, "DT": 4, "JJ": 2, ",": 2, "CC": 2, "``": 2, "PRP": 4, "''": 2, "VBG": 2, ".": 2, "RBR": 1, "NNS": 1, "VB": 3, "MD": 1, "RB": 1, "WP": 1, "VBP": 1}}
{"original_text": "Back story: my best friend and I have known each other for sixteen years and tell each other everything.\nOk, so 6 years ago, my friend, let's call her C, starts dating a guy,Z. Z and C exchange virginities and break up soon after.\nFast forward to 2 years ago when they got back together. C and Z get engaged and C cheats on Z many times. Z tells C it's over and makes her move back in with her mom.\nAbout a month ago, Z starts txting me. Pics are exchanged and we agree to hang out. C finds out and flips shit. Starts calling both of us multiple times a day just bitching us out. We both ignore her and continue with our lives.\nWell, we hung out last night and ended up sleeping together. It was amazing and yet I feel awful.\nTL;DR: talked to bffs ex fiancé and ended up Fucking him. Feel awful", "tldr": " talked to bffs ex fiancé and ended up fucking him. feel awful", "summary_text": "talked to my best friend's ex fiancé and ended up fucking him. feel awful. tl;dr: don't fuck ex fiancés.", "rougescores": [{"rouge-1": {"f": 0.7096774146097816, "p": 0.5789473684210527, "r": 0.9166666666666666}, "rouge-2": {"f": 0.6206896504637337, "p": 0.5, "r": 0.8181818181818182}, "rouge-l": {"f": 0.7333333285333336, "p": 0.6111111111111112, "r": 0.9166666666666666}}], "compression_ratio": 0.1309823677581864, "original_pos_tags": {"RB": 13, "NN": 12, ":": 3, "PRP$": 6, "JJS": 1, "CC": 13, "PRP": 13, "VBP": 7, "VBN": 3, "DT": 7, "JJ": 9, "IN": 9, "NNS": 10, "VB": 10, ".": 14, "UH": 1, ",": 7, "CD": 2, "POS": 1, "NNP": 15, "VBZ": 7, "VBG": 7, "RP": 7, "TO": 3, "WRB": 1, "VBD": 5}, "summary_pos_tags": {"VBN": 1, "TO": 1, "PRP$": 1, "JJS": 1, "NN": 5, "POS": 1, "JJ": 3, "CC": 1, "VBD": 1, "RP": 1, "VBG": 1, "PRP": 1, ".": 3, "VB": 2, ":": 2, "VBP": 1, "RB": 1}}
{"original_text": "Its a summer day and being a 16 year old female enjoying the days of being home alone, I decide to put my favorite broadway soundtrack *Chicago* on. I hop in the shower to enjoy the jazzy tunes (because, who doesn't like to sing in the shower) and I don't bother to close the bathroom door because I'm home alone right? Getting out to dry off when my favorite, \"When your good to Mama\" is on. \nFor those of you who don't know *Chicago* very well, \"When you're good to Mama\" is very sudctive if sang/danced right. So I feel hot when I sing this song and began to dry off in a senutal mannor, I put my leg up on the closed toilet seat and having a little sexy time in the mirror to see what I look like if I ever get a boyfriend and I do my little number when I turn my head to see-...\nMy Uncle, starting down the hallway. Gets a glance of my sexy-nakedness through the wide open door and my towel only covering one boob. He dives down the stairs and I grab my towel, turn off the music and shamefully dry myself off like a normal person, got dressed, and came out to the computer where I write my story of shame. \n\nTL;DR: Did a sexy towel dance in the mirror after my shower with the door wide open to the *Chicago* song \"When you're good to Mama\" thinking I was home alone, BUT, my uncle saw it all. ", "tldr": " did a sexy towel dance in the mirror after my shower with the door wide open to the *chicago* song \"when you're good to mama\" thinking i was home alone, but, my uncle saw it all. ", "summary_text": "my uncle saw my sexy towel dance in the mirror after my shower with the door wide open to the *Chicago* song \"When you're good to Mama\" thinking i was home alone.", "rougescores": [{"rouge-1": {"f": 0.7826086906784289, "p": 0.84375, "r": 0.7297297297297297}, "rouge-2": {"f": 0.6567164129382937, "p": 0.7096774193548387, "r": 0.6111111111111112}, "rouge-l": {"f": 0.6999999950500001, "p": 0.7777777777777778, "r": 0.6363636363636364}}], "compression_ratio": 0.12461538461538461, "original_pos_tags": {"PRP$": 13, "DT": 26, "NN": 50, "CC": 9, "VBG": 8, "CD": 2, "JJ": 20, "NNS": 2, "IN": 23, "RB": 16, ",": 11, "PRP": 20, "VBP": 15, "TO": 13, "VB": 11, ".": 8, "(": 1, "WP": 3, "VBZ": 6, ")": 1, "RP": 6, "WRB": 7, "``": 3, "NNP": 8, "''": 3, "VBN": 2, "VBD": 5, ":": 3}, "summary_pos_tags": {"PRP$": 3, "NN": 10, "VBD": 2, "JJ": 4, "IN": 3, "DT": 3, "TO": 2, "``": 1, "WRB": 1, "PRP": 1, "VBP": 1, "NNP": 1, "''": 1, "RB": 2, ".": 1}}
{"original_text": "This actually happened a long time ago and is actually one of my earliest memories of throwing up.  When I was about eight I was at a party in my neighborhood when my stomach started to act up.  I decided to walk home to go to the bathroom because I thought I needed to poop.  I made it to my bathroom but nothing was conning out.  After straining to push something out for a good 5 minuets, my face suddenly explodes with vomit.  I end up soaking a rug in my bathroom and covering the floor with my puke.  I think the only reason I remember this is because it was the first time vomit ever came out my nose an it hurt like a bitch.\nTL;DR How are you this lazy?  It's a single paragraph, read it!", "tldr": " how are you this lazy?  it's a single paragraph, read it!", "summary_text": "tried to poop, ended up throwing up in my face and covering my bathroom floor with my puke. it hurt like a bitch and was the first time vomit ever came out my nose.", "rougescores": [{"rouge-1": {"f": 0.044444440750617584, "p": 0.029411764705882353, "r": 0.09090909090909091}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.049999996012500325, "p": 0.034482758620689655, "r": 0.09090909090909091}}], "compression_ratio": 0.23563218390804597, "original_pos_tags": {"DT": 14, "RB": 5, "VBD": 11, "JJ": 6, "NN": 21, "CC": 3, "VBZ": 5, "CD": 3, "IN": 13, "PRP$": 8, "JJS": 1, "NNS": 2, "VBG": 5, "RP": 6, ".": 9, "WRB": 2, "PRP": 15, "TO": 7, "VB": 6, ",": 2, "VBP": 4, "NNP": 3, ":": 1}, "summary_pos_tags": {"VBN": 1, "TO": 1, "VB": 1, ",": 1, "VBD": 3, "RP": 3, "VBG": 2, "IN": 3, "PRP$": 4, "NN": 8, "CC": 2, ".": 2, "PRP": 1, "VBZ": 1, "DT": 2, "JJ": 1, "RB": 1}}
{"original_text": "This was actually about 4 years ago, but I think it qualifies as a fuck up. So anyway, I was sick with the flu or something, I had been home sick for a good week. I go to the bathroom to puke. What happened next, was pretty much one of the dumbest things I have done. I was trying to puke into the toilet since I felt like I had to puke, but I also felt a fart coming on. Now I thought it was just a fart, WRONG. I ended up shitting into my pajama pants right there on the floor. To make it worse, I can't seem to remember puking, so it could have been fucking avoided. \n\nI then got into the shower and cleaned up, twice. \n\nTLDR: Fuck you, read.", "tldr": " fuck you, read.", "summary_text": "thought a fart was a puking fart, ended up shitting into my pajama pants while trying to puke. fuck you, read.", "rougescores": [{"rouge-1": {"f": 0.24999999781250004, "p": 0.14285714285714285, "r": 1.0}, "rouge-2": {"f": 0.18181818016528928, "p": 0.1, "r": 1.0}, "rouge-l": {"f": 0.26086956294896035, "p": 0.15, "r": 1.0}}], "compression_ratio": 0.17054263565891473, "original_pos_tags": {"DT": 11, "VBD": 13, "RB": 13, "IN": 13, "CD": 2, "NNS": 3, ",": 10, "CC": 4, "PRP": 18, "VBP": 4, "VBZ": 1, "NN": 14, "RP": 3, ".": 10, "JJ": 4, "VBN": 5, "TO": 6, "VB": 8, "WP": 1, "JJS": 1, "VBG": 4, "NNP": 2, "PRP$": 1, "JJR": 1, "MD": 2, ":": 1}, "summary_pos_tags": {"VBD": 3, "DT": 2, "NN": 3, "JJ": 2, ",": 2, "RP": 1, "VBG": 2, "IN": 2, "PRP$": 1, "NNS": 1, "TO": 1, "VB": 2, ".": 2, "PRP": 1}}
{"original_text": "I was at my grandparents' farm today just walking around when I stumbled across a blue egg just sitting on the ground. It actually looked whole, but when I picked it up, I noticed it had a few holes in it where the unborn bird must have leaked out. It still had some weight to it though, so I figured that I could just take it home and rinse it out and keep it and it would be a cool thing to have! \n\nNo. \n\nI went to my car to put it in there where I wouldn't forget it. I had my other hand full of stuff, so I used the hand holding the Robin egg to open my car door. \n\n*crunch*\n\nFuck. I looked down at the egg and then realized that a very dark brown liquid had leaked out onto my hand. Keep in mind that it is in the 90 degree range here in Iowa with a bright sun too. This thing was ROTTEN. So, that's the story of how my hand smelled like death for a day. I washed it off but I don't think I'll ever forget that smell...\n\nTL;DR: Accidentally broke a rotten Robin's egg into my hand. Will never forget the smell. ", "tldr": " accidentally broke a rotten robin's egg into my hand. will never forget the smell. ", "summary_text": "i accidentally broke a rotten robin's egg into my hand while trying to open my car door in the 90 degree weather. it smelled like death for a day.", "rougescores": [{"rouge-1": {"f": 0.4545454500516529, "p": 0.3448275862068966, "r": 0.6666666666666666}, "rouge-2": {"f": 0.3809523765079365, "p": 0.2857142857142857, "r": 0.5714285714285714}, "rouge-l": {"f": 0.47619047159863953, "p": 0.37037037037037035, "r": 0.6666666666666666}}], "compression_ratio": 0.1437007874015748, "original_pos_tags": {"PRP": 28, "VBD": 18, "IN": 22, "PRP$": 7, "NNS": 2, "POS": 2, "NN": 32, "RB": 16, "VBG": 3, "RP": 6, "WRB": 5, "DT": 20, "JJ": 11, ".": 13, ",": 5, "CC": 6, "MD": 5, "VB": 13, "VBN": 2, "TO": 5, "EX": 1, "NNP": 8, "VBZ": 2, "CD": 1, "VBP": 1, ":": 3}, "summary_pos_tags": {"NN": 10, "RB": 1, "VBD": 2, "DT": 3, "JJ": 2, "POS": 1, "IN": 4, "PRP$": 2, "VBG": 1, "TO": 1, "VB": 1, "CD": 1, ".": 2, "PRP": 1}}
{"original_text": "I work at a chain restaurant and lately we have had a lot of \"coupon fraud.\" Basically, this means servers steal stacks of coupons or print them from their computer under false emails (or snatch them out of local newspapers but this is more rare) and add them to all their cash checks. Since they are their \"own bank\" and don't pay the restaurant until the end of the night, those coupons that were never really used when someone gives them cash and says keep the change end up being an extra five, ten, whatever dollars in their pocket... sometimes costing us hundreds and hundreds of dollars in losses, impacting manager salaries and bonuses, and also impacting even other hourly employees who are on the upper end of the ladder trying to move up.\n\nI found out this mass coupon fraud was going on, and I \"checked in\" a friend to her shift. Not super close, but I've been to her house and drank after work and never had any problems with her. She seemed like a pretty cool chick. I had suggested we search all of the servers' books for coupons, so I was searching them all. I flipped hers open when she set it down when she walked in, and unfortunately, there was a stack of coupons in there... Which should be impossible as all coupons actually used are to be turned in at the end of the night, and any that are found are to be turned in and destroyed immediately. Basically, if you have a big stack like that, it means you are planning to steal.\n\nThere were so many witnesses that I couldn't have covered for her even if  I wished to do so. Another girl got shooed out the door, and as a 'key holder' type position, I cannot show any preferential treatment, especially if I am to be moved into management like I plan.\n\nI honestly had no idea she was one of the people stealing. She was suspended for a few days and fired today. I don't know if she will be able to even keep her apartment after this, and that's a pretty shitty feeling to know that you did to a cool person, even if they did make the choice themselves.\n\nTLDR:  Got a cool chick I had no problems with fired because she was profiting from coupon fraud. Feels bad, man.", "tldr": "  got a cool chick i had no problems with fired because she was profiting from coupon fraud. feels bad, man.", "summary_text": "got a cool chick fired because she was profiting from coupon fraud at work, even though she didn't do anything wrong, even though she seemed like a cool person.", "rougescores": [{"rouge-1": {"f": 0.4897959135360267, "p": 0.41379310344827586, "r": 0.6}, "rouge-2": {"f": 0.42553191007695795, "p": 0.35714285714285715, "r": 0.5263157894736842}, "rouge-l": {"f": 0.5581395299080585, "p": 0.5217391304347826, "r": 0.6}}], "compression_ratio": 0.0749063670411985, "original_pos_tags": {"PRP": 39, "VBP": 15, "IN": 49, "DT": 40, "NN": 50, "CC": 20, "RB": 26, "VBD": 26, "``": 3, ".": 16, "''": 3, ",": 20, "VBZ": 6, "NNS": 26, "JJ": 25, "VB": 19, "PRP$": 8, "(": 1, "JJR": 1, ")": 1, "TO": 12, "PDT": 1, "WDT": 3, "VBN": 12, "WRB": 3, "RP": 4, "VBG": 10, "CD": 2, ":": 3, "WP": 1, "POS": 2, "EX": 3, "NNP": 3, "MD": 4}, "summary_pos_tags": {"VBD": 5, "DT": 2, "JJ": 3, "NN": 6, "IN": 6, "PRP": 3, "VBG": 1, ",": 2, "RB": 3, "VB": 1, ".": 1}}
{"original_text": "So, this was actually a week ago on Canada day, and I guess its more of a really awkward situation than anything else. Anyway, it's Canada day, and I don't usually bus, but its free today. Take the bus downtown with some friends, have a great time. We split, I go to a teammates house for a bit then bus home alone, around 11:30. \n\nThe bus was packed and I barely squeezed on. The next stop a couple of chubby and unattractive women who are over twice my age get on the bus (I'm 18). They also squeeze in, pushing me against a wall. I'm sorta standing there with one of the women up against me. My phone is in sorta in a weird position,(sometimes i put my phone in my pocket sideways and it sorta sticks out) and I can't grab it to get it flat in my pocket since the woman's ass is basically on my leg. So I brilliantly decide to rub my leg, with my phone pointed out against her to get it flat in my pocket. You can probably guess what she thought, that I had basically rubbed my erect dick against her. She sorta twitches but there's no room to move, my phone with its pretty hard case stays up against her for another 5 or 6 minutes before she gets off. When she does get off, I can't stop myself from glancing at her face to see if she was thinking what i thought she was thinking. She glares at me with disgust and I immediately turn away. I know I'll never see her or her friends again, but it was a really awkward bus ride, not only cause of the phone thing, butt because I was stuck against a chubby woman who was like 45+ for like 6 minutes. I'm also very allergic to perfume, no more busing for me.\n\nTL;DR Rubbed my phone in my pocket against a much older woman's ass in a crowded bus, made her think I basically humped her", "tldr": " rubbed my phone in my pocket against a much older woman's ass in a crowded bus, made her think i basically humped her", "summary_text": "rubbed my phone in my pocket against a much older woman's ass in a crowded bus, made her think i humped her, and now i'm never going to see her or her friends again.", "rougescores": [{"rouge-1": {"f": 0.7719298197476148, "p": 0.6470588235294118, "r": 0.9565217391304348}, "rouge-2": {"f": 0.690909086109091, "p": 0.5757575757575758, "r": 0.8636363636363636}, "rouge-l": {"f": 0.7499999952170139, "p": 0.6206896551724138, "r": 0.9473684210526315}}], "compression_ratio": 0.09521061742642815, "original_pos_tags": {"RB": 31, ",": 19, "DT": 24, "VBD": 18, "NN": 53, "IN": 47, "NNP": 6, "CC": 12, "PRP": 41, "VBP": 11, "PRP$": 20, "JJR": 2, "JJ": 18, ".": 16, "VBZ": 8, "VB": 15, "NNS": 10, "TO": 7, "CD": 7, "VBN": 3, "WP": 4, "(": 2, ")": 2, "VBG": 4, "RP": 5, "MD": 4, "POS": 2, "EX": 1, "WRB": 1, "RBR": 1, ":": 1}, "summary_pos_tags": {"VB": 2, "PRP$": 5, "NN": 7, "IN": 3, "DT": 2, "JJ": 3, "JJR": 1, "POS": 1, ",": 2, "VBD": 2, "PRP": 1, "CC": 2, "RB": 3, "VBP": 1, "VBG": 1, "TO": 1, "NNS": 1, ".": 1}}
{"original_text": "So last night I had a couple of people over and I got pretty drunk. After my friends depart from my place Im feeling exhausted and want to go straight to bed, but first I had to piss. So I drain the pipes and head upstairs to my room. Still drunk, I decided to browse the internet for a little bit. I realized I was way too exhausted so after about 10-15 minutes of browsing I close my laptop, turn on my AC, turn off the lights and hop in bed which felt fucking amazing after a long day. AS SOON as I snuggle in my sheets I have the urge to piss YET AGAIN and its barely been fucking 15 minutes. Now, my upstairs room is an addition to my house, and there is no bathroom upstairs. So this would require me to walk to the opposite side of my house just to get to the stairs, and go all the way back to the same side of the house my room is on to get the bathroom. Fuck that, I'm way to lazy for that shit. So, I see an empty gatorade bottle in my trash can by my bed and decide to just piss in there and throw it out the next morning. So, there I went, draining the pipes yet again but in a gatorade bottle. When I finished, I for some reason decided to put the gatorade bottle back next to my bed on my nightstand. I wake up the next morning still half asleep and thirsty as a motherfucker. Without even thinking, I grab the gatorade bottle and start to drink my vegetated piss. Once the warm salty liquid reached my tongue I had realized my mistake which then made me spew it out all over my pillow. The thought of me drinking my own piss then made me yak all over my bed. I had two of the three bodily excretions spattered on my pillow/bed. \n\nTL;DR: Hungover? Better drink my own piss. ", "tldr": " hungover? better drink my own piss. ", "summary_text": "got drunk, pissed in a gatorade bottle, drank my own piss, puked all over my pillow and bed, and yakted all over my pillow.", "rougescores": [{"rouge-1": {"f": 0.12903225456815828, "p": 0.08333333333333333, "r": 0.2857142857142857}, "rouge-2": {"f": 0.0689655139595721, "p": 0.043478260869565216, "r": 0.16666666666666666}, "rouge-l": {"f": 0.1599999959680001, "p": 0.1111111111111111, "r": 0.2857142857142857}}], "compression_ratio": 0.07282415630550622, "original_pos_tags": {"RB": 24, "JJ": 22, "NN": 58, "PRP": 25, "VBD": 17, "DT": 31, "IN": 34, "NNS": 10, "CC": 13, ".": 19, "PRP$": 23, "VBP": 9, "NNP": 10, "TO": 18, "VB": 20, ",": 13, "VBG": 6, "RP": 4, "WDT": 2, "VBN": 3, "CD": 3, "VBZ": 3, "EX": 2, "MD": 2, "PDT": 1, "WRB": 1, ":": 2}, "summary_pos_tags": {"VBD": 3, "NN": 7, ",": 4, "VBN": 1, "IN": 3, "DT": 3, "VB": 1, "PRP$": 3, "JJ": 1, "CC": 2, ".": 1}}
{"original_text": "I'm not going to elaborate because I don't even know how to. Pretty much, I totaled my car, my parents found out about my marijuana use, and I broke up with my girlfriend in 1 hour. Oh, and I also became the biggest joke in school over my Minecraft playing.\n\nTL;DR I really fucked up everything good in my life in one hour.\n\nI'll elaborate in comments when I get my head straight, like I'm literally still shocked to the core.", "tldr": " i really fucked up everything good in my life in one hour.", "summary_text": "i fucked up a lot in one hour, and i'm not even sure how to put it into words. i'm a dumbass.", "rougescores": [{"rouge-1": {"f": 0.29411764249134953, "p": 0.22727272727272727, "r": 0.4166666666666667}, "rouge-2": {"f": 0.12499999548828142, "p": 0.09523809523809523, "r": 0.18181818181818182}, "rouge-l": {"f": 0.32258064058272634, "p": 0.25, "r": 0.45454545454545453}}], "compression_ratio": 0.21830985915492956, "original_pos_tags": {"PRP": 9, "VBP": 4, "RB": 9, "VBG": 1, "TO": 3, "VB": 3, "IN": 11, "WRB": 2, ".": 5, "JJ": 1, ",": 5, "VBD": 4, "PRP$": 7, "NN": 14, "NNS": 2, "VBN": 2, "CC": 2, "RP": 2, "CD": 2, "UH": 1, "DT": 2, "JJS": 1, "NNP": 3, ":": 1, "MD": 1}, "summary_pos_tags": {"NN": 5, "VBD": 1, "RP": 1, "DT": 2, "IN": 2, "CD": 1, ",": 1, "CC": 1, "VB": 2, "VBP": 2, "RB": 2, "JJ": 1, "WRB": 1, "TO": 1, "PRP": 1, "NNS": 1, ".": 2}}
{"original_text": "So at my school there is a very attractive girl, she's an exchange student from Portugal named Mari. Exotic, tan and a cute accent. A week ago I happened by her number because she desperately needed tutoring in chemistry and I am good at science. So I became her tutor, got her number, and 15 bucks an hour pays well. So all's good?\n\nWell I was going to pick up my friend to go see a local concert so I go to text him I am in front of his house. His name is Mason. I jokingly type, \"prepare your anus, I'm coming in hot\" to let him know. I instinctively type \"MA\" into my shitty samsung phone which goes to the first name starting with \"MA.\" Mari comes before Mason in the alphabet. Until a week ago Mason was the only \"MA\" in my phone. I completely forget that I had added Mari. Only when I saw \"Message sent to Mari\" had I realized what I had done. I held down my car horn in rage, and then the police came because I was causing a noise disturbance. So on to of the rapey text I got fined $50 and couldn't go to the concert.\n\nTL:DR I texted \"prepare your anus, I'm coming in hot\" to the most attractive girl at myself school because I don't know the alphabet. \n\nP.S. Samsung is crap\n\nEDIT: She didn't text me back for a day until finally she sent me basically, \"what the shit.\" I attempted to convince her that her english wasn't good enough and that she misread it. Wrong thing to do. So she took her phone to her friends and parents to make sure that she didn't misread it. So now I appear to be a serial rapist to her friends. And then her parents. When they found out and I had a 15 minute conversation with a portuguese mother, using profanity in two languages. I am no longer her tutor and grounded.\nWorst part? Mason and I both took AP chemistry. Now it looks like he is her tutor.\n\n\n", "tldr": " i texted \"prepare your anus, i'm coming in hot\" to the most attractive girl at myself school because i don't know the alphabet. ", "summary_text": "texted \"prepare your anus, i'm coming in hot\" to the most attractive girl at myself school because i don't know the alphabet.", "rougescores": [{"rouge-1": {"f": 0.9565217341398866, "p": 1.0, "r": 0.9166666666666666}, "rouge-2": {"f": 0.9545454495557851, "p": 1.0, "r": 0.9130434782608695}, "rouge-l": {"f": 0.9767441810492159, "p": 1.0, "r": 0.9545454545454546}}], "compression_ratio": 0.06971556051310653, "original_pos_tags": {"RB": 31, "IN": 33, "PRP$": 17, "NN": 55, "EX": 1, "VBZ": 8, "DT": 23, "JJ": 17, ",": 10, "PRP": 45, "NNP": 20, "VBD": 29, ".": 28, "CC": 11, "VBP": 11, "CD": 4, "NNS": 6, "POS": 1, "VBG": 6, "TO": 15, "VB": 17, "RP": 1, "``": 7, "''": 7, "WDT": 1, "VBN": 3, "WRB": 2, "WP": 2, "$": 1, "MD": 1, ":": 2, "RBS": 1}, "summary_pos_tags": {"VBN": 1, "``": 1, "VB": 2, "PRP$": 1, "NN": 5, ",": 1, "JJ": 3, "VBP": 2, "VBG": 1, "IN": 3, "''": 1, "TO": 1, "DT": 2, "RBS": 1, "PRP": 1, "RB": 1, ".": 1}}
{"original_text": "Throwaway for obvious reasons.\n\nSo I'm 14 and discovered masturbation a few months ago - this is to be expected of people to start watching porn and stuff. I had a soundcloud account linked to my facebook, and started listening to some porn to get me off. It normally helps me.\n\nSo since it's linked, I start listening to some of that shit. I start masturbating, and then I get a call from my mom. Pause, stop, answer.\n\n\"Hello?\"\n\n\"Hi, _. I saw on your Facebook you're watching _\"\n\n*Me, being in total and utter shock* \"Um, what?\"\n\n\"It says you were watching _ on Facebook.\"\n\n\"Oh...it does?\" I start denying everything.\n\nI then tell my mom I'll do something, hang up, and delete my account, hoping that the info will disappear. \n\nNow here is my favorite part. I call my mom back and explain to her I deleted my account (which I never even used), and she says it's okay for boys my age to explore sexual content. She was okay with it.\n\nBut it was still super awkward nonetheless. I appreciate how my mom knows it's okay, and that it's normal and doesn't mind.\n\nTLDR: Have soundcloud account linked to Facebook, listen to some porn, and my mom finds out. \n\nEDIT 1: I was home alone, as well. \n\nEDIT 2: /r/gonewildaudio shout it.", "tldr": " have soundcloud account linked to facebook, listen to some porn, and my mom finds out. ", "summary_text": "had soundcloud account linked to facebook, listen to some porn, mom finds out, deletes account, and tells me it's okay for boys my age to explore sexual content.", "rougescores": [{"rouge-1": {"f": 0.5909090862809917, "p": 0.4642857142857143, "r": 0.8125}, "rouge-2": {"f": 0.4285714239795918, "p": 0.3333333333333333, "r": 0.6}, "rouge-l": {"f": 0.48780487340868534, "p": 0.38461538461538464, "r": 0.6666666666666666}}], "compression_ratio": 0.13142857142857142, "original_pos_tags": {"NNP": 9, "IN": 15, "JJ": 14, "NNS": 4, ".": 21, "PRP": 30, "VBP": 9, "CD": 3, "CC": 13, "VBD": 12, "NN": 32, "DT": 9, "RB": 17, ":": 5, "VBZ": 14, "TO": 10, "VB": 9, "VBN": 3, "VBG": 9, "PRP$": 12, ",": 16, "RP": 3, "``": 5, "''": 5, "WP": 1, "UH": 1, "MD": 2, "(": 1, "WDT": 1, ")": 1, "WRB": 1}, "summary_pos_tags": {"VBD": 2, "JJ": 3, "NN": 5, "TO": 3, "VB": 4, ",": 4, "DT": 1, "VBZ": 4, "RP": 1, "CC": 1, "PRP": 2, "IN": 1, "NNS": 1, "PRP$": 1, ".": 1}}
{"original_text": "This one is pretty cut and dry...\n\nWork in a very small office. When one uses the bathroom there is no question about whether it is 1 or 2. Thought since nobody was upstairs that I had clearance to let one rip. I immediately regretted that decision. A faster than usual dash to the bathroom probably alerted everyone downstairs that there was something amiss. As soon as I sat down on the toilet I reached for the tp so I could check the damage... 3 fucking squares left...3. Results from the first one indicated that this was going to be a fucking mess so I did what I had to do - folded that bitch in half and used it twice. Every square inch of clean white paper was going to be needed if I was going to get out of this without having to go home for lunch. By some miracle the last square indicated a clean surface but by this time I had been in there way longer than a #1. So nobody used the bathroom the rest of the day and I had to go downstairs and get more tp out of the closet in front of everyone just to put to rest any doubt in their minds as to whether or not pooping was going on. Little did they know....\n\ntl;dr never trust a fart at work. It may work once or twice but eventually you will shart and when you do there will not be any tp for you. Because life.", "tldr": " never trust a fart at work. it may work once or twice but eventually you will shart and when you do there will not be any tp for you. because life.", "summary_text": "sharted in the bathroom at work and had to use a fart twice to clean it up. nobody used the bathroom the rest of the day and had to get more tp out of the closet in front of everyone just to put to rest any doubt in their minds as to whether or not pooping was going on.", "rougescores": [{"rouge-1": {"f": 0.2444444399283951, "p": 0.1864406779661017, "r": 0.3548387096774194}, "rouge-2": {"f": 0.04545454096074425, "p": 0.034482758620689655, "r": 0.06666666666666667}, "rouge-l": {"f": 0.11594202422180235, "p": 0.09523809523809523, "r": 0.14814814814814814}}], "compression_ratio": 0.2119309262166405, "original_pos_tags": {"DT": 27, "CD": 9, "VBZ": 4, "JJ": 14, "NN": 44, "CC": 11, ":": 6, "IN": 38, "RB": 14, ".": 14, "WRB": 2, "EX": 3, "PRP": 17, "VBN": 4, "VBD": 19, "TO": 11, "VB": 16, "JJR": 3, "VBP": 3, "RP": 1, "MD": 4, "NNS": 4, "VBG": 6, "WP": 1, "NNP": 1, "#": 1, "PRP$": 1}, "summary_pos_tags": {"VBN": 1, "IN": 11, "DT": 7, "NN": 13, "CC": 3, "VBD": 4, "TO": 6, "VB": 5, "PRP": 1, "RP": 1, ".": 2, "JJR": 1, "RB": 2, "PRP$": 1, "NNS": 1, "VBG": 2}}
{"original_text": "I, 22f, am studying abroad in Argentina this semester. As I am well aware, the country is currently in a state of economic distress and, as the unemployment rate is extremely high, many of the inhabitants have resorted to petty crime, such as pickpocketing, in an attempt to make ends meet. There's the background.\n\nA few days ago (today I didn't fuck up.. but I sure did on Saturday morning) I was leaving a guy's apartment after he had already left to go to work. I get myself all ready to go and see half of the joint we had smoke from the night before sitting in the ashtray on the table. I have nothing else really to do the rest of the day so I decide to take a few puffs. Feeling nice and buzzed, I put my iPhone headphones in my hears, turned on my music and went along my way. After realizing the commute home would have been a 1.5 hour long walk I decide to wait at the 124 bus stop. There were trucks parked in the spaces in front of the stop so it was difficult to see the bus and to consequently hail it down. The woman in front kept walking into the street to see if the bus was coming, so I figured I'd leave that to her in order to eventually get on the bus. This was my first mistake, being completely still giving my assailants time to scope me out. A few minutes later a man comes up to me and mentions I have a stain on my back and that I should clean it. I feel around my coat and find nothing, so I continue in my trance from the playlist and the sunny day and the weed and the waiting. Then another woman comes up and AGAIN mentions that there's something on my back. At this point I start to feel around my shoulders and when I pull my hand back I see that there is a huge glob of saliva on my skin. There are several trails of spit on my clothes. Fucking gross. I also didn't know that throwing liquids/trash/SPITTING on people is a means of distraction for pickpocketers. Awesome.. yay ignorance. While trying to clean myself up I become hazily aware of this woman and her two children standing uncomfortably close to me. I was on a busy street and I didn't think much of it, though my personal space was most definitely invaded. I didn't even notice my music stop playing. All of a sudden she's gone and a street vendor is yelling at me, bringing me down to earth telling me that I had just been robbed. Then it all clicks.\n\nOf COURSE that's what just happened!\n\nMy initial reaction was.. uh.. wait... what.. OH WHAT THE FUCK!!! and i just kept thinking to myself: \"why the fuck didn't this vendor intervene while he saw everything happening!?!?\" I mean maybe the people were armed, there's many reasons. So he tells me that she got onto a bus that was (wow just my luck!) stopped at the red light a few yards away. As i confusedly approach, I realize that there are three buses, all completely stuffed. There's no way that I am finding her ever again. Had my iPhone jacked right out from under my nose. Felt like a total idiot, also violated from the saliva shower. Only solace is that the screen was completely fucked. Oh well..\n\nTL;DR Got spat on and robbed while stoned and studying abroad in a foreign country without even realizing until it was over.\n", "tldr": " got spat on and robbed while stoned and studying abroad in a foreign country without even realizing until it was over.", "summary_text": "got high, waited at a bus stop, got spit on by pickpocketers, got yelled at by a woman and her two children, and had to clean myself up.", "rougescores": [{"rouge-1": {"f": 0.20408162775510216, "p": 0.17857142857142858, "r": 0.23809523809523808}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.14285713786848087, "p": 0.13636363636363635, "r": 0.15}}], "compression_ratio": 0.04271356783919598, "original_pos_tags": {"PRP": 50, ",": 18, "CD": 5, "VBP": 21, "VBG": 21, "RB": 44, "IN": 80, "NNP": 15, "DT": 58, "NN": 96, ".": 41, "JJ": 39, "VBZ": 15, "CC": 20, "NNS": 22, "VBN": 15, "TO": 20, "VB": 27, "EX": 8, "(": 2, "VBD": 28, ")": 2, "POS": 1, "PRP$": 21, "MD": 3, "RP": 4, "WRB": 2, "RBS": 1, "WDT": 2, "WP": 1, ":": 3, "``": 1, "''": 1, "UH": 1}, "summary_pos_tags": {"RB": 1, "JJ": 1, ",": 4, "VBD": 4, "IN": 5, "DT": 2, "NN": 3, "VBN": 2, "NNS": 2, "CC": 2, "PRP": 2, "CD": 1, "TO": 1, "VB": 1, "RP": 1, ".": 1}}
{"original_text": "A wee bit of backstory: I don't drink hard liquor, I don't like it and it doesn't like me. I can drink wine and beer regularly with little to no issue but stay away from the hard stuff. Amongst my friends and family there is a standing ban against two types of liquor specifically; vodka, because it makes me cry like a baby, and tequila, because I will (attempt) to have sex with pretty much anything. Now I think whiskey will be added to that list.\n\nThe Story: My Wife and I are prepping up for a night of pizza, booze, TV at the liquor store and I reach for my old familiar 6 pack. She says that she is bored with beer and had heard one of her friends talking about how delicious Rye Whiskey and lemonade are, so I consent and grab a bottle.\n\nWe get home and start mixing drinks, and the mixture is quite delicious. It has the sweet tang of lemonade and the oaky warmth of whiskey but zero alcohol taste, this is a bad thing. The drunker I get the less I can taste the alcohol, so the stronger I make the drinks, so the drunker I get and it snowballs from there.\n\nMy next memory is waking up the next morning, still very drunk, and feeling like I've been trampled by a team of horses. My wife has already left for work an hour ago, so I get dressed rather sloppily and head out myself. I carpool and it was not my day to drive so I didn't drive drunk. I make it there and get settled in with a muffin to soak up the alcohol and text my wife to see why I am so sore. Her reply, \"You bit me and I kicked the shit out of you.\" I go to the bathroom and lock the door and take off my shirt to find my side and shoulder to be one giant bruise.\n\nThese are the events of the evening as pieced together from my wife's story. I drank most of the bottle of whiskey by myself.  She had two drinks with ~2 shots each, and I had the rest. I was not able to make it through the Daily Show and Colbert Report so my wife drug me to bed and tried to have sex with me. By this point I apparently had unprecedented levels of whiskey dick so that wasn't going to happen and I just yelled/sobbed drunkenly into my pillow for a while. She finds the quite amusing and starts jokingly saying things like about me being impotent (which I'm not normally) just so she can laugh at my over the top responses.\n\nEventually I just get annoying and it late so she rolls over and tries to go to sleep, accidentally pulling the covers off of me. So, I do what any rational person would do and bite her. And not a nibble either, I lock on like a pitbull and don't let go, apparently I also pull her hair. My wife slugs me in the forehead until I let go, then a few more times in the side of the head and the shoulder/rib area for good measure before kicking me (literally) out of bed.\n\nShe isn't mad, in fact she finds it quite hilarious. But I have never felt worse (mentally or physically) and it doesn't help when she makes spousal abuse jokes.\n\nTL;DR I'm a light weight, I fight like a girl, and my wife has a wicked left.\n\nEdit : Some words.", "tldr": " i'm a light weight, i fight like a girl, and my wife has a wicked left.", "summary_text": "don't drink hard liquor, don't drink whiskey, don't have sex with your wife, and don't have sex with your dick.", "rougescores": [{"rouge-1": {"f": 0.05555555061728439, "p": 0.05, "r": 0.0625}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.07692307195266304, "p": 0.08333333333333333, "r": 0.07142857142857142}}], "compression_ratio": 0.036840358446730836, "original_pos_tags": {"DT": 54, "JJ": 31, "NN": 91, "IN": 69, ":": 5, "PRP": 68, "VBP": 29, "RB": 50, "VB": 34, ",": 24, "CC": 40, "VBZ": 19, ".": 29, "MD": 6, "TO": 15, "NNP": 12, "PRP$": 17, "NNS": 18, "EX": 2, "VBG": 12, "CD": 6, "(": 4, ")": 4, "WP": 2, "VBN": 11, "RP": 5, "VBD": 11, "WRB": 3, "JJR": 3, "``": 1, "''": 1, "POS": 1, "JJS": 1, "WDT": 1}, "summary_pos_tags": {"VBP": 4, "RB": 4, "VB": 4, "JJ": 1, "NN": 6, ",": 3, "IN": 2, "PRP$": 2, "CC": 1, ".": 1}}
{"original_text": "I'd been planning to switch banks for some time now.  I have been stewing and stewing over the fact that my bank has started assessing a $6 monthly service fee if your account balance falls below $500 during any time during the previous month.\n\nSo they're charging me for being poor.  If I was wealthy and could maintain a high balance, the account would be free.  That just seems horribly wrong to me.\n\nSo today was payday.  I took my check to the bank and told them I wanted to keep out part of it in cash and deposit the rest into the account.  The lady said \"I'm sorry, since this check is drawn on a different bank, I'm going to have to deposit the whole thing and it will become available to you first thing tomorrow morning, but I can't give you any cash out of it today.\"  I replied with \"okay, why do I even have an account with you then?  I'm just going to come inside and close out my account.\"\n\nI went inside, expressed my opinions about their monthly \"being poor\" fee and the fact that they wouldn't give me my money most verbosely, calling them \"useless\" and \"the most un-helpful and uncaring bank I've ever used.\"\n\nAbout an hour or so later, it hit me: On February first, I filed my federal income taxes, and scheduled my hefty return to be direct-deposited...into the bank account that I had just closed...\n\nWhere is my pride?  I seem to have lost it.  I've had a bit of indigestion lately, I think maybe I swallowed it.  The last time I saw it was right before I called the bank, apologized, and begged them to reopen my account... Which they were kind enough to do, preventing me from having to wait months and months while the IRS kept my refund tied up in limbo.\n\ntldr: got mad at my bank, closed my bank account, and then realized that my federal tax refund was scheduled to direct-deposit into that account.  Had to call them and beg to get it reopened.  My pride is no more.  It has ceased to be.", "tldr": " got mad at my bank, closed my bank account, and then realized that my federal tax refund was scheduled to direct-deposit into that account.  had to call them and beg to get it reopened.  my pride is no more.  it has ceased to be.", "summary_text": "got mad at my bank, closed my bank account, and then realized that my federal tax refund was scheduled to direct-deposit into that account. had to call them and beg to get it reopened.", "rougescores": [{"rouge-1": {"f": 0.8717948668770547, "p": 1.0, "r": 0.7727272727272727}, "rouge-2": {"f": 0.8684210477181441, "p": 1.0, "r": 0.7674418604651163}, "rouge-l": {"f": 0.8888888839506174, "p": 1.0, "r": 0.8}}], "compression_ratio": 0.09588327253778009, "original_pos_tags": {"PRP": 45, "MD": 6, "VBN": 10, "VBG": 12, "TO": 17, "VB": 21, "NNS": 7, "IN": 35, "DT": 27, "NN": 55, "RB": 21, ".": 19, "VBP": 11, "CC": 16, "PRP$": 16, "VBZ": 7, "$": 2, "CD": 2, "JJ": 25, "VBD": 28, ",": 16, "RP": 2, "``": 5, "''": 5, "WRB": 2, "RBS": 2, ":": 5, "NNP": 2, "RBR": 1}, "summary_pos_tags": {"VBD": 6, "NN": 7, "IN": 3, "PRP$": 3, ",": 2, "CC": 2, "RB": 1, "JJ": 1, "VBN": 1, "TO": 3, "VB": 4, "DT": 1, ".": 2, "PRP": 2}}
{"original_text": "Ok, so this happened a couple weeks ago in my research lab. This might be a little confusing if you aren't a scientist or chemist, but I'll try to make it readable for you non-scientists out there. BTW, I am an undergraduate researcher, so you can imagine some of the stupidity that will ensue.\n\nI work in a lab that tries to make crystals to see if a unique chemical structure is formed. One time I was using ethanol (alcohol) as a solvent for my reaction, and I knew that the product formed from the reaction would not crystallize with ethanol, so I had to vaporize the ethanol out of the solution by heating the solution beaker on a hot plate. Once the ethanol was vaporized, I was left with the product in the hot/warm beaker. \n\nNow this is an aside, for some reason or another the graduate TAs and research educator prof I work with in the lab do not use the vent (hood) for many dangerous chemicals, like dichloromethane. Maybe its because they find it inconvenient to work in the hood or maybe its because they work with dichloromethane so much they kinda forget about its dangers. So I thought since they don't use a hood when using dichloromethane, then maybe I don't need to, for the sake of \"efficiency\" (stupid mistake, very stupid). \n\nIN CASE YOU DON'T KNOW THE DANGERS OF DICHLOROMETHANE: The first thing you have to know is that it is potentially carcinogenic. The second thing is that if you inhale/consume enough of it, then you can/will get carbon monoxide poisoning because dichloromethane is metabolized into carbon monoxide. Carbon monoxide poisoning can lead to temporary blindness/blurriness. The third thing is that dichloromethane has a relatively low boiling point temperature (point at which the liquid turns into a gas that you can breathe).\n\nNow that the solid product is in my hot/warm beaker with no liquid ethanol, I am supposed to dissolve the product in dichloromethane, so that it will crystallize in a couple days. OK, so here's when things go outta hand. I start to add dichloromethane into the beaker, and I notice that the dichloromethane was vaporizing, like when you add water to hot skillet when you are washing it after you used it on the stove. I thought, no big deal, I do this all the time to cool down pots and stuff at home, no harm done? WRONG! The next second, I took a normal breath of air. And my lungs sank like an anvil dropping to the bottom of an ocean. I realized what I had just done to myself. I, immediately, put the beaker into a vent (hood), and started breathing heavy to try and get as much dichloromethane out of my system as possible. I knew it was too late, but then I assured myself that I didn't breathe too much because I only put in like a couple mLs of dichloromethane into the beaker. I left lab and went outside for like 30 minutes, and thankfully I didn't feel any strong effects due to the dichloromethane, except for blurriness in my eyes for a couple minutes (I think the blurriness may have come from the placebo effect of knowing the side effects of inhaling dichloromethane b/c I was thinking of that first).\n\nI think I am lucky to be alive. Reddit, TIFU, and plan on not fucking up again in lab by being a shit ton more safe, rather than being \"efficient\". \n\nTL;DR I breathed a dangerous chemical because of stupid and unsafe lab techniques, and I should count myself lucky that nothing too dangerous occurred to my body because of it. Now, I'm going to be the safest scientist ever.", "tldr": " i breathed a dangerous chemical because of stupid and unsafe lab techniques, and i should count myself lucky that nothing too dangerous occurred to my body because of it. now, i'm going to be the safest scientist ever.", "summary_text": "tried to make crystals in a hot/warm beaker with no liquid ethanol, ended up making dichloromethane, which is potentially carcinogenic and can lead to carbon monoxide poisoning.", "rougescores": [{"rouge-1": {"f": 0.12307691822011854, "p": 0.14814814814814814, "r": 0.10526315789473684}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.10344827091557693, "p": 0.11538461538461539, "r": 0.09375}}], "compression_ratio": 0.05108225108225108, "original_pos_tags": {"NNP": 16, ",": 33, "IN": 93, "DT": 66, "VBD": 26, "JJ": 45, "NNS": 15, "RB": 38, "PRP$": 10, "NN": 110, ".": 28, "MD": 10, "VB": 31, "PRP": 58, "VBP": 26, "CC": 17, "TO": 19, "WDT": 3, "VBZ": 12, "VBN": 9, "CD": 2, "VBG": 16, "(": 6, ")": 6, "WRB": 4, "``": 2, "''": 2, ":": 2, "PDT": 1, "RP": 2, "UH": 1, "WP": 1, "RBR": 1, "JJS": 1}, "summary_pos_tags": {"VBN": 1, "TO": 2, "VB": 3, "NNS": 1, "IN": 2, "DT": 2, "NN": 6, ",": 2, "VBD": 1, "RP": 1, "VBG": 1, "WDT": 1, "VBZ": 1, "RB": 2, "JJ": 1, "CC": 1, "MD": 1, ".": 1}}
{"original_text": "My fuck up actually started yesterday when I ate Panda Express for lunch and then McDonalds for dinner.  I'm usually a really healthy eater so the introduction of this food into my system hasn't been treating me well today.  \n\nSo I was back in the bathroom to shit for the fourth time today and when I entered the bathroom I was talking on the phone and I forgot to lock the door.  I should mention the bathroom I was using was a male bathroom, it has a urinal and a stall with a toilet, but because of the flow of people it has been converted into a unisex bathroom that you are supposed to lock while in use. \n\nSo I'm in there just blowing shit everywhere and talking on the phone.  I should also add that considering the door was locked I didn't shut the stall door and I sat with my pants and boxers all the way to the floor rather than up around my knees like people usually do in a stall, because no one was supposed to walk in.  \n\nWell the next thing I know I hear someone turn the handle, but to my surprise the next thing I know someone is walking in!  I scramble and shut the stall door and lock it as fast as I can and I hear them say something when they noticed someone was inside, but they promptly left.  I stand up and waddle over to the door and lock it and sit back down and continue on with my business.  The person I was on the phone with was obviously wondering what the fuck was going on and when I tell her what just happened she begins to laugh her ass off and she can't stop laughing and is laughing so hard we have to cut our phone conversation short. \n\nI spend a lot of time hoping whoever it was that walked in on me will be out of proximity of the bathroom by the time I leave.  So I attempt to sneak from the bathroom back to my office but I was spotted by the office secretary who noticeably turns and is obviously wondering who the fuck she walked in on in the bathroom shitting and yeah it was me and she knows it...fuck!\n\ntl;dr: Didn't lock the door and female secretary walks in on me with stall door open and pants around ankles while shitting\n\nEdit: Typo", "tldr": " didn't lock the door and female secretary walks in on me with stall door open and pants around ankles while shitting", "summary_text": "didn't lock the door and female secretary walks in on me with stall door open and pants around my ankles while shitting and she knows it was me", "rougescores": [{"rouge-1": {"f": 0.8571428522448981, "p": 0.75, "r": 1.0}, "rouge-2": {"f": 0.8085106334087823, "p": 0.7037037037037037, "r": 0.95}, "rouge-l": {"f": 0.8837209253001623, "p": 0.7916666666666666, "r": 1.0}}], "compression_ratio": 0.06842105263157895, "original_pos_tags": {"PRP$": 10, "NN": 72, "RP": 2, "RB": 29, "VBN": 9, "WRB": 4, "PRP": 45, "VBP": 20, "NNP": 4, "IN": 56, "CC": 26, ".": 12, "DT": 38, "JJ": 11, "VBZ": 8, "VBG": 13, "VBD": 21, "TO": 11, "VB": 17, "MD": 5, ",": 5, "NNS": 9, "EX": 1, "PDT": 1, "WP": 5, ":": 4}, "summary_pos_tags": {"VBD": 2, "RB": 1, "VB": 1, "DT": 1, "NN": 4, "CC": 3, "NNS": 3, "IN": 5, "PRP": 4, "JJ": 2, "PRP$": 1, "VBG": 1, "VBZ": 1}}
{"original_text": "Let me start off my saying I know it's only forty bucks so its kinda whatever, but just listen. So I went to the dump for my mom, which is about three minutes down the road. I get there with my two bags of trash which costs a buck. I pay the guy and get these ticket things you throw down the chute with the garbage. I put the garbage down the chute and reach in my pocket and grab the stickers and throw em down with the bags. I drive home, let my dogs out, and then empty my pockets so I could take off my jacket and I find the two stickers still in my pocket. So I'm thinking to myself, \"I swear I just threw them down the chute...\" Then it hit me and I reached in my pocket and of course my two nice crisp twenties were missing. So I flew back to the garbage man (going 65 in a 35 with a jeep Cherokee mind you..) almost flipped my jeep on the way, and when I get there I explain the problem to the guy. What does he say? \"Just ran the compressor about a minute ago, sorry bud, keep the two stickers for next time though.\" All I could think was \"Fuck.... FUCK.\" Asked the guy if he knew what reddit was, he was old and of course said no but I told him I was putting it on here despite the fact he was probably thinking \"this kids a fuckin moron..\" Then went home and went directly to my ipad to inform the reddit community how much of a dumbass I am! \n\nTL;DR: threw fuckin 40 bucks down the garbage chute and got back a minute too late to have any hope of getting it back because my dumbass didn't realize it. One expensive trash day. ", "tldr": " threw fuckin 40 bucks down the garbage chute and got back a minute too late to have any hope of getting it back because my dumbass didn't realize it. one expensive trash day. ", "summary_text": "threw fuckin 40 bucks down the garbage chute and got back a minute too late to have any hope of getting it back because my dumbass didn't realize it.", "rougescores": [{"rouge-1": {"f": 0.9206349156664146, "p": 1.0, "r": 0.8529411764705882}, "rouge-2": {"f": 0.9180327819188391, "p": 1.0, "r": 0.8484848484848485}, "rouge-l": {"f": 0.9152542323240449, "p": 1.0, "r": 0.84375}}], "compression_ratio": 0.096816114359974, "original_pos_tags": {"VB": 16, "PRP": 33, "RP": 8, "PRP$": 14, "VBG": 7, "VBP": 13, "VBZ": 5, "RB": 22, "JJ": 9, "NNS": 12, "IN": 28, "NN": 51, ",": 9, "CC": 14, ".": 15, "VBD": 22, "TO": 7, "DT": 33, "WDT": 2, "CD": 9, "MD": 2, "``": 4, ":": 4, "''": 4, "(": 1, "NNP": 6, ")": 1, "WRB": 2, "WP": 2}, "summary_pos_tags": {"NN": 6, "VBZ": 1, "CD": 1, "NNS": 1, "RP": 1, "DT": 3, "CC": 1, "VBD": 2, "RB": 5, "TO": 1, "VB": 2, "IN": 2, "VBG": 1, "PRP": 2, "PRP$": 1, ".": 1}}
{"original_text": "So I decided to take the fiance for a nice meal at a nearby Japanese restaurant. A short trip on the bus would do us nicely...or so i thought...the front seats are priority seats for old people so I led the other half to the back of the bus and sat down.\n\nNot long afterwards my leg started getting a little chilly, no worries I thought, there's just a breeze. After stepping off of the bus and touching the back of my leg I noticed it was wet. Upon a gentlemanly sniff of the offending liquid.....I realized it was pee.\n\nTLDR: Used a bus, made my fiance and I sit in someone else's pee.", "tldr": " used a bus, made my fiance and i sit in someone else's pee.", "summary_text": "used a bus, made my fiance and i sit in someone else's pee, and now we're having to sit in someone else's pee.", "rougescores": [{"rouge-1": {"f": 0.7222222176080247, "p": 0.5652173913043478, "r": 1.0}, "rouge-2": {"f": 0.7058823483737025, "p": 0.5454545454545454, "r": 1.0}, "rouge-l": {"f": 0.8387096725494276, "p": 0.7222222222222222, "r": 1.0}}], "compression_ratio": 0.18739352640545145, "original_pos_tags": {"RB": 11, "PRP": 8, "VBD": 9, "TO": 2, "VB": 2, "DT": 17, "NN": 22, "IN": 12, "JJ": 11, ".": 6, "MD": 1, ":": 4, "CC": 4, "NNS": 5, "VBP": 2, "PRP$": 3, "VBG": 4, ",": 3, "EX": 1, "VBZ": 1, "VBN": 3, "POS": 1}, "summary_pos_tags": {"VBN": 2, "DT": 1, "NN": 7, ",": 2, "PRP$": 1, "CC": 2, "JJ": 1, "IN": 2, "RB": 3, "POS": 2, "PRP": 1, "VBP": 1, "VBG": 1, "TO": 1, "VB": 1, ".": 1}}
{"original_text": "I work in a students union in an office upstairs. My friend works on the reception, right in the middle of the main entrance foyer downstairs. We both are big fans of the walking dead and are both pretty much up to the same point in the series, her always being a few episodes ahead. We love to discuss the show after I have caught up, so I was very excited as I made my way down the stairs one morning to talk about the episode I had watched the previous evening. I was so excited that when I came to the foyer, with my friend behind her desk facing me on the opposite side of the entrance hall, I couldn't help but start lumbering towards her, head cocked, arms writhing and outstretched, loudly snarling, moaning and groaning, doing the best zombie impression I could. I thought it would make my friend laugh, excite her for the upcoming zombie conversation, and also to try and distract her while she dealt with the lone customer who was stood with her back to me, talking to her. The hall was almost empty save the girl with her back to me. As I lurched ever nearer, I was confused as to why my friend was not smiling at my funny joke, but instead looking horrified and almost frozen with panic. It was too late before I realized why. Only two paces from the girl with her back to me, I continued with my brilliant impression, idiotically ignoring my friends grimace and instead increasing the vigor of my performance as I drew nearer.\n\n\nAll at once, with horror, I realized what I was doing. I heard the girls voice as she noticed me and spun around. I could not break character fast enough. We locked eyes, my face contorted, arms akimbo, body bent. She had downs syndrome. She thought I was mocking her. The world stood still as my friend, paralyzed by the proximity of my shame and shock, stared at me, mouth agape. I had no words. I locked eyes with the stranger for what felt like eons before turning tail and fleeing outside.\n\n\nFortunately, there were few people about; the entrance hall and reception area is usually packed, so only the three of us know my cringe-worthy shame. \n\n**TL;DR - People with Downs Syndrome are not likely to appreciate your Zombie impression, no matter how good it is. **", "tldr": " people with downs syndrome are not likely to appreciate your zombie impression, no matter how good it is. **", "summary_text": "** - tried to impress my friend with a zombie impression, ended up making a girl with downs syndrome think i was mocking her. i'm a dumbass.", "rougescores": [{"rouge-1": {"f": 0.3043478212381853, "p": 0.25925925925925924, "r": 0.3684210526315789}, "rouge-2": {"f": 0.1363636315289258, "p": 0.11538461538461539, "r": 0.16666666666666666}, "rouge-l": {"f": 0.18604650669551123, "p": 0.16666666666666666, "r": 0.21052631578947367}}], "compression_ratio": 0.06331976481230213, "original_pos_tags": {"PRP": 42, "VBP": 9, "IN": 49, "DT": 34, "NNS": 16, "NN": 69, ".": 21, "PRP$": 21, "VBZ": 4, ",": 28, "JJ": 24, "VBG": 17, "CC": 13, "RB": 27, "TO": 11, "VB": 11, "VBN": 10, "RP": 1, "VBD": 29, "CD": 3, "WRB": 4, "MD": 4, "JJS": 1, "WP": 3, "JJR": 1, "EX": 1, ":": 3, "NNP": 4}, "summary_pos_tags": {"SYM": 1, ":": 1, "VBN": 1, "TO": 1, "VB": 1, "PRP$": 2, "NN": 8, "IN": 2, "DT": 3, ",": 1, "VBD": 2, "RP": 1, "VBG": 2, "JJ": 2, ".": 2, "VBP": 1}}
{"original_text": "So, to start off I am 13 years old and this all happened last sunday. I was messing around, not thinking, and was swirling a half dollar in between my teeth. As unlucky as I was, it slipped in between my teeth, went down my throat, tried to cough it up, made it even worse, and completely swallowed the damned thing without a problem. I still wonder how I did not choke on it. Well I tell my parents that it was just a qauter to lessen tension on them and go along the week until friday hoping it would pass. My hopes were nothing but crushed as 5 days go by without passage. So on friday we go and get an xray and waddya know, its still stuck in my stomach. Two days go on and were still hoping for the best. Suddenly, my little brother gets a stomach virus and starts vomiting all over. Bad news, since its still in my stomach by then, or as I thought, if I threw up it might come up and I could choke in it. OF COURSE AS LUCK WOULD HAVE IT I WAKE UP ONLY TO START PROJECTILE VOMITING ALL OVER THE DAMN BATHROOM. The quarter didn't come out, luckily, but we still needed to go to the ER to make sure I was safe. So today I spent a good 5 hours in the ER, got two x rays done to find out it passed into my colon. But because it is so big, Theres a chance it might not pass and I would have to get surgery, BUT, theres also the possibility that it could just rip right through my colon causing me the worst pain of my life and giving me a Colin bag for my shit if I live on the outside of my body forever. Of course, thats only a 1% chance, but its still there. JUST, WONDERFUL. I am praying to god I shit this thing out and be done with this burden. **TL;DR** [Accidently swallowed a half dollar, went to the ER, and could actually die if it rips through my colon.]\n\nHeres an update: It has not passed and most likely going to get a tube up the ass and get it pulled out. Pleasant. :<", "tldr": " [accidently swallowed a half dollar, went to the er, and could actually die if it rips through my colon.]", "summary_text": "accidentally swallowed a half dollar, went to the emergency room, and could actually die if it rips through my colon. :'(                                                  ", "rougescores": [{"rouge-1": {"f": 0.8292682876859013, "p": 0.8095238095238095, "r": 0.85}, "rouge-2": {"f": 0.7692307642340566, "p": 0.75, "r": 0.7894736842105263}, "rouge-l": {"f": 0.8292682876859013, "p": 0.8095238095238095, "r": 0.85}}], "compression_ratio": 0.09071618037135279, "original_pos_tags": {"RB": 30, ",": 24, "TO": 11, "VB": 23, "RP": 8, "PRP": 36, "VBP": 10, "CD": 6, "NNS": 8, "JJ": 16, "CC": 20, "DT": 28, "VBD": 25, "NN": 44, ".": 20, "VBG": 10, "IN": 42, "PRP$": 17, "VBN": 5, "RBR": 1, "WRB": 1, "NNP": 28, "MD": 7, "JJS": 2, "VBZ": 10, ":": 3, "RBS": 1}, "summary_pos_tags": {"RB": 2, "VBD": 2, "DT": 2, "JJ": 1, "NN": 4, ",": 2, "TO": 1, "CC": 1, "MD": 1, "VB": 1, "IN": 2, "PRP": 1, "VBZ": 1, "PRP$": 1, ".": 1, ":": 1, "POS": 1, "(": 1}}
{"original_text": "This actually happened a couple weeks ago, but I'll start with how things work. At the UPS hub the loaders get packages that come down the belt from the sort aisle, then you load them into the semi trailer. That trailer might be going to Florida, New York, or another state that your area covers. \n\nWell, sometimes the people that slide the packages down your trailer's chute, slide down the wrong bags that are filled with packages. Well, in the hurry I was in (being peak season and all) I accidentally forgot to check/scan one of the bags. Aaaand it just happened to be bad. The worst one that could come down my belt. It was full of paychecks to the Louisville hub. A hub of 5,000+ workers. And I loaded into a Northern Ohio trailer.\n\nTL;DR I caused an entire hub of 5,000+ people to not get their paychecks for a couple days.", "tldr": " i caused an entire hub of 5,000+ people to not get their paychecks for a couple days.", "summary_text": "forgot to check a bag full of paychecks. caused an entire hub of 5,000+ people to not get their paychecks for a couple days. i'm an idiot.", "rougescores": [{"rouge-1": {"f": 0.7272727225309917, "p": 0.5925925925925926, "r": 0.9411764705882353}, "rouge-2": {"f": 0.714285709569161, "p": 0.5769230769230769, "r": 0.9375}, "rouge-l": {"f": 0.8205128155950033, "p": 0.7272727272727273, "r": 0.9411764705882353}}], "compression_ratio": 0.16626506024096385, "original_pos_tags": {"DT": 21, "RB": 6, "VBD": 8, "JJ": 7, "NNS": 14, ",": 7, "CC": 4, "PRP": 9, "MD": 3, "VB": 8, "IN": 15, "WRB": 1, "VBP": 6, ".": 11, "NNP": 11, "WDT": 4, "NN": 17, "VBG": 2, "TO": 5, "PRP$": 4, "VBZ": 2, "RP": 3, "POS": 1, "VBN": 2, "(": 1, ")": 1, "CD": 3, "JJS": 1, ":": 1}, "summary_pos_tags": {"NN": 4, "TO": 2, "VB": 2, "DT": 4, "JJ": 4, "IN": 3, "NNS": 4, ".": 3, "VBD": 1, "CD": 1, "RB": 1, "PRP$": 1, "VBP": 1}}
{"original_text": "Barely even 10 days ago, my mom got me a brand new samsung galazxy s4 for christmas. Anyways, last night I went to my friends birthday party and after the party ended, my drunk self thought it would be a good idea to walk home. (The walk probably took around 2 hours but luckily it wasn't raining or too cold) Midway through my little adventure home, I realized that I didn't have my phone. The problem here is that I don't remember if I had my phone when I left my friends house. I told my friend what happened and asked him to keep me updated if he finds it or not but I have yet to hear back from him. I'm really worried that it somehow fell out of my pocket when I was walking home. I tried using the android device manager to track my phone but I'm quite sure my phone was out of batteries by the time I tried tracking it down. Best Christmas ever :/ \n\ntldr: got drunk and lost my brand new s4 the day before christmas \n\n", "tldr": " got drunk and lost my brand new s4 the day before christmas ", "summary_text": "got drunk and lost my brand new s4 the day before christmas :/ tldr: got drunk and lost my brand new s4 the day before christmas", "rougescores": [{"rouge-1": {"f": 0.6315789430470914, "p": 0.46153846153846156, "r": 1.0}, "rouge-2": {"f": 0.611111106867284, "p": 0.44, "r": 1.0}, "rouge-l": {"f": 0.9230769181065088, "p": 0.8571428571428571, "r": 1.0}}], "compression_ratio": 0.13822894168466524, "original_pos_tags": {"RB": 16, "CD": 2, "NNS": 6, ",": 4, "PRP$": 12, "NN": 30, "VBD": 20, "PRP": 24, "DT": 8, "JJ": 14, "IN": 15, ".": 7, "NNP": 2, "TO": 5, "CC": 8, "MD": 1, "VB": 7, "(": 1, "VBG": 4, ")": 1, "VBZ": 2, "VBP": 4, "WRB": 2, "WP": 1, "RP": 1, "JJS": 1, "NNPS": 1, ":": 2, "VBN": 1, "PDT": 1}, "summary_pos_tags": {"VBD": 2, "NN": 8, "CC": 2, "VBN": 2, "PRP$": 2, "JJ": 3, "PDT": 2, "DT": 2, "IN": 2, ":": 2, "NNS": 1}}
{"original_text": "I'll admit this didn't just happen today. This was years ago, but I thought you all would enjoy it.\n\nI was 18 years old and had just moved out of my apartment about a month prior. An acquaintance of mine moved into the same apartment 'block' as me a month before I moved out. This is important. \n\nShe held a party one summer evening at her apartment and I attended with some friends. I should say, at the time I was known as a guy that likes to drink. Tonight was no exception. Bring on the whiskey.\n\nCue blackout. \nYou know when you wake up from a night of heavy drinking and your memories are just flashes of pictures. You string them along creating a hazy timeline.\n\nPicture:\nMe stumbling down the stairs\n\n\"I'm hungry...\"\n\nPicture:\nMe standing at the drive through window\n\n\"You need a car to use the drive through. We can't serve you.\"\n\nWhen I wake up after drinking way too much alcohol my consciousness comes in stages. First I became aware of my body. I'm uncomfortable and cold, why do I not have a blanket? What the fuck am I laying on?\n\nA 35lbs weight. \n\nI open my eyes and see I'm sleeping on the ground and in what appears to be a weight room; I was sleeping next to the bench press. Things start churching in my disoriented, hungover mind as I started recognizing my surroundings, and I begin to panic. I was in my old bedroom! \n\nHow the fuck did this happen!?!? I tried thinking of ways out of this. I put my head to the door and could hear voices. A male and a female. Can I climb out the window? No, that's a long fall. There was only one way out of this and I knew what I had to do. \n\nWith my ear against the door I lightly knocked. I heard a gasp and a murmur. There was no turning back now. I opened the door and came out with my hands up. The new apartment owners were an asian couple in their mid 20s and the they were NOT very happy to see me.\n\nI immediately tried to explain that I used to live here, I don't know how this happened, please don't call the cops or kick my ass. I told him I still had a key to the apartment as I was never told to turn it in and never bothered to take it off my keyring. I figured the locks would get changed. I gave him the key and he told me to empty my pockets to show I didn't steal anything. We were at a standstill, and he was seriously considering calling the cops.\n\nAnd do you blame him!? Imagine that! Cooking breakfast with your significant other on a Sunday morning when some haggard looking stranger comes wallowing out of your weight room! How do you react to that?\n\nHe eventually let me go. He told me to never come back to that apartment complex. I agreed and left. I ran faster than i've ever ran. I must have ran a good mile before I stopped and called my friend to pick me up.\n\nApparently I told them I was going to get some food and never came back to the party. Turned my cellphone off and said fuck it. \n\nTLDR: Blacked out. Trespassed.", "tldr": " blacked out. trespassed.", "summary_text": "got blackout drunk, fell asleep in my old apartment and woke up in the middle of the night with my keys in my hand and the new owners in the apartment.", "rougescores": [{"rouge-1": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.0, "p": 0.0, "r": 0.0}}], "compression_ratio": 0.051907872121003784, "original_pos_tags": {"PRP": 73, "MD": 8, "VB": 36, "DT": 59, "VBD": 49, "RB": 33, "NN": 82, ".": 56, "NNS": 18, ",": 9, "CC": 23, "CD": 5, "JJ": 22, "VBN": 9, "IN": 49, "PRP$": 20, "NNP": 7, "POS": 1, "VBZ": 6, "WDT": 1, "TO": 21, "VBP": 19, "WRB": 7, "RP": 8, "VBG": 17, ":": 5, "''": 4, "WP": 3, "UH": 1, "EX": 2, "RBR": 1}, "summary_pos_tags": {"VBD": 3, "RB": 2, "NN": 6, ",": 1, "IN": 6, "PRP$": 3, "JJ": 2, "CC": 2, "RP": 1, "DT": 4, "NNS": 2, ".": 1}}
{"original_text": "So today was pretty horrible for me. Also, throwaway because some people I know at school browse Reddit and this subreddit quite frequently. And the last thing I need is someone to find out all of my dirty secrets\n\nToday was one of the last days of school (last official day for seniors is Friday) and we had gotten our yearbooks last Friday. Everyone has been signing each other's yearbooks and I was happy when I got to my first period because it means that I get to see my crush.\n\nA little background is in order. I'm a girl and so is the girl I like. I am bisexual and I haven't come out of the closet yet and I'm not quite ready to. I plan on doing it soon, but it's not just something I want to do overnight. Anyway, I've liked her for about three years and we are going to different colleges. We have first period together and I would say we're friendly acquaintances but not quite friends.\n\nEarlier in the year I got this bright idea to write a ridiculous love poem that I would put in her locker. I don't know why the hell I decided to do it, but I decided to do it. The poem is okay. It's not too cringy but it's not that bad. It is basically proclaiming my love for her from an anonymous person and saying that I will always have a place in my heart for her.\n\nSo this weekend I printed out the letter and I decided to seal it up nicely and put it in her locker. I left my 0 period class to go put it in her locker so that no one would see me. All went according to plan and I thought I was in the clear. Then I went to first period.\n\nSo in first period we're passing around yearbooks. I had this whole note planned out where I told her how much she impacted my life and etc. It was just supposed to be in a friendly way with no romantic overtones. Then I got distracted and got up for a second. When I came back, I forgot what I was writing. I finished the note and when I went to sign my name, I put a heart next to it with my name which was typical. Then I put \"I love you\".\n\nI didn't realize my mistake until I was handing it back to her. Luckily she doesn't read them until after we're done at school, but I'm freaking out about the consequences of this. I'm sure someone will notice and say something.\n\nAlso, I'm not the kind of girl who says \"I love you\" randomly to other girls. It seems out of place when I do it and almost everyone knows. So there isn't any writing this off as an accident.\n\nTL;DR : Put a love poem in the girl that I have liked for a while's locker. Then accidentally signed \"I love you\" in her yearbook.", "tldr": " put a love poem in the girl that i have liked for a while's locker. then accidentally signed \"i love you\" in her yearbook.", "summary_text": "put a love poem in my crush's locker, forgot about it, signed it \"i love you\" instead of \"i love you\" in her yearbook.", "rougescores": [{"rouge-1": {"f": 0.4999999950000001, "p": 0.5, "r": 0.5}, "rouge-2": {"f": 0.391304342826087, "p": 0.391304347826087, "r": 0.391304347826087}, "rouge-l": {"f": 0.4999999950125001, "p": 0.5263157894736842, "r": 0.47619047619047616}}], "compression_ratio": 0.046420141620771044, "original_pos_tags": {"RB": 44, "NN": 62, "VBD": 31, "JJ": 33, "IN": 50, "PRP": 77, ".": 34, ",": 8, "DT": 38, "NNS": 15, "VBP": 26, "NNP": 7, "CC": 23, "VBZ": 15, "TO": 18, "VB": 21, "RP": 6, "PRP$": 19, "CD": 3, "(": 1, ")": 1, "VBN": 10, "VBG": 11, "POS": 2, "WRB": 7, "MD": 5, "RBR": 1, "WP": 2, "WDT": 1, "``": 3, "''": 3, "EX": 1, ":": 2}, "summary_pos_tags": {"VB": 1, "DT": 1, "NN": 5, "IN": 4, "PRP$": 2, "POS": 1, ",": 2, "VBD": 2, "PRP": 4, "``": 2, "JJ": 2, "VBP": 2, "''": 2, "RB": 1, ".": 1}}
{"original_text": "Let me preface this with the acknowledgement that no, I am not a genius, but I *am* a reasonably smart guy. Unfortunately, I am nontheless a *guy*, which also means when I'm horny, I'm motherfuckin *horny*. \n\nI recently got a pretty gorgeous girlfriend who is also into Harry Potter and is generally pretty fantastic. It was a really insane story for another thread, but basically, she is/was the \"it girl\" on campus and has been around. One night, after watching Night at the Mueseum 2 (solid motion picture btw), we were swapping weird sex stories. She was kicking my ass, of course, as she had known more guys than I had girls. She mentioned one guy who was really into ass play. Apparently, he had had the most intense orgasm she's ever seen. Couple minutes later, we bang, something something basilisk in her Chamber of Secrets. Sex is fun.\n\nWell, a couple days later I got curious. I decided that I needed to try ass play. Don't ask me the reasoning; I had it in my head (and later I would have it in my butt) that this was the only way to go for now. I looked around for something to use, but weirdly didn't have much to work with. Finally, I found an empty [blackberry Izze bottle] (http://i.imgur.com/ICPYhjc.jpg) that looked okay. I think even then I knew it wasn't my best idea, but I was also determined that *this empty beverage was gonna go in my butt, god damnit*.\n\nIt started off well. I had watched a little porn to understand what to do. You may not realize it, but the male prostate is only a couple inches past the anus; I didn't have to go deep. Nonetheless, I was enjoying it moderately and pushed my limits. I don't think it would have been my greatest orgasm, but then I never found out, so maybe I should reserve judgment. Anyway, I challenged myself to go deeper and deeper. By butthole was not used to this, and in a way it was like a competition with myself to prove that if I wanted to, I could get some surgery and star in Backdoor Sluts 12. It was enjoyable, if stressful. Then it got bad.\n\nI was doing this in my bedroom, ass in the air. Little did I notice how I had inched toward my low, wooden nightstand. I became a tad bored, I suppose, and with 1/2 the bottle from the opening up my ass and unaware of my future despair, I made the biggest mistake of my life: I jerked my ass up, slamming the bottle into the nightstand and **shattering the bottle inside my asshole.**\n\n**WHAT THE FUCK. JESUS. AWWW LORD REEKIS SOMEONE HELP THE FUCK MY BUTTHOLE MY BUTTHOLE JESUS FUCKING CHRIST!** The pain was the greatest I have felt in my life; the panic of the shattering, I believe, had caused my anus to close as tight as possible, trapping the broken glass inside. Furthermore, as I immediately slammed by ass to the ground, the glass inside further shattered. Imagine *pieces of broken fucking glass, too big for your rectum, desperately poking and clawing from the inside to escape, as your poor ass bleeds from the wounds inside*. Worse yet, simply *farting* caused the glass to sink deeper into my rectum. Yes, the slighest bowel gas or movement increased my pain ten-fold. I called the hospital and got an ambulence sent; they rushed me there (on a bumpy highway, mind you) and three hours later I was in surgery. I'm in a hospital bed now, and I can't look any of the nurses in the eye. Most of them giggle when they go over any treatments because they know what happened. My girlfriend literally cannot look at me without cracking up. She has taken to calling me Glass-ass, or the Broken Butthole.\n\n**TL;DR, I tried putting a bottle in my ass and it shattered, plunging me ino an infinity of pain and permanently bruising my manhood. Also, my rectum.**", "tldr": ", i tried putting a bottle in my ass and it shattered, plunging me ino an infinity of pain and permanently bruising my manhood. also, my rectum.**", "summary_text": "tried ass play with an empty beverage in my butt, but it didn't work and now my girlfriend thinks i'm an asshole.", "rougescores": [{"rouge-1": {"f": 0.31999999507200005, "p": 0.36363636363636365, "r": 0.2857142857142857}, "rouge-2": {"f": 0.04166666174479225, "p": 0.047619047619047616, "r": 0.037037037037037035}, "rouge-l": {"f": 0.22222221728395072, "p": 0.25, "r": 0.2}}], "compression_ratio": 0.030648223487930566, "original_pos_tags": {"VB": 28, "PRP": 77, "DT": 56, "IN": 68, "NN": 110, ",": 49, "VBP": 18, "RB": 52, "CC": 25, "JJ": 34, ".": 43, "WDT": 1, "VBZ": 10, "WRB": 3, "VBD": 54, "WP": 4, "NNP": 38, "``": 1, "''": 1, "VBN": 15, "CD": 6, "VBG": 17, "(": 4, ")": 4, "NNS": 13, "PRP$": 25, "RBR": 1, "RBS": 1, "TO": 17, ":": 7, "MD": 7, "JJS": 6, "RP": 4, "JJR": 2, "UH": 1, "EX": 1}, "summary_pos_tags": {"VBN": 1, "NN": 6, "IN": 2, "DT": 2, "JJ": 2, "PRP$": 2, ",": 1, "CC": 2, "PRP": 1, "VBD": 1, "RB": 2, "VB": 1, "VBZ": 1, "VBP": 1, ".": 1}}
{"original_text": "Left the bar and stopped at my GF's house. Her little sister was asleep, parents at work, little brother out. She was supposed to pick him at at 11, and it was only 10:20pm. So out of no where she starts fooling around with me, turns to a BJ, but I'm buzzed so I tell her I cant finish and she tells me just to fuck her. I do, right there on the couch. But since her sister was in the house too (and me being a drunk genius) decide to leave our clothe on to be safe. I pull her shorts and panties halfway down her legs, my cock was already out, but pants still on. We bang it out, her legs over my shoulders and I finished after about 5 minutes (intended quicky). I go to the bathroom and she heads to her bedroom. I come out, see her on her bed, and bone her again. But being drunk and just cumming less than 2 minutes before, I lost my hard on after about 5 minutes. We pack up and head back to living room, and she has a text from her brother \"You are dirty ;)\". yes a winky face! turns out he walked home early, saw us through the front door, dont know what happened next, but he waited until we went into her room to sneak downstairs to his room. She went down to talk to him and she asked him what he saw he said \"you on the couch\". I wouldnt be surprised if he stood there watching.\n\n**TLDR;** Drunkenly boned girlfriend on her couch and her brother saw us, sent her a creepy text", "tldr": "** drunkenly boned girlfriend on her couch and her brother saw us, sent her a creepy text", "summary_text": "drunkenly boned girlfriend on her couch and her brother saw us, sent her a creepy text. i'm not sure if he's watching or not.", "rougescores": [{"rouge-1": {"f": 0.7804878000237954, "p": 0.6666666666666666, "r": 0.9411764705882353}, "rouge-2": {"f": 0.7692307643918476, "p": 0.6521739130434783, "r": 0.9375}, "rouge-l": {"f": 0.7777777729166667, "p": 0.6666666666666666, "r": 0.9333333333333333}}], "compression_ratio": 0.09012256669069935, "original_pos_tags": {"VBD": 23, "DT": 12, "NN": 33, "CC": 19, "IN": 30, "PRP$": 20, "NNP": 3, "POS": 1, ".": 16, "JJ": 10, "RB": 19, ",": 17, "NNS": 11, "PRP": 39, "VBN": 3, "TO": 12, "VB": 11, "CD": 5, "WRB": 1, "VBZ": 6, "VBG": 5, "VBP": 11, "(": 2, ")": 3, "RP": 5, "JJR": 1, "``": 2, ":": 2, "''": 2, "WP": 2, "EX": 1}, "summary_pos_tags": {"RB": 3, "VBN": 1, "NN": 5, "IN": 2, "PRP$": 2, "CC": 2, "VBD": 2, "PRP": 3, ",": 1, "DT": 1, ".": 2, "VB": 1, "VBP": 1, "JJ": 1, "VBZ": 1, "VBG": 1}}
{"original_text": "This guy calls in, we'll call him Rick since that's his name and he's an asshole. \n\nRick calls in and starts screaming at me:    \n\nR: Listen! You tried to rip me off.    \n\nMe: I'm sorry, what happened?    \n\nR: I was just in your store and you told me I could only get $10 for a coin that's worth $300!!!!    \n\nMe: I do apologize sir, I didn't get your name? Also do you have the right business? I open at 10am and it's 10:05am. I haven't had a customer today. What was the name of the business you're looking for.    \n\nR: IT'S YOU YOU ASSHOLE! I was JUST in there. I talked to you! My name is Rick since you need to know so bad!!!    \n\nMe: What is the name of the person I spoke with?    \n\nR: STOP BEING STUPID! JUST FUCKING LISTEN....   \n\n\nNow it's at this moment in a phone call like this I hang up BUT I'm having a good morning and I want to see where this goes so I let him continue:    \n\n\nR: This coin online says it's worth $300!    \n\nMe: That coin you have specifically? Is it in a case of some kind?    \n\nR: NO!    \n\nMe: Well I do apologize sir. We can't guarantee THAT coin specifically is worth that amount unless it's been professionally graded and cased. We can certainly try to get as close to that value as possible but I would need to look at it first.    \n\nR:....Where are you located.\n\nThis is where I throw my punch in...metaphorically speaking...    \n\nMe: We're in the same location you were just at.    \n\nR: WHICH IS!? YOU KNOW WHAT....HOW DO YOU STAY IN BUSINESS WITH YOUR SMART MOUTH?    \n\n*I mute the phone Me: By putting it on your moms box.*     \n\nR: I WAS TREATED POORLY BY THE GUY IN THERE AND I WAS LIED TO! I DEMAND TO KNOW YOUR NAME    \n\n*mute the phone: BJ Cobbledick*    \n\nR: AND WHO YOUR SUPERVISOR IS!    \n\nMe: The guy who films your mom and I fucking.    \n*Mute the phone*    \n\nR: WHAT!?    \n\n\n\nNow all the yelling and verbal beating is warranted. He said he would be down and that he expects to see my supervisor. Hopefully he goes back to the place he went to the first time or he was just blowing smoke and won't do anything at all.    \n\n    \n\n    \n\nTL;DR: I told an angry \"customer\" over the phone I fucked his mom while someone filmed it. \n\n\n\n", "tldr": " i told an angry \"customer\" over the phone i fucked his mom while someone filmed it. ", "summary_text": "told a guy he could only get $10 for a coin that's worth $300. he screamed at me and called me a dumbass and now he expects to see my supervisor.", "rougescores": [{"rouge-1": {"f": 0.04166666209201439, "p": 0.03225806451612903, "r": 0.058823529411764705}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.04878048304580653, "p": 0.04, "r": 0.0625}}], "compression_ratio": 0.06642235455794777, "original_pos_tags": {"DT": 33, "NN": 65, "VBZ": 23, "IN": 32, ",": 3, "PRP": 56, "MD": 7, "VB": 21, "NNP": 49, "PRP$": 9, "CC": 13, ".": 44, "VBG": 7, ":": 29, "VBD": 19, "TO": 10, "RP": 2, "VBP": 22, "JJ": 11, "WP": 6, "RB": 25, "$": 3, "CD": 5, "WDT": 1, "WRB": 2, "VBN": 6, "EX": 1, "UH": 1, "NNS": 1, "PDT": 1, "``": 1, "''": 1}, "summary_pos_tags": {"VBD": 3, "DT": 3, "NN": 4, "PRP": 5, "MD": 1, "RB": 2, "VB": 2, "$": 2, "CD": 2, "IN": 2, "WDT": 1, "VBZ": 2, "JJ": 1, ".": 2, "CC": 2, "TO": 1, "PRP$": 1}}
{"original_text": "I was a freshman in high school. I was in my last period class, Biology. Of course, my ADD kicked in and it was extremely hard for me to concentrate on what the teacher was talking about.\nSo I pull out a small spiral, with like 200 pages in it.\nEarlier that week, I had started a sort of insider with my friends to make a new type of meme called \"Sometimes I\" jokes. These jokes always began by saying \"Sometimes I\" and never made any sense whatsoever. Especially not to someone who wasn't in on the joke.\nIf I remember correctly, here was one of the jokes:\n\"Sometimes I pretend I'm John Lennon and fondle Mojo Jojo's tits.\"\nLike I said, these jokes had absolutely no point to them. At all.\nThere I was, writing in that notebook, when my Biology teacher realized I wasn't paying attention. She walked over to my desk, took my spiral, and continued teaching. In my mind I was panicking. I was so scared. After class, she called me up to her desk, and the worst thing imaginable happens... She opens the spiral. \nWith my terrible luck, she of course happened to flip to the worst joke in the whole book:\n\"Sometimes I rip my balls off with a chainsaw and then staple them back together.\"\nWhat the fuck was I thinking when I wrote those? I was immediately sent to the principal, my parents were called, and every joke was read to them. Every. Single. One.\nTL;DR I wrote hundreds of dumb jokes in a notebook and my parents, teacher, and principal think I'm mentally unstable.", "tldr": " i wrote hundreds of dumb jokes in a notebook and my parents, teacher, and principal think i'm mentally unstable.", "summary_text": "i wrote hundreds of dumb jokes in a notebook and my parents, teacher, and principal think i'm mentally unstable. i was sent to the principal, my parents were called, and every joke was read to them.", "rougescores": [{"rouge-1": {"f": 0.690909086386777, "p": 0.5277777777777778, "r": 1.0}, "rouge-2": {"f": 0.6792452785332859, "p": 0.5142857142857142, "r": 1.0}, "rouge-l": {"f": 0.7499999953125, "p": 0.6, "r": 1.0}}], "compression_ratio": 0.1346938775510204, "original_pos_tags": {"PRP": 31, "VBD": 27, "DT": 23, "NN": 39, "IN": 31, "JJ": 14, ".": 22, "PRP$": 12, ",": 17, "NNP": 9, "VBN": 6, "CC": 10, "RB": 20, "TO": 10, "VB": 4, "WP": 3, "VBG": 7, "VBP": 6, "RP": 3, "CD": 3, "NNS": 13, "RBR": 1, "``": 2, "''": 6, ":": 4, "POS": 1, "EX": 1, "WRB": 2, "JJS": 2, "VBZ": 1}, "summary_pos_tags": {"JJ": 4, "VBD": 4, "NNS": 4, "IN": 2, "DT": 3, "NN": 7, "CC": 3, "PRP$": 2, ",": 4, "VBP": 1, "RB": 1, ".": 2, "VBN": 3, "TO": 2, "PRP": 1}}
{"original_text": "A bit of background: I'm almost certain that I have an overactive bladder.\n\nIt's an incredibly windy day in the city that I reside in. I'm driving through an industrial area where there is quite a bit of crime, and therefore are virtually no public restrooms as they most likely would be frequented by rapists and junkies. I had drank heavily the evening before this, and had worked out during the morning, so I'm filled with water to rehydrate me from both activities. It hits me like a brick wall - I MUST pee, or I'm going to pee my pants. I pull into a gas station parking lot, run inside, and am told that they aren't allowed to let customers into the bathroom for safety reasons - fuck. Out of desperation, I walk next to the building and have an internal debate: Do I urinate in this parking lot? No, too many people and not an offense I need. I run back to my vehicle, and begin driving down the road praying for a restroom\n\n...and that's when I spot it. \n\nI haven't driven one block when I see the abandoned gas station with a lone porta-potty in the vacant dirt lot right next to it. I wouldn't normally use such a horrible facility, but it was either this or the seat of my car. I pull right up to the porta-potty, jump out and (leaving my car running) bust inside. As I'm taking an insanely high-pressure piss (this stream was truly powerful), I feel it...that...feeling in the rear. \n\nI try to hold the rear-end's contents in, but the sheer force from my bladder is causing everything in that entire region to let loose. I had my options: I can either, as a grown man, poop my pants, or pee on the porta-potty wall. I figured I had peed on less appropriate things at this age, and swung around while jerking my pants down to my ankles. \n\nAs I begin, as my friend once put it, \"chocolate shotgunning\" into the general area of the toilet, while still pissing all over in front of/on me, the wind, which has begun to pick up drastically, rips the porta-john door completely open. It is then that I first see another vehicle pulling into the parking lot.\n\nAs the truck pulls in, I frantically finish my business. A man exits the vehicle, begins to walk up, and I hurry to pull my pants up over my poop-covered butt and semi-soaked front. \n\nI exit my box of shame that is the porta-potty, and quickly close the door to it. As I turn and begin waddling toward my vehicle, he stops to talk to me for a few seconds about how windy it is. After nodding my head and smiling, I speed-walk to my vehicle as he opens the door to my mess. \n\nI couldn't bring myself to look in that direction, and sped out of the parking lot as fast as I could. \n\ntl;dr - Pooped and peed all over a porta-potty while the door was ripped open by the wind. Additionally, a kind old man was then exposed to my shameful doing.\n\n", "tldr": " pooped and peed all over a porta-potty while the door was ripped open by the wind. additionally, a kind old man was then exposed to my shameful doing.", "summary_text": "peed my pants in a porta-potty, wind ripped the porta-john open, and a man walked in to see me piss all over myself.", "rougescores": [{"rouge-1": {"f": 0.4705882303421761, "p": 0.5217391304347826, "r": 0.42857142857142855}, "rouge-2": {"f": 0.04081632158267449, "p": 0.045454545454545456, "r": 0.037037037037037035}, "rouge-l": {"f": 0.26086956025519853, "p": 0.2857142857142857, "r": 0.24}}], "compression_ratio": 0.04135472370766488, "original_pos_tags": {"DT": 58, "NN": 91, "IN": 65, ":": 10, "PRP": 53, "VBP": 28, "RB": 35, "JJ": 37, ".": 26, "VBZ": 15, "VBG": 14, "WRB": 4, "EX": 1, ",": 31, "CC": 22, "NNS": 16, "RBS": 1, "MD": 5, "VB": 21, "VBN": 12, "VBD": 11, "RP": 4, "TO": 20, "NNP": 2, "PRP$": 19, "UH": 1, "CD": 1, "(": 2, ")": 2, "POS": 1, "JJR": 1, "``": 1, "''": 1, "WDT": 2, "SYM": 1}, "summary_pos_tags": {"VB": 3, "PRP$": 1, "NNS": 1, "IN": 3, "DT": 4, "JJ": 3, ",": 2, "NN": 2, "VBD": 1, "CC": 1, "VBN": 1, "TO": 1, "PRP": 2, ".": 1}}
{"original_text": "Average day at work, not too busy, not too slow either, I just recently quit drinking so I'm not completely focused today not that my job really requires my 100% focus 100% of the time anyways so I'm getting by just fine. I'm getting ready to go on my break while waiting for another co worker to come in at 5, he's usually late so I decided to just go before he gets there, figure what's a few minutes anyways. So I head up stairs to get my headphones so I can drown out whoever's outside, I walk out of the department and quickly glance behind me to if he's there. BAM. I hear a crack, fuck my first reaction was I knocked something over and it smashed on the ground. Nope, I turn around to see this little girl her head laying on the floor and beginning to cry her fucking eyes out. Her mom runs over and picks her up with my apologizing relentlessly, even after I come back down the stairs with my stuff. Still feel fucking horrible about this, she seemed to be ok just upset like any kid would be but still can't stop thinking about it and how that little girls doing now.\n\nTL;DR Turn around for a split second, little girl goes down.", "tldr": " turn around for a split second, little girl goes down.", "summary_text": "went up stairs to get my headphones, knocked a little girl to the ground and made her cry. still feel horrible about it and can't stop thinking about it.", "rougescores": [{"rouge-1": {"f": 0.15384615003287322, "p": 0.10344827586206896, "r": 0.3}, "rouge-2": {"f": 0.054054050372534954, "p": 0.03571428571428571, "r": 0.1111111111111111}, "rouge-l": {"f": 0.17142856734693887, "p": 0.12, "r": 0.3}}], "compression_ratio": 0.13432835820895522, "original_pos_tags": {"JJ": 14, "NN": 29, "IN": 29, ",": 11, "RB": 29, "CC": 7, "PRP": 19, "VBD": 6, "VBP": 9, "VBN": 2, "PRP$": 11, "VBZ": 8, "CD": 3, "DT": 13, "VBG": 9, ".": 9, "TO": 8, "VB": 12, "WP": 2, "NNS": 7, "MD": 3, "RP": 4, "POS": 1, "NNP": 5, "WRB": 1, ":": 1}, "summary_pos_tags": {"VBD": 3, "RB": 3, "NNS": 2, "TO": 2, "VB": 3, "PRP$": 2, ",": 1, "DT": 2, "JJ": 2, "NN": 3, "CC": 2, ".": 2, "IN": 2, "PRP": 2, "MD": 1, "VBG": 1}}
{"original_text": "So my day pretty much sucked.\nLet's start off with the shitty morning of me waking up early at 7:30. So I just sit on my couch and recollect my thoughts of my daily chores. Half asleep, my mother comes upstairs saying we need to help my 90-year-old grandmother.\n\n**SHIT JUST HIT THE FAN**\n\nSo we scarf down a leftover pancake and head out to the car. We drive 2 blocks down the street to my grandmothers crappy old house. We push her out in her rickety old wheelchair to the 90 degree car, as she bitches and moans about how she doesn't wand to go outside and \"She wants to stay home and catch up on her shows.\" Now mind you when shes home she constantly complains about being lonely.\n\nShe does have a caretaker who does not speak fluent English, so when you combine that with a defective-hearing old lady, you get a serious tornado of confusion. We drive to the mall and walk around Macy's and all the terrible woman stores that my mother drags me to.\n\nBut, after about 3-4 hours, we decide it's insanely hot and why not get some ice-cream? Ohhh ho ho hooo! That was the moment of truth! We drove to Wendy's and ordered four chocolate Frosty Shake Things. We drive around the neighborhood so everyone can indulge on the fine delicacy that is chocolate. But this was no delicacy....this was Satan's very shit in my cup. After about 2/3 of my ice cream demolished by my sweet tooth... I felt a shit coming on.\n\nSo I asked my Mom to politely pull in front of my house so I may rush to the bathroom. I sit down as a stream of brown liquid floods the porcelain throne in which I sit. Oh god the full blown squirts. 4 times in the past 2 hours have I shit the milky ooze. My toilet is clogged and I still have to shit. At this point my anus has the grand canyon tearing through my buttcheeks.\n\nI take a shower to cleanse by bungholio of its pain. I apply some cream to stop the burn. That was a **MISTAKE**! I've never felt such pain in my ass it cannot be put into words. And it still burns now. An hour later.\n\nTL;DR I ate a Wendy's frosty, got the shits, burned and tore my butthole into a gateway to oblivion, and clogged my only toilet", "tldr": " i ate a wendy's frosty, got the shits, burned and tore my butthole into a gateway to oblivion, and clogged my only toilet", "summary_text": "ate a Wendy's frosty, got the shits, burned and tore my butthole into a gateway to oblivion, and clogged my only toilet", "rougescores": [{"rouge-1": {"f": 0.9333333283358024, "p": 0.9545454545454546, "r": 0.9130434782608695}, "rouge-2": {"f": 0.8837209252352624, "p": 0.9047619047619048, "r": 0.8636363636363636}, "rouge-l": {"f": 0.9230769180802104, "p": 0.9473684210526315, "r": 0.9}}], "compression_ratio": 0.05573770491803279, "original_pos_tags": {"RB": 21, "PRP$": 22, "NN": 69, "JJ": 30, "VBN": 6, ".": 29, "VB": 19, "POS": 5, "RP": 7, "IN": 43, "DT": 35, "PRP": 34, "VBG": 5, "CD": 7, "CC": 15, "NNS": 15, "NNP": 18, ",": 9, "VBZ": 13, "VBP": 20, "TO": 15, "WRB": 4, "``": 1, "''": 1, "WP": 1, "PDT": 1, "VBD": 11, "MD": 3, "WDT": 2, ":": 3, "JJR": 1}, "summary_pos_tags": {"VB": 2, "DT": 3, "NNP": 1, "POS": 1, "NN": 5, ",": 3, "VBD": 2, "NNS": 1, "VBN": 1, "CC": 2, "PRP$": 2, "IN": 1, "TO": 1, "JJ": 1}}
{"original_text": "Yesterday evening my mother and I were walking through the mall. I turned my head to the left and saw a beautiful casual dress in the window of Hot Topic: black with a pink \"galaxy\" pattern and white stars. It looked like someone had put pictures from a telescope on it. \n\nSeeing that the dress was only twenty five dollars, my mom agreed to buy it for me as a reward for my good grades if they had it in my size. I went inside, and a very nice but pushy saleslady showed me to the dressing room in the back to try it on. \n\nThere was a rather short velvet curtain covering the entrance. It was knee-height on me and had to be hooked to the side of the wall. I stood in the middle of the dressing room so I couldn't be seen through the small gap between the curtain and the wall, and to read an article about Death Cab for Cutie that was pasted to the low ceiling. \n\nAt that moment, I decided I wanted to see how the dress would look with the high-tops I was wearing at the moment. After struggling to get my jeans off over my giant feet, I realized the shoes looked stupid and tried to take them off. This was where the fuckup came.\n\nFor some odd reason, I didn't sit down on the nearby bench or lean on a wall. I stood in the middle of the closet-sized room on one leg and began trying to pull off my right shoe. However, the shoelaces are too small and even with the bow undone I couldn't get it off. Instead of merely sitting down, I continued to pull at the shoe, balancing there.\n\nA fireball of pain exploded in my left thigh, the leg I was balancing on. In my quest to remove my shoe, I had been putting a lot of strain on my left thigh muscle, which now gave out. The sudden pain made me lose my balance and I pitched forward, falling through the velvet curtain and onto the floor of the Hot Topic. \n\nThe dress took this opportunity and fly up, exposing my underwear and the back of my bra. The pushy saleslady grabbed a clothes rack on wheels and rolled it forward to shield me from the rest of the store, but I know a few people saw me. Five minutes later I staggered out, limping, and we bought the dress. \n\n**TL;DR Didn't sit down while taking off my shoes, got a cramp, exposed myself to a store full of special snowflakes.**", "tldr": " didn't sit down while taking off my shoes, got a cramp, exposed myself to a store full of special snowflakes.**", "summary_text": "didn't sit down while taking off my shoes, got a cramp, fell through a velvet curtain and exposed myself to a store full of special snowflakes.", "rougescores": [{"rouge-1": {"f": 0.8510638248438207, "p": 0.7692307692307693, "r": 0.9523809523809523}, "rouge-2": {"f": 0.7999999950617285, "p": 0.72, "r": 0.9}, "rouge-l": {"f": 0.8636363586776858, "p": 0.7916666666666666, "r": 0.95}}], "compression_ratio": 0.06392489941886455, "original_pos_tags": {"NN": 73, "VBG": 15, "PRP$": 16, "CC": 19, "PRP": 36, "VBD": 40, "IN": 53, "DT": 55, ".": 22, "TO": 16, "JJ": 28, "NNP": 9, ":": 2, "``": 1, "''": 1, "NNS": 15, "VBN": 7, "RB": 19, "CD": 3, ",": 19, "VB": 19, "EX": 1, "MD": 3, "WDT": 2, "WRB": 2, "RP": 10, "VBP": 2}, "summary_pos_tags": {"VBD": 4, "RB": 1, "VB": 1, "RP": 2, "IN": 3, "VBG": 1, "PRP$": 1, "NNS": 2, ",": 2, "DT": 3, "NN": 4, "CC": 1, "PRP": 1, "TO": 1, "JJ": 2, ".": 1}}
{"original_text": "*Using a throwaway because well, who knows who reads this site. Anyway, I never thought I would be worthy of a post here. Not because I think I'm perfect, but because my fuck ups usually are not that notable. I was wrong.*\n\nLet me set the scene for you: My wife and I just moved in with some family. Now by family, I mean grandmas house, her parents live here too, her sister and sisters husband, and their two kids. Not a huge house. Very Christian household. Anyway, we are currently stationed in a family room because all the bedrooms are occupied. We have a door to the outside that just so happens to be on the same outer wall as a door into a laundry room and office where the main door is left open and only the screen is in place. Now this sounds like no big deal, but to get into the house we have to go outside and back in through that office door. (We have the official doorway inside blocked) So I, as male, love peeing outside. \n\nAround 3am I wake up, feel the urge, and meander on out the door. At night, I don't make it in the other door. Why? Nobody is awake. PEE OUTSIDE! Ahhhhhhhhhh, sweet release. Well, also as male, I had a little chub going on down there. I figured \"What the hell, I am going to fap one out right here. Then I will go right back to sleep all comfy\" Proceed to a few minutes of outdoor, cool breeze fapping. It was glorious. Truly unlike any fap sesh in at least a year. I HEAR SOMEONE! Peek...look normal (dick in hand), nobody. Whew, scary. Well, it is three am. Why would anyone be in this secluded area of the house? \n\nProceed, and finish on lawn. Another sweet release. Much better this time. And then the inner door behind me shuts with such ferocity it is as if Dwayne Johnson was the mysterious being on the other side of that opaque window. What had they seen? Who was it? My mind races. I stand there for another couple minutes, then go back in. No sounds outside our room. I wake up this morning, nobody has said anything to my wife or I. I now live in a constant state of fear; fear of when or if I get asked what happened last night on the patio...\n\n***Reddit, today I fucked up.***\n\n**TL;DR** I may have incidentally met Dwayne Johnson.", "tldr": " i may have incidentally met dwayne johnson.", "summary_text": "fapped outside in the middle of the night in front of my wife's family. now living in a constant state of fear of being questioned about it.", "rougescores": [{"rouge-1": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-2": {"f": 0.0, "p": 0.0, "r": 0.0}, "rouge-l": {"f": 0.0, "p": 0.0, "r": 0.0}}], "compression_ratio": 0.06398537477148081, "original_pos_tags": {"VBG": 5, "DT": 42, "NN": 77, "IN": 52, "RB": 35, ",": 26, "WP": 6, "VBZ": 11, ".": 39, "NNP": 15, "PRP": 34, "VBD": 12, "MD": 4, "VB": 16, "JJ": 37, "VBP": 20, "CC": 13, "PRP$": 7, ":": 5, "NNS": 8, "CD": 4, "VBN": 7, "PDT": 1, "TO": 8, "WDT": 1, "WRB": 4, "(": 2, ")": 2, "RP": 4, "``": 1, "''": 1, "JJS": 1, "UH": 1, "RBR": 1}, "summary_pos_tags": {"VBN": 2, "IN": 9, "DT": 3, "NN": 7, "PRP$": 1, "POS": 1, ".": 2, "RB": 1, "VBG": 2, "JJ": 1, "PRP": 1}}
